{"title":"The Way of St. John of the Cross: A Guide Through the Dark Night","uid":11519022,"size":184685636,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:00acb5d9f33823b14d65e2a856b5ec6080bf85b8&amp;dn=The+Way+of+St.+John+of+the+Cross%3A+A+Guide+Through+the+Dark+Night&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":8,"time":1416473766,"description":"Is there a true seeker among us who has not endured what St. John of the Cross first called the &quot;dark night of the soul&quot; - a crisis, a betrayal, a sadness seeming without end? On The Way of St. John of the Cross, you will meet this towering figure - mystic, poet, healer of souls, and lover of God - and hear how this great explorer of mystical experience left an unfailing map to guide us through the &quot;dark nights&quot; of our own lives, one that promises eternal joy to all with the courage to follow it. Scholar and author Susan Muto offers a new and accessible approach to St. John's &quot;secret wisdom of dark contemplation,&quot; and brings to life the full glory of his story, and the sacred ideal of mysticism and service that he embodied. Mining the four great masterpieces St. John wrote (at times on mule back, and as a prisoner in his own monastery), Muto immerses us in the transformational concepts, symbols, and metaphors at the heart of St. John's writing. His message is clear: the events which stretch our faith to the breaking point are in fact our greatest teachers. Without them, St. John taught, it is virtually impossible to know the truth of the spiritual life, and the perfection of divine love. With many vivid examples from John's own extraordinary love affair with God, here is a trustworthy and uplifting guide to dwelling in the &quot;blessings darkness bestows on us,&quot; with The Way of St. John of the Cross","torrent":{"xt":"urn:btih:00acb5d9f33823b14d65e2a856b5ec6080bf85b8","amp;dn":"The+Way+of+St.+John+of+the+Cross%3A+A+Guide+Through+the+Dark+Night","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00acb5d9f33823b14d65e2a856b5ec6080bf85b8","infoHashBuffer":{"type":"Buffer","data":[0,172,181,217,243,56,35,177,77,101,226,168,86,181,236,96,128,191,133,184]},"announce":[],"urlList":[]}}