{"title":"Patents for Business: The Manager's Guide to Scope, Strategy, an","uid":8737064,"size":1480220,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00ad879cf47a782bc0f3eec0aee30661c2596278&amp;dn=Patents+for+Business%3A+The+Manager%27s+Guide+to+Scope%2C+Strategy%2C+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tmPhoneix","files":1,"time":1374699580,"description":"In a world where your intellectual property is your most valuable asset, patents are becoming an essential tool for achieving and maintaining a competitive edge. With billions of dollars at stake, companies are defending their patents vigorously; high-profile cases, such as Microsoft's $900 million patent dispute settlement with Sun Microsystems, and Medtronic's acquisition of a competitor's entire patent portfolio for $1.35 billion, are cases in point. While most companies will not operate at this level, the strategic management of patents, and the costs of enforcing and defending them, are becomining critical business functions.\n\nIn this accessible and practical guide, Henry Heines shows readers how to apply due diligence, a common concept in corporate finance and investing, to analyze the costs and benefits of patent management, and to navigate through the legal and technical maze. With dozens of examples from many industries, he walks readers through the various ways in which technological advances can be presented as patentable inventions and in which the patents of competitors can be confronted and evaluated. He also offers guidance in managing a portfolio of patents and inventions, regardless of whether they make it to market as products. A glossary of terms and listing of resources will make this book a handy reference for anyone involved in product development, corporate strategy, or intellectual property.","torrent":{"xt":"urn:btih:00ad879cf47a782bc0f3eec0aee30661c2596278","amp;dn":"Patents+for+Business%3A+The+Manager%27s+Guide+to+Scope%2C+Strategy%2C+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00ad879cf47a782bc0f3eec0aee30661c2596278","infoHashBuffer":{"type":"Buffer","data":[0,173,135,156,244,122,120,43,192,243,238,192,174,227,6,97,194,89,98,120]},"announce":[],"urlList":[]}}