{"title":"Stephen Hunter - Bob Lee Swagger Series 02 - Black Light","uid":4852267,"size":83237517,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:00cd60f0b382066ac240746dafdb3ab65c20939f&amp;dn=Stephen+Hunter+-+Bob+Lee+Swagger+Series+02+-+Black+Light&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Joshseane","files":-1,"time":1239917013,"description":"Amazon.com Review\nForty years ago, Bob Lee Swagger's father, a state trooper, was killed by two robbers in an Arkansas shoot-out. Now a young writer has arrived at Swagger's door with some penetrating and troubling questions. What really happened that long-ago Arkansas night? The powers that be don't want that question answered, but Swagger, to his surprise, finds that he does -- even if it means having to use his long-abandoned combat skills and cunning to find out. Like the infrared &quot;black light&quot; that exposes a sniper's target in the night, Swagger homes in on the shadowy figures desperate to keep the secret of his father's murder buried. --This text refers to an out of print or unavailable edition of this title.\n\nFrom Publishers Weekly\nWith a flourish of authorial prestidigitation, through this action-packed tale of revenge Hunter transforms the seemingly unrelated Point of Impact and Dirty White Boys, his most recent-and most critically acclaimed-novels, into parts one and two of a trilogy. In the process, Hunter confirms his status as one of the most skilled hands in the thriller business. Former Marine sniper Bob Lee Swagger has put his past behind him until he meets Russell Pewtie, who wants to write a book about Bob Lee's father, Earl, a state trooper who died in a shoot-out in Blue Eye, Ark., in 1955. The link between Pewtie and Bob Lee, which ties the three novels together, is that Lamar Pye, the escaped con who almost killed Pewtie's father in Dirty White Boys, turns out to be the son of one of the men who killed Earl. Behind that death, it's revealed here, lies a 40-year-old conspiracy that is somehow tied to the brutal murder of a young black girl that Earl was investigating on the day he died. The plot is fast-paced, well-constructed and builds to a pulse-pounding night ambush that echoes the finale of Point of Impact but that stands on its own as a classic one-on-one confrontation. Other echoes of the earlier novels sound as well, giving this one the feel of a recapitulation, or a farewell. But then Hunter has set a high standard for himself-and while this novel doesn't match the escalating craziness of Dirty White Boys or the stone-cold efficiency of Point of Impact, it should seal his reputation as an author who not only can write bestselling thrillers, but write them exceedingly well. Literary Guild main selection; major ad/promo; author tour.","torrent":{"xt":"urn:btih:00cd60f0b382066ac240746dafdb3ab65c20939f","amp;dn":"Stephen+Hunter+-+Bob+Lee+Swagger+Series+02+-+Black+Light","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00cd60f0b382066ac240746dafdb3ab65c20939f","infoHashBuffer":{"type":"Buffer","data":[0,205,96,240,179,130,6,106,194,64,116,109,175,219,58,182,92,32,147,159]},"announce":[],"urlList":[]}}