{"title":"xStarter v1.9.1.115","uid":4355629,"size":16500198,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0100f4c77e974815537d846c663a77b8bba0217b&amp;dn=xStarter+v1.9.1.115&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jodyanne","files":3,"time":1219396206,"description":"By creating macros for everyday tasks, you can decrease your routine IT work load. Tasks can be scheduled to execute periodically or at specific times without direct supervision. Tasks can be created to backup and archive email and document files effortlessly. Advanced features of xStarter scheduler allows you to specify the program or task launch time more precisely. Your tasks can be executed one time, periodically or by extended time format. It can run as a Windows service so that it is possible to execute tasks even if nobody is logged on in Windows. This assures you that tasks will be executed. xStarter can monitor changes to files and folders and send notification by broadcasting a network message or send email.\n\nActions in the Internet\nSend and receive email messages, manipulate files via FTP, HTTP and a lot more. For example, you can: receive daily reports via email and store attachments in specified folder; send notifications about completed tasks, download log files, etc.\n\nWindows macros\nYou can record macros while working in all applications within the Microsoft Windows environment using xStarter. Each macro records sequence of keystrokes, mouse movements and user clicks. This sequence is stored in a file and can be played back as many times as required. When a xStarter macro is played back, it will simulate clicks on menu items, buttons, windows and links just as if you had entered them yourself.\n\nRemote control.\nWith xStarter Web Pilot it will be possible to run tasks on remote computers, view tasks and tasks logs, enable and disable tasks from any Web Browser.\n\nTasks compiling.\nIt&amp;#039;s possible to compile xStarter tasks into distributable .exe files. Tasks in this case are portable and don&amp;#039;t need xStarter to be installed on computers where tasks will be executed.\n\nAutomate your everyday tasks without any programming knowledge\nUsing xStarter is like having the ability to write your own programs without doing any programming. It is very easy to use. It is designed for people with only basic computer skills. Each xStarter task consists of an action list. These actions can be performed in any combination, here just some of them:\n* create processes;\n* display messages;\n* connect to the Internet;\n* synchronize folders;\n* perform operations with windows;\n* manipulate log and text files;\n* connect and disconnect shared network folders;\n* etc.","torrent":{"xt":"urn:btih:0100f4c77e974815537d846c663a77b8bba0217b","amp;dn":"xStarter+v1.9.1.115","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0100f4c77e974815537d846c663a77b8bba0217b","infoHashBuffer":{"type":"Buffer","data":[1,0,244,199,126,151,72,21,83,125,132,108,102,58,119,184,187,160,33,123]},"announce":[],"urlList":[]}}