{"title":"Arma 3 Map pack A3MP","uid":9383975,"size":4635731837,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:018ad73e1ab9bbf45e11176d4a3a74daf2855276&amp;dn=Arma+3+Map+pack+A3MP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1387767853,"description":"ArmA 3 Map Pack - A3MP\n\nby \nalduric\n\n\nDescription:\nAs the Arma community could already see, I've been working for some time on a mod which aims to port Arma 2 and Operation Arrowhead maps to Arma 3. So I contacted the developers in order to receive their permission. While I was working, I received many private messages in which you were asking me to release the mod ASAP. I decided to perform some close beta tests whose results are satisfying. Therefore, the next step will be the public test release, I want to stress that it's still the TEST phase and some problems may still appear. I made sure that there are no bugs or crashes during launching or playing the game.\n\n\nFeatures:\n- Info about license and version is in Mod folder.\n- Please remember Bohemia Interactive is the original author!\n- You all are allowed to make Takistan Life, Cherno Life based on this mod ofc!\n- Share and like our Facebook Click!\n- License is APL-SA\n- MP Keys included\n\n\nInstallation:\nExtract into the ArmA 3 Directory, by default this is located in:\n32-Bit - C:Program FilesSteam/SteamappsCommonArmA 3\n64-Bit - C:Program Files (x86)Steam/SteamappsCommonArmA 3\nAfter extraction it should look like this:\nSteamSteamappsCommonArmA 3@your_mod_folder_nameaddons\n\nYou can also use the &quot;Arma 3 Alpha&quot; folder in your &quot;My Documents&quot; folder. Your folder setup could than look like for example this:\nmydocumentsArma3 Alpha@your_mod_folder_name1addons\nmydocumentsArma3 Alpha@your_mod_folder_name2addons\nmydocumentsArma3 Alpha@your_mod_folder_name2addons\n\nWhen present place the &quot;userconfig&quot; folder into your game install folder, usually:\n&quot;C:Program Files (x86)SteamsteamappscommonArma 3&quot;.\nYou may already have &quot;userconfig&quot; folder from other addons and/or mods in which case it is safe to merge the contents from this archive.\n\nYou'll also need to add a Launch Parameter to Steam, in order to do so right-click on ArmA 3 Alpha and click Properties and then Set Launch Options. In the window that opens enter in -mod=@your_mod_folder_name\nFor using multiple mods you would then do so like this:\n-mod=@mod_name;@mod_name2;@mod_name3;@mod_name4;@mod_name5\n\nNote:\nYou can also use -nosplash to get rid of the splash art and intro videos.\n\n\nAnd of course you can also enable and disable community made addons and mods through the in-game Options Expansions menu if you do not want to mess with startup parameters!\n\nWhen the above information still does not provide you with enough to learn how to install custom addons and mods you can always ask in our Guide On Installing Mods.\n\n\nIncluded files:\nA3MP_*.pbo\n\n\nKnown issues:\n- Few mats problem - Will be fixed soon\n- Few &quot;black&quot; textures\n\n\nCredits &amp; Thanks:\n- .kju for help with the mod creation and sharing the AiA configs.\n- Fabio for great lighting configuration\n- Bohemia Interactive\n- Awesome community support\n- Made by Alduric: http://www.ArmA3coop.pl\n\n\nLicense:\n@A3MP is under Arma Public License Share Alike (APL-SA)\n\nArmA 3 Map Pack is created from ArmA 2 samples pack based on APL-SA License.\nArmA 3 Map Pack include few configs from All In Arma - Permisions granted from .kju //Thank you so much mate!\nArmA 3 Map Pack is free mod, nobody can sell it.\nArmA 3 Map pack can be used only in ArmA series games.\nAuthor of A3MP gives no warranty.\nMap elements, materials, textures, sounds are owned by Bohemia Interactive. \n\nMod is released with permision granted from Ivan Buchta (Edge)\nFor more info - http://www.bistudio.com/english/community/licenses/arma-public-license-share-alike\n\n\nChangelog:\nv1.1\n- Particles problems are solved, smokes / flares looks okay now on all A2 maps.\n- Lighting problem is solved, works like in ArmA 3.\n- Wierd grass range visiblity is fixed and looks okay now.\n- New MP keys included ( tested 3 times, with group of ppl )\n\nv1.0\n- first release","torrent":{"xt":"urn:btih:018ad73e1ab9bbf45e11176d4a3a74daf2855276","amp;dn":"Arma+3+Map+pack+A3MP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"018ad73e1ab9bbf45e11176d4a3a74daf2855276","infoHashBuffer":{"type":"Buffer","data":[1,138,215,62,26,185,187,244,94,17,23,109,74,58,116,218,242,133,82,118]},"announce":[],"urlList":[]}}