{"title":"The Game by Ken Dryden (Non Fiction)","uid":7609644,"size":2581673,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01d5e03aa586abba975f56029de30f1721eb3796&amp;dn=The+Game+by+Ken+Dryden+%28Non+Fiction%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"azizex666","files":-1,"time":1347028489,"description":"Widely acknowledged as the best hockey book ever written and lauded by Sports Illustrated as one of the Top 10 Sports Books of All Time, The Game is a reflective and thought-provoking look at a life in hockey. Intelligent and insightful, former Montreal Canadiens goalie and former President of the Toronto Maple Leafs, Ken Dryden captures the essence of the sport and what it means to all hockey fans. He gives us vivid and affectionate portraits of the characters -- Guy Lafleur, Larry Robinson, Guy Lapointe, Serge Savard, and coach Scotty Bowman among them -- that made the Canadiens of the 1970s one of the greatest hockey teams in history. But beyond that, Dryden reflects on life on the road, in the spotlight, and on the ice, offering up a rare inside look at the game of hockey and an incredible personal memoir. This commemorative edition marks the 20th anniversary of The Game's original publication. It includes black and white photography from the Hockey Hall of Fame and a new chapter from the author. Take a journey to the heart and soul of the game with this timeless hockey classic.\n\n\n \n                               Format 1 - Epub\n \n\n                               Format 2 - Mobi\n\n\n            **Support Your Favorite Authors By Buying Their Books**","torrent":{"xt":"urn:btih:01d5e03aa586abba975f56029de30f1721eb3796","amp;dn":"The+Game+by+Ken+Dryden+%28Non+Fiction%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01d5e03aa586abba975f56029de30f1721eb3796","infoHashBuffer":{"type":"Buffer","data":[1,213,224,58,165,134,171,186,151,95,86,2,157,227,15,23,33,235,55,150]},"announce":[],"urlList":[]}}