{"title":"Dungen - Stadsvandringar","uid":3437613,"size":91612169,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:02aa2e133aa96d0d948fa9addb4d9f76b37823b9&amp;dn=Dungen+-+Stadsvandringar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tweekins","files":11,"time":1138573512,"description":"AllMusic Review:  Stadsvandringar is the second album from Dungen but the third to hit U.S. shores. Ta Det Lugnt was so inspired and effortless that the earlier efforts are bound to suffer a bit in comparison, but what really becomes evident is the musical growth and progression of Gustav Ejstes that ultimately led to Ta Det Lugnt. The first album caused a such a stir when it hit that Dungen ended up signing with the Swedish arm of Virgin, who somehow found a way to get a track placed on the Scandinavian version of the Jungle Book 2 soundtrack (!). Stadsvandringar is the album that resulted from the Virgin association, and musically, it fits right between the first and third albums. Dungen was a loose and meandering affair peppered with moments of brilliance. For Stadsvandringar, not only are the song structures tightened up, but rather than playing most of the instruments himself (as he did on the other albums), Ejstes has a full band with him. Oddly enough, the spark you would think a band would provide over solo overdubbing seems to be largely missing. Perhaps it was pressure from the label, perhaps it was going from recording in the basement to a real studio, but Stadsvandringar somehow feels more studied than either of the other albums. Since the deal with Virgin ended with this album because &quot;this arrangement didn't feel either right or real,&quot; you can assume that label pressures or expectations played a role. And this isn't a bad album at all. It's more focused than Dungen and there are some great tracks, but it never reaches the sheer exuberance that Ta Det Lugnt maintains throughout. &quot;Andra Sidan SjÃƒÂ¶n&quot; harkens back to the first album, with its sitar and acoustic bass while &quot;Solen Stiger Upp, Del 1 &amp; Del 2&quot; has a great trippy backdrop before it heads into a flute/organ workout. &quot;Fest&quot; has some serious guitar crunch, but overall, Stadsvandringar fails to hit as hard as Ta Det Lugnt. It's clearly a transitional album that catches Ejstes in the learning curve that led to the almost universal acclaim of Ta Det Lugnt. It's good, but not quite there yet.","torrent":{"xt":"urn:btih:02aa2e133aa96d0d948fa9addb4d9f76b37823b9","amp;dn":"Dungen+-+Stadsvandringar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02aa2e133aa96d0d948fa9addb4d9f76b37823b9","infoHashBuffer":{"type":"Buffer","data":[2,170,46,19,58,169,109,13,148,143,169,173,219,77,159,118,179,120,35,185]},"announce":[],"urlList":[]}}