{"title":"[Coursera] Understanding Terrorism and the Terrorist Threat","uid":10032687,"size":645116905,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0351e687b21baa35083b3b9b89d77aa5d037ef16&amp;dn=%5BCoursera%5D+Understanding+Terrorism+and+the+Terrorist+Threat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rndNbr","files":106,"time":1398355875,"description":"UNDERSTANDING TERRORISM AND THE TERRORIST THREAT\n******************************************************\nTaught by Gary LaFree and Bill Braniff\nPublished by the University of Maryland, College Park and Coursera\nCompiled by the Free Library and Uploaded by rndNbr in March 2014\n\n======================================================\n\nThank you for downloading this educational resource. If you are satisfied with it, I only ask you to seed its torrent or pass it on in some way for someone else's use.\n\nIf you have any comments, questions, or suggestions, if you would like information on other free educational resources, or if you would like to contribute, please contact us at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;2b4d594e4e474249594a59526b4e464a42470548444605&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nIf you would like to donate, support free education by donating to Khan Academy:\n &lt;a href=&quot;\nhttp://khanacademy.org/donate&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://khanacademy.org/donate&lt;/a&gt;\n\nThank you.\n\nThe Free Library\n\n======================================================\n\nThis course includes the video lectures (MP4), their subtitles (SRT), transcripts (TXT), and any lecture resources that were provided by the professor(s).\n\n======================================================\n\nThis is version 001 of this course. It ended in February/March 2014.\n\nThis course will explore questions relating to the who, what and how of terrorism studies by introducing students to cutting edge research and the experts investigating these topics. \n\nTerrorism Studies does not fall within any one traditional academic discipline, and it is often plagued by subjectivity and a lack of empirical data. The National Consortium for the Study of Terrorism and Responses to Terrorism (START), a Department of Homeland Security Center of Excellence housed at the University of Maryland, will apply its multi-disciplinary and mixed-method approach to research in this course, utilizing theory and quantitative and qualitative research from a range of the social and behavioral sciences including Criminology, Psychology, Political Science and Communications Studies.\n\nThe course will begin with a unit looking at widely held myths about terrorism and utilizing empirical data to discuss the realities of broad trends and patterns in terrorist attacks over time.  The course will then review the psychological factors at play in individual radicalization and recruitment into terrorism, followed by an analysis of terrorist group dynamics.  The course will next look to factors that allow terrorist groups to successfully carry out attacks, such as propaganda, use of media, financing, recruitment, and training.  The course will conclude by looking at the factors that drive terrorist group persistence/endurance versus terrorist group desistance, and will bring the varied course concepts together through a detailed look at the case of al-QaÂ’ida, including the groupÂ’s successes, failures, tactics, and strategies.  Throughout the course, students will work with the University of MarylandÂ’s Global Terrorism Database (GTD), the largest database of terrorist incidents in the world, learning its capabilities and developing basic skills in searching and displaying appropriate and accurate sets of terrorism data.\n\nMore information about this course is available at https://coursera.org/course/understandingterror\n","torrent":{"xt":"urn:btih:0351e687b21baa35083b3b9b89d77aa5d037ef16","amp;dn":"%5BCoursera%5D+Understanding+Terrorism+and+the+Terrorist+Threat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0351e687b21baa35083b3b9b89d77aa5d037ef16","infoHashBuffer":{"type":"Buffer","data":[3,81,230,135,178,27,170,53,8,59,59,155,137,215,122,165,208,55,239,22]},"announce":[],"urlList":[]}}