{"title":"A Digital Photographers Guide to Model Releases{BBS}","uid":6701351,"size":67748384,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03e178c5a03dea0212b12552bda2d69ef864925a&amp;dn=A+Digital+Photographers+Guide+to+Model+Releases%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316982012,"description":"Do you need a release for a photo of someone you took in public? How about photos of buildings? Does it make a difference if the subject was paid to be in the picture? You can't answer these questions without more information. As the photographer, you need to understand your buyer's concerns in order to make savvy decisions about how you market your photos and to whom. Here's how to make money from all your photos, whether or not they have releases, by understanding the business aspects of the law.\nFrom the Back Cover\nLooking to sell your photos? First, take this quiz!\n\n    *\n\n      Do I need a release for a photo of someone I took in public?\n    *\n\n      Should I get a release even if the person is unrecognizable?\n    *\n\n      Is a release necessary if I make a profit selling a photo of a person?\n    *\n\n      Do I need releases for photos of buildings?\n    *\n\n      Are releases necessary for pictures of people from other countries?\n    *\n\n      I took a lot of pictures as a hobby, and now I want to sell them. Do I need releases for all my people pictures?\n    *\n\n      If I have no plans for a photo when I take it, should I get a release anyway?\n    *\n\n      Does it make a difference if the subject was paid to be in the picture?\n\nGive yourself one point for &quot;Yes,&quot; and two points for &quot;No.&quot; In fact, make it three points. If you scored higher than zero, you have a lot to learn about model releases, because you can't answer these questions without more information. How will the photo be used? By whom? Can the subject be associated with an idea, product, or service? Until you know that, the question of releases can't be answered.\n\nAs the photographer, you need to understand your buyer's concerns in order to make savvy decisions about how you market your photos and to whom. Here's how to make money from all your photos, whether or not they have releases, by understanding the business aspects of the law.\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 279 pages\n    * Publisher: Wiley; 1 edition (March 31, 2008)\n    * Language: English\n    * ISBN-10: 0470228563\n    * ISBN-13: 978-0470228562","torrent":{"xt":"urn:btih:03e178c5a03dea0212b12552bda2d69ef864925a","amp;dn":"A+Digital+Photographers+Guide+to+Model+Releases%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03e178c5a03dea0212b12552bda2d69ef864925a","infoHashBuffer":{"type":"Buffer","data":[3,225,120,197,160,61,234,2,18,177,37,82,189,162,214,158,248,100,146,90]},"announce":[],"urlList":[]}}