{"title":"Forbidden Holywood Collection Vol. 3 - Disk 3 - DVD9- Heroes for","uid":9275947,"size":7778803712,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:040f853f0fa75ef9e4ca9bd058c63a2f420baac4&amp;dn=Forbidden+Holywood+Collection+Vol.+3+-+Disk+3+-+DVD9-+Heroes+for&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SaM","files":-1,"time":1385855371,"description":"Forbidden Holywood Collection Vol. 3 - Disk 3 - DVD9- Heroes for Sale (1933) - Wild Boys of the Road (1933) [DDR]\n\n--------------------------------------------------------------------------------\n\nForbidden Holywood Collection Vol. 3 - Heroes for Sale (1933) [DDR]\n\nHeroes for Sale (1933) is a Depression-era film directed by William Wellman, starring Richard Barthelmess, Aline MacMahon, and Loretta Young, and released by Warner Bros.\n\nCAST:-\nRichard Barthelmess as Thomas Holmes\nAline MacMahon as Mary Dennis\nLoretta Young as Ruth Loring Holmes\nGordon Westcott as Roger Winston\nRobert Barrat as Max Brinker\nBerton Churchill as Mr. Winston\nGrant Mitchell as George W. Gibson\nCharles Grapewin as Pa Dennis\nRobert McWade as Dr. Briggs\nG. Pat Collins as Leader of agitators\nJames Murray as Blind soldie\n\nDirected by William Wellman\nWritten by Wilson Mizner\n\nSYNOPSIS:- Heroes for Sale (1933)\nA veteran of the Great War, Thomas Holmes, struggles to make his way in civilian life in almost every way imaginable. In the opening scene of the movie, Tom and his friend are on a mission to gather intelligence by capturing a German soldier. Tom's friend, in terror, refuses to leave the shell hole so Tom volunteers to go alone.\n\nHe captures a German but is wounded and taken prisoner. His friend returns to the safety of American lines with the captured German soldier and is rewarded for his supposed heroism. During Tom's captivity, German doctors treat his pain with morphine and becames addicted to the drug. After Tom returns from the war, his cowardly friend offers him a job at his father's bank out of shame.\n\n\nThe saga of Tom Holmes - a man of principles - from the Great War to the Great Depression. Will he ever get a break? His war heroics earn fame and a medal for someone else, and his wounds result in a morpheme addiction that costs him a job, his reputation in his home town, and months in a clinic. He goes to Chicago, where he's enterprising and dedicated to his work and his fellow workers, but an invention he champions results in the opposite of his intentions, leading to loss of life and an unjust imprisonment. After release, during the Depression, he must face local &quot;red squads&quot; and vigilante groups jousting out jobless men.\n\n===================================================================================\n\nForbidden Hollywood Collection Vol. 3 - Wild Boys of the Road (1933) \n\nWild Boys of the Road (1933) is a black-and-white, Pre-Code Depression-era American film telling the story of several teens forced into becoming hobos. \nThe film was directed by William Wellman from a screenplay by Earl Baldwin based on the story &quot;Desperate Youth&quot; by Daniel Ahern. The film stars Frankie Darro.\n\nCAST:-\nFrankie Darro as Eddie Smith\nEdwin Phillips as Tommy Gordon           \nRochelle Hudson as Grace\nDorothy Coonan as Sally\nSterling Holloway as Ollie, another hobo\nArthur Hohl as Dr. Heckel, who amputates Tommy's leg\nAnn Hovey as Lola\nMinna Gombell as Aunt Carrie\nGrant Mitchell as Mr. Smith\nClaire McDowell as Mrs. Smith\nRobert Barrat as Judge White\n\nDirected by William Wellman\nProduced by Robert Presnell Sr.\nScreenplay by Earl Baldwin\nStory by Daniel Ahern\n\nMOVIE REVIEW:- Wild Boys of the Road (1933)\nTommy Gordon (Edwin Phillips) tells his friend Eddie Smith (Frankie Darro) that he is going to drop out of high school to look for work to help support his struggling family. Eddie offers to speak to his father (Grant Mitchell) about getting him a job, only discover that his father has himself just lost his own. Eddie sells his beloved car and gives the money to his father, but when his father remains unemployed, the bills keep piling up, and the family is threatened with eviction. Eddie and Tommy decide to leave home to ease the burden on their families. They board a freight train, where they meet Sally (Dorothy Coonan), another teenager, who is hoping her aunt in Chicago can put her up for a while. More and more teens hop aboard the train.\n\nWhen they reach Chicago, they are met by the police. Most of the transients are sent to detention, but Sally has a letter from her aunt, so they let her through. She claims her companions are her cousins; the kindly policeman is skeptical, but lets them go. Sally's Aunt Carrie (Minna Gombell) welcomes all three into her apartment. However, before they even have a chance to eat, the place is raided by the police. The trio hastily depart and continue heading east.\n\nNearing Cleveland, one girl, caught alone, is raped by the train brakeman (an uncredited Ward Bond). When the others find out, they start punching the assailant. By accident, the brakeman falls out of the train to his death. A little later, as the train approaches the city, everyone jumps off. Tommy hits his head on a switch and falls across the track in front of an oncoming train. He crawls desperately towards safety, but his foot gets mangled and his leg has to be amputated. They live in &quot;Sewer Pipe City&quot; for a while, until the city authorities decide to shut it down, in part due to Eddie's theft of a prosthetic leg for Tommy.\n\nFinally, the three end up living in the New York Municipal Dump. Eddie finally lands a job, but needs to find $3 to pay for a coat he has to have. They panhandle to raise the money. \n\nWhen two men offer Eddie $5 to deliver a note to a movie theater cashier across the street, he jumps at the chance. The note turns out to be a demand for money. Eddie is arrested, and the other two are taken in as well when they protest. The judge (Robert Barrat) cannot get any information out of them, particularly about their parents. However, Eddie's embittered speech moves him. He promises to get Eddie's job back for him and dismisses the charges.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 133 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 133 mins","torrent":{"xt":"urn:btih:040f853f0fa75ef9e4ca9bd058c63a2f420baac4","amp;dn":"Forbidden+Holywood+Collection+Vol.+3+-+Disk+3+-+DVD9-+Heroes+for","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"040f853f0fa75ef9e4ca9bd058c63a2f420baac4","infoHashBuffer":{"type":"Buffer","data":[4,15,133,63,15,167,94,249,228,202,155,208,88,198,58,47,66,11,170,196]},"announce":[],"urlList":[]}}