{"title":"Push - Entanglement EP - FIXED","uid":7143726,"size":257649084,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0486457cd593197066b63e5bef08619a42259e7e&amp;dn=Push+-+Entanglement+EP+-+FIXED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bluploads","files":6,"time":1333080075,"description":"We began a decade ago or more. We thought we might be the next Blue Man Group(tm). We weren't. Once we realized this, we realized &quot;something has gone terribly wrong&quot;. We moved from the sticks to Chicago. Something has, indeed, gone terribly wrong. We have begun hopelessly spinning, growling, grinding, speeding on a radioactive wave out among the ether (farmland), into the black hole (suburbs), through the stargarte (highway), beyond what you thought was a wall of cool (chicago music scene) and into the world of irresistible beauty which birthed the monolith which is PUSH (our heads).\n\nInevitably, HAL or some other kind of sentient technology will abandon you, as we already have been. You will follow a similar path through space and time. And as you wake in your palacial suite to the Push Monolith gazing over you... you will feel it breach the expectation of what a band made up of marimba, vibraphone, synthesizers, drums, bass guitar and melodica could possibly sound like. Something like a bird chasing the last cracker on earth, nabbing it, \nwrestling it to the ground, smothering it with Easy Cheeze(tm) as its last living work. Dying on a beach, decaying and subsequently serving itself, the cracker and the cheese to the cosmos... along with the dry wine of earth.\n\nWe have no &quot;indie&quot; ethic, we don't even know what &quot;the kids&quot; are listening to these days. We don't dress well and we're not as self indulgent as we might seem. We care about what you think. However, PUSH is probably not what you think and that's the best reason we can think of \nfor you to listen up.","torrent":{"xt":"urn:btih:0486457cd593197066b63e5bef08619a42259e7e","amp;dn":"Push+-+Entanglement+EP+-+FIXED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0486457cd593197066b63e5bef08619a42259e7e","infoHashBuffer":{"type":"Buffer","data":[4,134,69,124,213,147,25,112,102,182,62,91,239,8,97,154,66,37,158,126]},"announce":[],"urlList":[]}}