{"title":"(PSX-PSP) Duke Nukem:Total Meltdown converted properly (Kingdom-","uid":4753198,"size":538665213,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:04cb88c7d8b1c31798f4f8096c8e503f4ffa96d5&amp;dn=%28PSX-PSP%29+Duke+Nukem%3ATotal+Meltdown+converted+properly+%28Kingdom-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"toxicjuggalo","files":2,"time":1236302334,"description":"DUKE NUKEM - TOTAL MELTDOWN:\n\nThe popular PC game Duke Nukem comes to the PlayStation in this complete package of Duke Nukem carnage. In addition to the complete re-rendering of the weapons and enemies, the game also features a death-match mode that allows you to link up to a friend and nuke each other. Total Meltdown also comes with six additional levels that weren't included in its PC counterpart.\n\nDuke has defeated the Rigelatins and heads back to Los Angeles on a captured spacecraft. Expecting a heros welcome he has save the planet after all his craft is shot down. Duke quickly learns that Los Angeles is under siege from aliens. Now duke must battle LAPD piggies, flying brains, machine gun toting aliens, and other scum to save his beloved city. Use shotguns, chain cannons, freeze throwers, shrinkers, and other weapons as you play all of the levels on the PC version of the game as well as six exclusive PlayStation levels. If you get tired of battling the aliens, use a link cable and challenge a friend to a death match. Help Duke as he tries to save Los Angeles in Duke Nukem: Total Meltdown.\n\n\nTested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS...KloWn","torrent":{"xt":"urn:btih:04cb88c7d8b1c31798f4f8096c8e503f4ffa96d5","amp;dn":"%28PSX-PSP%29+Duke+Nukem%3ATotal+Meltdown+converted+properly+%28Kingdom-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04cb88c7d8b1c31798f4f8096c8e503f4ffa96d5","infoHashBuffer":{"type":"Buffer","data":[4,203,136,199,216,177,195,23,152,244,248,9,108,142,80,63,79,250,150,213]},"announce":[],"urlList":[]}}