{"title":"Humble Weekly Sale - King's Bounty Collection DRM-FREE","uid":8794920,"size":6931783671,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:04ef8be7064449ee3f3e0564bf599c442fd861db&amp;dn=Humble+Weekly+Sale+-+King%27s+Bounty+Collection+DRM-FREE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AN0NYMOUS142857","files":3,"time":1376048396,"description":"Three stunning games. The Humble Weekly Sale features a new deal every Thursday. Be sure to jump on this amazing offer before it's gone! This week, pay what you want for King's Bounty: The Legend and King's Bounty: Armored Princess. If you pay more than the average, you'll also receive King's Bounty: Crossworlds!\n\nKing's Bounty: Crossworlds\n\nKing's Bounty: Crossworlds is the expansion for King's Bounty: Armored Princess, featuring the &quot;Orcs on the March&quot; expansion and two mini-campaigns: &quot;Champion of the Arena&quot; and &quot;Defender of the Crown.&quot; In &quot;Champion of the Arena,&quot; you face a gauntlet of boss battles, while &quot;Defender of the Crown&quot; has you reprising the role of Princess Amelie as she defends the crown. Tougher battles and even tougher bosses await you in this refined expansion.\n\nKing's Bounty: The Legend\n\nYou are the quintessential hero sworn to serve the king and cast into a medieval fantasy world filled with dragons, knights in shining armor, and princesses. King's Bounty: The Legend is a graphically rich adventure game with a splash of the bizarre where you can choose to be a warrior, paladin, or mage. Adventure across lush forests and snowy villages and then lead your troops into tactical turn-based battles. Should you find a need for companionship, you can also settle down and take a wife. You can even tie the knot with a zombie-bride, if you so wish.\n\nKing's Bounty: Armored Princes\n\nJump back into the fantasy that swept you away in King's Bounty: The Legend with the sequel, King's Bounty: Armored Princess. Fans will rejoice knowing that it contains many of the celebrated original game mechanics. In this strategic RPG, play as Princess Amelie, who must find the illustrious knight Bill Gilbert and save her kingdom. Your journey of new quests, bosses, and spells will never be lonely, as you'll pick up a pet dragon and meet companions on the way, each with special abilities.\n\nInstallation\n\nInstall and play\n\nIf you like the collection buy it.","torrent":{"xt":"urn:btih:04ef8be7064449ee3f3e0564bf599c442fd861db","amp;dn":"Humble+Weekly+Sale+-+King%27s+Bounty+Collection+DRM-FREE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04ef8be7064449ee3f3e0564bf599c442fd861db","infoHashBuffer":{"type":"Buffer","data":[4,239,139,231,6,68,73,238,63,62,5,100,191,89,156,68,47,216,97,219]},"announce":[],"urlList":[]}}