{"title":"[xbox] Dead or Alive 2 Ultimate [herbsta edition]","uid":4654888,"size":2717813969,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:05d075c6b32c30d296284e61904e59565e600bbb&amp;dn=%5Bxbox%5D+Dead+or+Alive+2+Ultimate+%5Bherbsta+edition%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"herbsta","files":4,"time":1232169239,"description":"This is an XISO image of a special version of Dead or Alive 2 Ultimate for xbox 1...\n\n\nseveral years ago i was a member of a hacking website and we developed many skins and hacks for this game...\n\n\nyou have 2 options for using this game after its downloaded:\n\n\n[option 1]: play game off dvd-r\n\nto play this game on your soft or hard modded xbox simply burn it to a dvd-r using your favorite image burning software.  i suggest you use imgburn because it is freeware and it works perfect on default settings....\n\n\n\n[option 2]: play off xbox hdd\n\nif you wish to play the game off of your modded xbox's hard drive i have included all the necessary files on the iso itself.  in order to get the files to your xbox hard disk you can extract them with xiso (on your pc), or you can use your xbox to read the disc after you have burned it using ftp to connect to your modded xbox and simply ftp the entire contents of the D drive (on xbox with burned disc in drive) to your pc. you can alternatively use dvd2xbox to copy game to xbox game directory and then use dvd2xbox to rename necessary files.  either way works the same.  once you have the game directory on your pc/dvd2xbox look for 2 files: \n\n- default.xbe\n- default.xbe_hdd-patched\n\nfirst rename default.xbe to default xbe_orig or default.xbe_dvd; this is the file that must be named default.xbe on this iso image if you play off dvd in modded xbox.  i suggest you just leave this file in game directory after you rename it so you have it in case you want to play off disc in future.\n\nsecond rename default.xbe_hdd-patched to default.xbe\n\nnow ftp the game directory containing all the game files and the renamed xbe files to the game directory on your xbox. (if you used dvd2xbox to rename the xbe files then you already copied game to xbox hdd) reboot your xbox. the game will now launch from your game launch menu of your modded xbox\n\n\n\n\nAbout this mod:\n\n\nthis mod has added several modded skins for each female character in doa2u.\n\nthere are a few topless/nude skins available from the start but to get the naked skins for each doa girl you must have a save file with all costumes unlocked from normal version of game or just unlock them yourself..\n\n\na lot of hard work went into making the stuff necessary for this mod... please enjoy and HELP ME SEED because im on crappy dsl here and can only upload at a pitiful rate... i will do my best but i will need help from my pirate brethren.\n\n\n\n\n","torrent":{"xt":"urn:btih:05d075c6b32c30d296284e61904e59565e600bbb","amp;dn":"%5Bxbox%5D+Dead+or+Alive+2+Ultimate+%5Bherbsta+edition%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05d075c6b32c30d296284e61904e59565e600bbb","infoHashBuffer":{"type":"Buffer","data":[5,208,117,198,179,44,48,210,150,40,78,97,144,78,89,86,94,96,11,187]},"announce":[],"urlList":[]}}