{"title":"Overdrawn at the Memory Bank DVD - NOT MSTied","uid":3795755,"size":4151294084,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:061a9c21e14421416b9dd8262c8b1bdc3d6e371f&amp;dn=Overdrawn+at+the+Memory+Bank+DVD+-+NOT+MSTied&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"griffie","files":42,"time":1188949472,"description":"&quot;They want to control his mind but can&amp;#039;t even find his body.&quot; \nThis IS NOT the MSTied version. \n\nIf you know what&amp;#039;s good for you, you&amp;#039;ll stop reading here. Wait, you&amp;#039;ve already found this torrent. I guess it&amp;#039;s too late, you may as well continue. \n\nYou probably already know what this movie is. One of the wierdest of the wierd, a B-movie&amp;#039;s B-movie, &quot;Overdrawn&quot; is a hurt-fest full of talented actors in search of direction. \n\nThe plot is decent, and is drawn from a John Varley short story. Basically, Aram Fingle is a drone at a large corporation. He screws up by hax0ring the data terminals so he can watch movies instead of monitoring routine data outputs. He&amp;#039;s caught, gets sent to a rehab clinic, and has his mind transferred to that of a baboon for &quot;rehabilitation.&quot; The clinic loses his body because of some darn kid swapping routing tags. Hilarity ensues. Add one sub-plot featuring malicious CEOs, a good-looking sidekick, and a horrific rip on &quot;Casablanca,&quot; and you have &quot;Overdrawn at the Memory Bank. \n\nFilmed (er, videotaped) for WNET, a New York PBS station by Canda&amp;#039;s RSL Productions, this was supposed to be the glorious entrance of a series of movies based on classic works. However, the lack of funding cancels many dreams, including this one. Watch it, and be, well, be older by about an hour and a half. \n\nThis IS NOT the MSTied version. \n\nDVD from VHS. NTSC, MPEG audio, English spoken, no subs. High bitrate - still meets DVD specs but may cause some older players to choke. Simple menu structure, chapters every 10-ish minutes. Also contains the &quot;Star Crystals&quot; trailer present on the tape. Burn the files to a DVD for DVD player playback. \n\nThere are a few spots in the movie that have tearing that I couldn&amp;#039;t correct, but most of the errors were fixed in processing. Hooray for VHS. Other than that, the video is decent, if slightly fuzzy from the VHS transfer. \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0089759/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0089759/&lt;/a&gt;  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Overdrawn_at_the_Memory_Bank&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Overdrawn_at_the_Memory_Bank&lt;/a&gt; \n\n\n\n\n\nAnd the CEO would have gotten away with it if it wasn&amp;#039;t for those darn kids!\n\nAnd before you complain about the size, this DVD was done at the request of a friend, and DVD-playable was the requested format.","torrent":{"xt":"urn:btih:061a9c21e14421416b9dd8262c8b1bdc3d6e371f","amp;dn":"Overdrawn+at+the+Memory+Bank+DVD+-+NOT+MSTied","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"061a9c21e14421416b9dd8262c8b1bdc3d6e371f","infoHashBuffer":{"type":"Buffer","data":[6,26,156,33,225,68,33,65,107,157,216,38,44,139,27,220,61,110,55,31]},"announce":[],"urlList":[]}}