{"title":"Rosemary s Baby (1968) (ENG)(MULTI SUBS 14) 2Lions-Team","uid":5221679,"size":4681732895,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:06a8adc00cf0d0a1d0b122dd274a74f323196faa&amp;dn=Rosemary+s+Baby+%281968%29+%28ENG%29%28MULTI+SUBS+14%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1260961271,"description":"Rosemary s Baby (1968) \n\n\n\n\nVerenigde Staten\nHorror / Thriller\n136 minuten\ngeregisseerd door Roman Polanski\nmet Mia Farrow, John Cassavetes en Ruth Gordon\nRosemary is net getrouwd met Guy en samen besluiten ze om in een groot appartement in New York te gaan wonen. Al snel raken ze bevriend met een ander koppel dat naast hen woont. Guy brengt opvallend steeds meer tijd door bij deze buren. Na een zelfmoord van een vrouw in de buurt begint ze vreemde dromen te krijgen en hoort ze vreemde geluiden. Het lijkt erop dat Guy steeds meer afgesloten van Rosemary leeft. Ze krijgt steeds meer aandacht van haar buren en als ze zwanger raakt, blijkt dat de buren speciale plannen hebben met haar kind.\n\n\nEnglish\n\nRosemary and Guy Woodhouse move into an apartment in a building with a bad reputation. They discover that their neighbours are a very friendly elderly couple named Roman and Minnie Castevet, and Guy begins to spend a lot of time with them. Strange things start to happen: a woman Rosemary meets in the washroom dies a mysterious death, Rosemary has strange dreams and hears strange noises and Guy becomes remote and distant. Then Rosemary falls pregnant and begins to suspect that her neighbours have special plans for her child\n\n\nType: DVD5 \n\nOndertiteling: Dutch, English, German, Arabic, Bulgarian, Czech, Icelandic, Hungarian, Norwegisn, Polish, Romanian, Finnish, Swedish, Turkish, \nAudio : English 3.2\nMenu: yes \nExtras: Yes\nBron : Retail pal\n\nWeblink : http://www.moviemeter.nl/film/965\nWeblink : http://www.imdb.com/title/tt0063522\n\n***************************************** \n\nBrought to you by\n\n\n2Lions Team \n\n\n\n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!Info \nto the fakers , get a life !!!","torrent":{"xt":"urn:btih:06a8adc00cf0d0a1d0b122dd274a74f323196faa","amp;dn":"Rosemary+s+Baby+%281968%29+%28ENG%29%28MULTI+SUBS+14%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06a8adc00cf0d0a1d0b122dd274a74f323196faa","infoHashBuffer":{"type":"Buffer","data":[6,168,173,192,12,240,208,161,208,177,34,221,39,74,116,243,35,25,111,170]},"announce":[],"urlList":[]}}