{"title":"FearlHeart 1.009 Setup {Twiggy}","uid":6798634,"size":57565435,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:06fdcb6b2ffb1f8e7f3a53ff08c6e1383d477a7a&amp;dn=FearlHeart+1.009+Setup+%7BTwiggy%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FatFreddy61","files":-1,"time":1320573183,"description":"So what is FeralHeart?\n\n\nFeralHeart is the official replacement of KovuLKD's old game 'Impressive Title'. This game will take the place of Impressive Title and will have more features and extras. This won't ever replace all the wonderful memories of Impressive Title, but it will let us build on the amazing relationships we founded there!\n\nThe main difference is for the admins and users. You can easily add things, edit maps and create maps. The coding is more advanced than it was in Impressive Title and makes the whole programming way easier.\n\n \n\nWhy are we here?\n\n \n\nThe main principle is still the same; we are here to have fun, make friends and have a taste of the good life outside reality! You could see FeralHeart as a big 3D-chat, roleplay game or just adventure.\n\nYou create your character in the menu with individual looks! You can change the pelt-colors, eye-color and even choose between different markings.\n\n \n\nWhat has CHANGED!?\n\n \n\nThe biggest enhancement in FeralHeart is the introduction of the wolf models! You will have the option to be a feline or a canine! The choice is yours!\n\nThe player is able to change the whole body; everything from the height, to the length and even the width. Even the weight is changeable! So you can make a fragile feline, or a very bully looking one! This awesome new feature is available for both wolves and lions! Your character will be your own and nobody will have one quite like it! Variety is key!!\n\nUnlike Impressive Title, there will be no items to equip on your character. This will just keep the game more friendly and encourage adventure and RolePlay! There is a whole wide world to discover and you won't find it sitting around!\n\nDownload, install, seed, enjoy!\n\n                                        ~Twiggy~","torrent":{"xt":"urn:btih:06fdcb6b2ffb1f8e7f3a53ff08c6e1383d477a7a","amp;dn":"FearlHeart+1.009+Setup+%7BTwiggy%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06fdcb6b2ffb1f8e7f3a53ff08c6e1383d477a7a","infoHashBuffer":{"type":"Buffer","data":[6,253,203,107,47,251,31,142,127,58,83,255,8,198,225,56,61,71,122,122]},"announce":[],"urlList":[]}}