{"title":"Biotechnology of Bioactive Compounds - Sources and Applications","uid":12699696,"size":13147696,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0712f57d73bd0a86c04edc3f674f51338a8542ec&amp;dn=Biotechnology+of+Bioactive+Compounds+-+Sources+and+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1446756594,"description":"Biotechnology of Bioactive Compounds - Sources and Applications (Wiley, 2015).pdf\r\n\r\nISBN 9781118733493\r\n\r\nBioactive compounds play a central role in high-value product development in the chemical industry. Bioactive compounds have been identified from diverse sources and their therapeutic benefits, nutritional value and protective effects in human and animal healthcare have underpinned their application as pharmaceuticals and functional food ingredients. The orderly study of biologically active products and the exploration of potential biological activities of these secondary metabolites, including their clinical applications, standardization, quality control, mode of action and potential biomolecular interactions, has emerged as one of the most exciting developments in modern natural medicine. Biotechnology of Bioactive Compounds describes the current stage of knowledge on the production of bioactive compounds from microbial, algal and vegetable sources. In addition, the molecular approach for screening bioactive compounds is also discussed, as well as examples of applications of these compounds on human health. The first half of the book comprises information on diverse sources of bioactive compounds, ranging from microorganisms and algae to plants and dietary foods. The second half of the book reviews synthetic approaches, as well as selected bioactivities and biotechnological and biomedical potential. The bioactive compounds profiled include compounds such as C-phycocyanins, glycosides, phytosterols and natural steroids. An overview of the usage of bioactive compounds as antioxidants and anti-inflammatory agents, anti-allergic compounds and in stem cell research is also presented, along with an overview of the medicinal applications of plant-derived compounds. Biotechnology of Bioactive Compounds will be an informative text for undergraduate and graduate students of bio-medicinal chemistry who are keen to explore the potential of bioactive natural products. It also provides useful information for scientists working in various research fields where natural products have a primary role","torrent":{"xt":"urn:btih:0712f57d73bd0a86c04edc3f674f51338a8542ec","amp;dn":"Biotechnology+of+Bioactive+Compounds+-+Sources+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0712f57d73bd0a86c04edc3f674f51338a8542ec","infoHashBuffer":{"type":"Buffer","data":[7,18,245,125,115,189,10,134,192,78,220,63,103,79,81,51,138,133,66,236]},"announce":[],"urlList":[]}}