{"title":"Quickflight - Decent Beat (1983)","uid":8744233,"size":45885384,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:08942ea2d1b350eb3e7c391dfca4ab12cfe17739&amp;dn=Quickflight+-+Decent+Beat+%281983%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"digitalpress","files":-1,"time":1374878019,"description":"From Wikipedia: Musically their style, particularly on the first album &quot;Breakaway&quot; is similar to that of early OMD, which was in turn influenced by Kraftwerk. Vocally, however they were closer to The Cars or Devo.\n\nThe second album of Quickflight, entitled Decent Beat,[4] was recorded at Little Mountain Sound Studios in Vancouver, British Columbia, Canada, and was released by Star Song Records of Houston, Texas, in 1983. It was groundbreaking because it was one of the first Christian Contemporary releases in which the instruments used consisted almost entirely of synthesizers and sequencers. &quot;At the time,&quot; recalls deGroot, &quot;this was not the most common way of recording, so we had to keep in mind that we weren't trying to duplicate acoustic and electric instruments, but that we were trying to create our own electronic sound, all the while keeping it accessible.&quot; The album was also one of the first Christian Contemporary Music albums that was digitally mastered although it was never released on CD.\n\nQuickflight toured through the Mid-West and West Coast of the U.S. and parts of Canada. Being managed by California-based Cavali Artists, the band was able to perform at several outdoor festivals, playing with a variety of Christian artists who included The Steve Taylor Band, The Rez Band, Kerry Livgren, Sheila Walsh, Undercover, and Larry Norman. &quot;It was an unbelievable time for us,&quot; says deGroot. &quot;One day we were in a coffeehouse in Surrey, British Columbia, and a couple days later we were playing a 25,000 plus festival in Southern California!&quot;\n\nThrough recording at Little Mountain, Ric deGroot met the members of the Capitol Recording group Strange Advance and joined them in 1984. They toured Canada in 1985. deGroot currently lives in Vancouver and works in production in the film business.\n\n\nA1 Water Of Life 4:58\nA2 Remote Control 2:43\nA3 In The World 3:52\nA4 Safety In Numbers 3:10\nA5 System Breakdown 4:15\nB1 Fantasy 4:00\nB2 Fade To Glory 4:25\nB3 Messages 2:00\n   Introduction/D.M.X.\nB5 Metro Alien 5:14\nB6 I Dream 2:52\n\nBacking Vocals - Dale Dirksen (tracks: A1, A2, A4, A5, B1 to B3, B6)\nGuitar - Greg Johnson (tracks: A2, A4, B3, B6)\nSynthesizer - Chris Livingston (tracks: A1, A4)\nWritten-By - Dale Dirksen (tracks: B2, B3, B5)","torrent":{"xt":"urn:btih:08942ea2d1b350eb3e7c391dfca4ab12cfe17739","amp;dn":"Quickflight+-+Decent+Beat+%281983%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08942ea2d1b350eb3e7c391dfca4ab12cfe17739","infoHashBuffer":{"type":"Buffer","data":[8,148,46,162,209,179,80,235,62,124,57,29,252,164,171,18,207,225,119,57]},"announce":[],"urlList":[]}}