{"title":"Photo Studio PRO v1.21.2","uid":13224493,"size":33280899,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:08995c83fa6c49b84e75618a0241fced3deae451&amp;dn=Photo+Studio+PRO+v1.21.2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":1,"time":1452831365,"description":"Photo Studio is a powerful all-in-one image processing application for photographers of any level. \r\n\r\nIt contains basic and precise tools that provide multiple ways of retouching your images. Turn your photos into masterpiece using a wide variety of effects, filters, color and text tools, frames, enhancement features and more.\r\n\r\nMain features:\r\n\r\n• 150+ unique filters in categories: 'Lomo', 'Vintage', 'Simple tone', 'Black &amp; White', 'Old Style', ‘Cold tones’, ‘Warm tones’ and 'Art'.\r\n• 200+ amazing special effects: shadow, fabric, akvarel, rust, frames, scratch, light, fire, water, heart, brush, noise and many more.\r\n• Artistic filters Sketch and Watercolor enable you to turn pics into beautiful works of art.\r\n• Picframes helps you combine multiple photos into amazing looking frames with 100 adjustable templates in Classic and Art categories, adjustable borders, frames, corners and backgrounds.\r\n• Powerful collage making tool for creating free-form collages.\r\n• Color Splash FX with filters: decolor, colorize or recolor your shots.\r\n• About 50 free stickers and about 1000+ stickers in additional packs by categories Animals, Romance, Plans, Monsters, Food and many more.\r\n• Magic Tools contains: Auto-Levels, Sharpening, Area-Auto-Levels, Blurring and Red-Eyes correction.\r\n• Clone Stamp tool – easily choose and reproduce particular areas of your image. A must-have photo retouching tool.\r\n• Lens Boost – get an amazing vignette effect with circle and linear (Tilt Shift) lens.\r\n• Customizable text labels.\r\n• Apply set of beautiful digital frames to your photos. Available packs: Holiday Frames, Christmas Frames, Summer Frames and Valentine's Day frames. You can download and try all frames for FREE.\r\n• Rich set of photo enhancement tools: adjust color, brightness, contrast, hues, saturation, apply round and linear masks, selective color adjustment.\r\n• Base transform operations: resize, rotate and crop.\r\n• Action Sets: collect interesting operations into action sets and apply them again to new photos.\r\n• Apply several operations to one photo: you can edit a photo and apply all features and effects to one photo at the same time.\r\n• Use photos from your gallery or from Camera.\r\n• Save the result in formats: Small, Normal, Large and Original. Save images in JPEG and PNG.\r\n• Photo Studio PRO includes all unlocked packs, tools and features.\r\n\r\nWhat's New:\r\n\r\n1. The biggest content update of the year includes new filters, new effects, new stickers, new frames, new backgrounds and many more.\r\n2. Apply filters, effects with masks.\r\n3. Gradient for text labels support.\r\n4. Performance and UI improvements.\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.kvadgroup.photostudio_pro","torrent":{"xt":"urn:btih:08995c83fa6c49b84e75618a0241fced3deae451","amp;dn":"Photo+Studio+PRO+v1.21.2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08995c83fa6c49b84e75618a0241fced3deae451","infoHashBuffer":{"type":"Buffer","data":[8,153,92,131,250,108,73,184,78,117,97,138,2,65,252,237,61,234,228,81]},"announce":[],"urlList":[]}}