{"title":"Metal Men TPB (Bchry-DCP) (- Nem -)","uid":9656619,"size":293022956,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0a247e27b6459496ca794f4631dae0c1fc7dc643&amp;dn=Metal+Men+TPB+%28Bchry-DCP%29+%28-+Nem+-%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nemesis43","files":1,"time":1393197877,"description":"\n\nDC's metallic heroes return in this trade paperback collecting the 8-issue miniseries! Gold, Platina, Mercury, Iron, Lead, Tin and Copper must face off the forces of Chemo, Doctor Yes, BOLTS, The Balloonatic and his Orphan Army, as well as the Robot Renegades in this action-packed volume!\nBack Blurb\n\nBuilt to be your heroes!\n\nExploding from the periodic table with elemental fury - they're the alloyed allies of all things good! They make your average super-powered robot look like a glorified toaster oven!\n\nGold, Platina, Mercury, Iron, Lead, Tin and Copper are the amazing androids who combine their unique abilities - and clashing personalities - to fight for justice under the watchful eye of their creator, Doc Magnus. But within the &quot;responsometers&quot; that give them life lies an ancient weapon that can control the very fabric of the world!\n\nTo keep their scientific secret, Magnus and his Metal Men must mine a mother lode of villains - including Magnus's ex-mentor T.O. Morrow, the towering toxic terror Chemo, and the deadly Death Metal Men. Each enemy wants the awesome power our battlin' 'bots have within them. But could the greatest threat to the world be the Metal Men themselves?\n\nAn origin story, a vision of the future and a nonstop here-and-now thrill ride all rolled into one, this time-traveling, globe-spanning adventure from writer-artist Duncan Rouleau (co-creator of BEN 10) proves that when it comes to high-tech heroism, Metal rocks!\n","torrent":{"xt":"urn:btih:0a247e27b6459496ca794f4631dae0c1fc7dc643","amp;dn":"Metal+Men+TPB+%28Bchry-DCP%29+%28-+Nem+-%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a247e27b6459496ca794f4631dae0c1fc7dc643","infoHashBuffer":{"type":"Buffer","data":[10,36,126,39,182,69,148,150,202,121,79,70,49,218,224,193,252,125,198,67]},"announce":[],"urlList":[]}}