{"title":"Shrimad Valmiki Ramayana -BalaKanda","uid":6895660,"size":13741158,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0c1b1cc888ba3db6d9b99c84b477be1c0d34e0cf&amp;dn=Shrimad+Valmiki+Ramayana+-BalaKanda&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"594mgnav","files":-1,"time":1324196951,"description":"Shrimad Valmiki Ramayana -BalaKanda[Team Nanban][TPB]\n\nAbout Valmiki:\n\n\n\n&quot;Valmiki&quot; (during Lord Rama's time) is celebrated as the poet harbinger in Sanskrit literature. \n\nHe is the author of the epic Ramayana, based on the attribution in the text of the epic itself.\n\nHe is revered as the Adi Kavi, which means First Poet, for he discovered the first sloka i.e. first verse, which set the base and defined the form to Sanskrit poetry.\n\nThe Ramayana, originally written by Valmiki, consists of 24,000 verses in seven cantos (some say six i.e. excluding the Uttara Ramayana) (Kandas). \n\nThe Ramayana tells the story of a prince, Rama of Ayodhya, whose wife Sita is abducted by the demon (Raakshasa) king of Lanka, Ravana. \n\nThe Valmiki Ramayana is dated variously from 500 BC to 100 BC, or about co-eval with early versions of the Mahabharata.\n\nAs with many traditional epics, it has gone through a long process of interpolations and redactions, making it impossible to date accurately.\n\n\n\nSHORT DESCIPTION ON Shrimad Valmiki Ramayana -BalaKanda:\n\nDasharatha was the king of Ayodhya. He had three queens and they are Kausalya, Kaikeyi and Sumitra. \n\nHe was childless for a long time and, anxious to produce an heir, he performs a fire sacrifice known as Putra-Kameshti Yagya. \n\nAs a consequence, Rama is first born to Kausalya, Bharata is born to Kaikeyi, and Lakshmana and Shatrughna are born to Sumitra. \n\nThese sons are endowed, to various degrees, with the essence of the God Vishnu; \n\nVishnu had opted to be born into mortality in order to combat the demon Ravana, who was oppressing the Gods, and who could only be destroyed by a mortal. \n\nThe boys are reared as the princes of the realm, receiving instructions from the scriptures and in warfare. \n\nWhen Rama is 16 years old, the sage Vishwamitra comes to the court of Dasharatha in search of help against demons, who were disturbing sacrificial rites. \n\nHe chooses Rama, who is followed by Lakshmana, his constant companion throughout the story. \n\nRama and Lakshmana receive instructions and supernatural weapons from Vishwamitra, and proceed to destroy the demons.Janaka was the king of Mithila. \n\nOne day, a female child was found in the field by the king in the deep furrow dug by his plough. \n\nOverwhelmed with joy, the king regarded the child as a &quot;miraculous gift of God&quot;. \n\nThe child was named Sita, the Sanskrit word for furrow. Sita grew up to be a girl of unparalleled beauty and charm. \n\nWhen Sita was of marriageable age, the king decided to have a swayamvara which included a contest. \n\nThe king was in possession of an immensely heavy bow, presented to him by the God Shiva: whoever could wield the bow could marry Sita. \n\nThe sage Vishwamitra attends the swayamvara with Rama and Lakshmana. \n\nOnly Rama wields the bow and breaks it. \n\nMarriages are arranged between the sons of Dasharatha and daughters, nieces of Janaka. \n\nThe weddings are celebrated with great festivity at Mithila and the marriage party returns to Ayodhya.\n\n\n\n\nI WILL POST ALL THE KANDAS ONE BY ONE...\n\nPLZ SEED THIS DIVINE TORRENT AS MUCH AS POSSIBLE..\n\nYOU WILL BE ONE OF THE GOOD PEOPLE WHO SPREAD THE MESSAGE OF RAMAYANA THROUGHOUT THE WORLD...\n\nTHIS TORRENT IS NOT RESTRICTED TO HINDUS ONLY...\n\nANY ONE CAN SPREAD GOOD MESSAGE IF THEY HAVE NICE, PEACEFUL HEART..\n\nPLZ SEED GUYZ...\n\nTHANK YOU..","torrent":{"xt":"urn:btih:0c1b1cc888ba3db6d9b99c84b477be1c0d34e0cf","amp;dn":"Shrimad+Valmiki+Ramayana+-BalaKanda","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c1b1cc888ba3db6d9b99c84b477be1c0d34e0cf","infoHashBuffer":{"type":"Buffer","data":[12,27,28,200,136,186,61,182,217,185,156,132,180,119,190,28,13,52,224,207]},"announce":[],"urlList":[]}}