{"title":"The.Client.List.S02E15.HDTV.x264-EVOLVE","uid":8582703,"size":337786880,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0c1f762c55c310b1d15a38a8d473c2d0736c3832&amp;dn=The.Client.List.S02E15.HDTV.x264-EVOLVE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Thhaque","files":2,"time":1371448491,"description":"The Client List\n\nGenre: Drama, Family\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: N/A\nCast: Jennifer Love Hewitt, Daniel Sobieray, Tyler Champagne, Rebecca Field, Alicia Lagano, Kathleen York\n\n.: Plot :.\nBased on the network's hit 2010 original movie, &quot;The Client List&quot; will launch on Lifetime in 2012 with 10 episodes. In addition, the network has entered into a first look development deal for both series and movies with Hewitt's production company Fedora Films, it was announced today by Nancy Dubuc, President and General Manager of Lifetime Networks. Hewitt's deal also includes her directing a future movie for the network. &quot;The Client List&quot; is about a Texas housewife (Hewitt), who, after being deserted by her husband, is left in deep financial straits and takes a job at a seemingly traditional day spa in a neighboring town. When she realizes massages aren't the only services on the menu, she quickly grabs the opportunity to relieve her financial hardships by partnering with the parlor's feisty and disorganized owner to run the business. The series will follow her as she delicately balances two starkly different lives -- one as a single mom in a conservative town struggling to provide for her family and the other as a savvy and ambitious businesswoman working with a rowdy, sexy and unpredictable group of women.","torrent":{"xt":"urn:btih:0c1f762c55c310b1d15a38a8d473c2d0736c3832","amp;dn":"The.Client.List.S02E15.HDTV.x264-EVOLVE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c1f762c55c310b1d15a38a8d473c2d0736c3832","infoHashBuffer":{"type":"Buffer","data":[12,31,118,44,85,195,16,177,209,90,56,168,212,115,194,208,115,108,56,50]},"announce":[],"urlList":[]}}