{"title":"Neighb'rhood Childr'n - Long Years In Space (1968 Psychede","uid":5674285,"size":195421764,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0c2120b8ceeaa67232dad1b703c556840607a545&amp;dn=Neighb%5C%27rhood+Childr%5C%27n+-+Long+Years+In+Space+%281968+Psychede&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":37,"time":1278465817,"description":"Neighb'rhood Childr'n - Long Years In Space (1968 Psychedelic Pop/Rock)\nCD (Sundaze 1997) To MP3 320 Kbit/s.\nIncluded: CD Covers + 16 Pages Booklet &amp; This Info.\n\nThe Neighb'rhood Childr'n were a psychedelic pop/rock band from San Francisco, California, United States. The band was primarily active during the late 1960s.\n\nHistory\nThe band started in 1967 in Phoenix, Oregon (a small city outside of Medford) as the teen band The Navarros, playing surf music and R&amp;B. The original members were Rick Bolz, George Gleim, Dyan Hoffman, John Morrison and Gary Campbell. After cutting a single on a local Oregon label, the band moved to San Francisco and got caught up in the psychedelic rock movement. After losing Morrison and Campbell to the draft, Ron Raschdorf and W.A. Farrens joined and the Navarros changed their name to The Neighb'rhood Childr'n. They recorded a self-titled album on the Acta label in 1968. This album is now much sought after by record collectors. They toured constantly in support of the album, opening for The Who and The Grass Roots, and going on a short tour with The Beau Brummels. After encountering problems on tour, the band developed a religious focus and changed their name to White Horse. They could not find a label that would release their second album, and the group disbanded in 1970.\n\nInfluences\nTheir sound was compared to that of Jefferson Airplane, especially because of the vocal interplay between Dyan Hoffman and Rick Bolz, and The Turtles. They also draw comparisons to the Sapphire Thinkers and The Peanut Butter Conspiracy. &lt;a href=&quot; http://en.wikipedia.org/wiki/Neighb%27rhood_Childr%27n&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Neighb%27rhood_Childr%27n&lt;/a&gt;\n\nBiography\tby Cub Koda\nFrom just south of Medford, Oregon in the tiny burg of Phoenix (population 600) came the teen band the Navarros. Guitarist Rick Bolz, drummer John Morrison and bassist George Glenn hooked up with singer/keyboardist Dyan Hoffman. After cutting a rowdy single for an Oregon label called Corby, the band came to San Francisco for a weekend and quickly became psychedelicized, moving as far away from the previous surf and R&amp;B stance as their fuzztone pedals and Farfisa organs would carry them. After losing members to the draft (guitarist Ron Raschdorf and drummer W.A. Farrens replaced the departing John Morrison and temporary guitarist George Campbell), they changed their name to the Neighb'rhood Children. Recording their lone album at Golden State Recorders for release on the microscopic Acta label, 1968 looked to be the year for the band. They toured constantly behind the album, working everything from go-go clubs to one-off concerts with the Who, the Grass Roots and a small mini-tour with the Beau Brummels. Upon several close calls on the road, the group found religion and changed their name to White Horse. After finding that no label would release their second album (by all reports much more contemplative, laidback and acoustic than their debut), the group disbanded in 1970. Bolz responded to the years of road burnout by getting back to nature, buying a surplus parachute, turning it into a teepee and living off the land, hunting and fishing, while the others returned to home, hearth and semi-normal lives. \n\nReview\tby Cub Koda\nFrom the opening fuzz guitar and Farfisa organ riffs of &quot;Feeling Zero,&quot; and this is a definite step back in time to a far trippier era of rock &amp; roll. The music contained here is largely a shamelessly derivative batch with nods to all the then-current trends; the Grace Slick-Jefferson Airplane inspired vocals on the title track and &quot;Changes Brought to Me,&quot; the pure British pop of their hit &quot;Please Leave Me Alone,&quot; &quot;Happy World of Captain K&quot; and &quot;Hobbit's Dream,&quot; the Yardbirds-style raveup of &quot;Chocolate Angel,&quot; and the &quot;Paint It Black&quot;-era Stones bounce of &quot;Up Down Turn Around World&quot; are all earmarks of an isolated time in rock history that, although often replicated, can never be truly duplicated. But the minor-key riffing on &quot;Patterns,&quot; the dirgelike version of &quot;Louie Louie,&quot; and tongue-in-cheek, over-the-top version of &quot;Over the Rainbow&quot; show that there was also some originality to the band's offerings as well. This retrospective includes 24 tracks, ten unissued, featuring alternate takes of &quot;Feeling Zero&quot; and the title track, all from the original master tapes. In light of all the retro hoopla surrounding this kind of sound, this collection stands as a small landmark to the style. Get your lava lamp warmed up for this one. \n\nLineup:\nRick Bolz - 12 String Guitar, Harmonica, Vocals\nRon Raschdorf - Guitar, Harmonica, Vocals\nW.A. Farrens - Drums, Harmonica, Vocals\nDyan Hoffman - Vocals, Keyboards\nGeorge Gleim - Bass, Vocals\nJohn Morrison - Drums\nGary Campbell - Guitar\nTom Ryan - Drums\n\nTracklist:\n01. Feeling Zero  [Original LP Track A3]\n02. Long Years In Space  [Original LP Track A2]\n03. Up Down Turn Around World  [Original LP Track A1]\n04. Changes Brought To Me  [Original LP Track A5]\n05. Please Leave Me Alone  [Original LP Track A6]\n06. Hobbit's Dream  [Original LP Track B6]\n07. Chocolate Angel  [Original LP Track B1]\n08. Patterns  [Original LP Track B3]\n09. Happy Child  [Original LP Track B2]\n10. Happy World Of Captain K  [Original LP Track B4]\n11. She's Got No Identification  [Original LP Track B5]\n12. Can't Buy Me Love  [Previously Unissued]\n13. That's What's Happening  [Previously Unissued]\n14. Sunday Afternoon  [Previously Unissued]\n15. Feeling Zero [Alternate Version]\n16. The Little Black Egg  [Previously Unissued]\n17. Tomorrow's Gone  [Previously Unissued]\n18. Over The Rainbow  [Original LP Track A4]\n19. Louie Louie  [Previously Unissued]\n20. I Need Love  [Previously Unissued]\n21. Yesterday's Thoughts  [Previously Unissued]\n22. Woman Think  [Original LP Track]\n23. Long Years In Space  [Alternate Version]\n24. Behold The Lillies  [Original LP Track]\n\nSee my other Torrents: &lt;a href=&quot; http://thepiratebay.se/user/Iron_Horse/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/Iron_Horse/&lt;/a&gt;","torrent":{"xt":"urn:btih:0c2120b8ceeaa67232dad1b703c556840607a545","amp;dn":"Neighb%5C%27rhood+Childr%5C%27n+-+Long+Years+In+Space+%281968+Psychede","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c2120b8ceeaa67232dad1b703c556840607a545","infoHashBuffer":{"type":"Buffer","data":[12,33,32,184,206,234,166,114,50,218,209,183,3,197,86,132,6,7,165,69]},"announce":[],"urlList":[]}}