{"title":"Chuck Missler - Daniel - MP3 Commentary and slideshow","uid":3494188,"size":453739826,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0c96d03fe827352f422427ccc58b9330b63a60d3&amp;dn=Chuck+Missler+-+Daniel+-+MP3+Commentary+and+slideshow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bucky katt","files":1,"time":1149929544,"description":"The Book of Daniel contains the most amazing prophecies of the Bible, and is one of the most authenticating books of the Old Testament. The numerous detailed prophecies of the period of Gentile dominion make this one of the most important foundational studies for anyone who takes the Bible seriously.\n\n\n* Over 20 hours of Verse-by-Verse audio teaching through the book of Daniel as MP3 files.\n* 16 All-New Multimedia Slideshow Presentations!\n* Extensive searchable study notes as PDF files.\n\n* Daniel 1; Dare to be a Daniel - Introduction to the Book. Background, authentication, etc.\n* Daniel 2; Nebuchadnezzar&amp;#039;s Dream - The poly-metallic image; an overview of all the Gentile dominion on the Planet Earth. Daniel and his three friends avoid death penalty and get promoted.\n* Daniel 3; Bow or Burn - Nebuchadnezzar&amp;#039;s ego trip; the worship of his image.\n* Daniel 4; Nebuchadnezzar&amp;#039;s Testimony - The only chapter in the Bible written by a Gentile king.\n* Daniel 5; The Fall of Babylon - The &quot;handwriting on the wall&quot; and the fall of Babylon to the Persians.\n* The Mystery of Babylon - Babylon in Bible prophecy; it&amp;#039;s ultimate destruction; an update on current events; the &quot;Mystery Babylon&quot; of Revelation.\n* Daniel 6; Daniel in the Lion&amp;#039;s Den - How Daniel avoided the &quot;mark of the beast.&quot;\n* The Magi - A supplemental study on the background on the &quot;Magi&quot; and their role in the birth of Jesus Christ.\n* Daniel 7; The Times of the Gentiles - The four empires which climax Gentile dominion on the Earth.\n* European Update - An update of the emergent European Suprastate.\n* Daniel 8; The Ram and the Goat - The succession of the Persian and Greek Empires and the rise of Alexander the Great.\n* Foreshadowings of the final World Ruler. The Seventy Weeks of Daniel - The Most Amazing Prophecy in the Bible.\n* Daniel 9A; The 69 Weeks - The Angel Gabriel predicts the precise day on which Jesus presented Himself as the &quot;Meshiach Nagid&quot; (The Messiah the King).\n* Daniel 9B; The 70th Week of Daniel - The mysterious interval between the 69th and 70th &quot;weeks&quot; of Daniel and the final seven years of world history.\n\nThe Final Vision\n\n* Daniel 10; The Dark Side - The spooky glimpse of the spiritual warfare that lies behind world events.\n* Daniel 11; Coming Future Kingdoms - The amazing prediction of the conflicts between the Ptolemaic and Seleucid Empires and the emergence of the final World Leader.\n* Daniel 12 - The Climax of All History\n\nCTCA","torrent":{"xt":"urn:btih:0c96d03fe827352f422427ccc58b9330b63a60d3","amp;dn":"Chuck+Missler+-+Daniel+-+MP3+Commentary+and+slideshow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c96d03fe827352f422427ccc58b9330b63a60d3","infoHashBuffer":{"type":"Buffer","data":[12,150,208,63,232,39,53,47,66,36,39,204,197,139,147,48,182,58,96,211]},"announce":[],"urlList":[]}}