{"title":"HISTORY OF POP AND ROCK MUSIC - part 520","uid":8963120,"size":331089963,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0cce05a6bf6cb4d67464c9ca0d807f9855cb705e&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+520&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1380153238,"description":"\n\n                         PART  520\n\n\n\n                 THE CONTOURS  -  Do You Love Me  (1962) \n                 THE CONTOURS  -  Do You Love Me  (remix)\n\n\n\n             &quot;Do You Love Me&quot; is a 1962 hit single recorded by The Contours for Motown's Gordy Records label. Written and produced by Motown CEO Berry Gordy, Jr., &quot;Do You Love Me?&quot; was the Contours' only Top 40 single on the Billboard Hot 100 chart in the United States. Notably, the record achieved this feat twice, once in 1962 and again in 1988. The main point of the song is to name the Mashed Potato, The Twist, and many other fad dances of the 1960s.\n            Like many American R&amp;B songs of the 1960s, &quot;Do You Love Me?&quot; was covered by a number of British Invasion groups. Three British groups who recorded their own versions of the song were Brian Poole and the Tremeloes (who hit number one with it in the UK Singles Chart after learning it from Liverpool's Faron's Flamingos), the Dave Clark Five and The Hollies on their 1964 album Stay with the Hollies. The song has also been covered by The Sonics, Paul Revere &amp; the Raiders and Johnny Thunders and the Heartbreakers. In 1965, Bob Marley and the Wailers recorded the song &quot;Playboy,&quot; which incorporates &quot;Do You Love Me&quot;'s chorus. The song was covered by the English glam rock band Mud for their album mud rock. The song was one of the highlights of The Blues Brothers' live set. Bruce Springsteen frequently ended his shows in the mid-1980s with the song, as part of a medley with &quot;Twist and Shout&quot;. Alvin and the Chipmunks covered the song for their 1988 album The Chipmunks and The Chipettes: Born to Rock. Indie band Steadman has a well known cover of the song, played in the style of the Dave Clark Five. Westlife performed a live version for their The Greatest Hits Tour in 2003. German girl group Preluders covered the song for their cover album Prelude to History in 2004. In 1992 David Hasselhoff famously sang the song in an episode of Baywatch.","torrent":{"xt":"urn:btih:0cce05a6bf6cb4d67464c9ca0d807f9855cb705e","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+520","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cce05a6bf6cb4d67464c9ca0d807f9855cb705e","infoHashBuffer":{"type":"Buffer","data":[12,206,5,166,191,108,180,214,116,100,201,202,13,128,127,152,85,203,112,94]},"announce":[],"urlList":[]}}