{"title":"Glory #23-29 (Ongoing) [Image Comics]","uid":7814951,"size":134489181,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:10273adbef52db5c61a4249557c904dfc8356b9e&amp;dn=Glory+%2323-29+%28Ongoing%29+%5BImage+Comics%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1352632542,"description":"English | CBZ and CBR | 7 Issues\n\nGlory #23-29\nPublisher:  Image Comics\nPublication Date:  February 2012\n\nWritten by Joe Keatinge\nArt by Ross Campbell\n\nGlory #1-22 were published by Image Comics and Maximum Press from 1995-1997.\n\nGlory #23\nEXTREME'S ORIGINAL WARRIOR GODDESS RETURNS! After missing for almost a decade, Glory's whereabouts are uncovered by a lone reporter, but the globe-spanning conspiracy keeping her hidden from humanity could make her return more dangerous than anyone ever anticipated! This first issue of an brand-new saga written by Eisner &amp; Harvey-award winner JOE KEATINGE and illustrated by Wet Moon and Shadoweyes creator ROSS CAMPBELL sets up Glory's future by expanding on her past in a way promising to shock long-time fans and excite all-new readers!\n\nGlory #24\nGlory discovers some embers of war can never be extinguished as secrets of her past threaten to devastate the present. The bold new direction written by Eisner &amp; Harvey-award winner JOE KEATINGE and illustrated by Wet Moon's ROSS CAMPBELL continues with one of the most brutal opening sequences in Extreme history.\n\nGlory #25\n500 Years Later. Mars.\n\nGlory #26\nThe secrets of Glory's past, present and future have all been revealed, but now those closest to her must suffer their consequences. The Extreme relaunch revolution continues with Glory fully coming into her role as the new universe's instrument of war and nothing will stand in her way, not even her allies.\n\nGlory #27\nGlory's home in Mont St. Michel is under siege. Her allies are not prepared. Not everyone survives.\n\nGlory #28\nMont St Michel is on the brink of annihilation. Riley Barnes is in the hands of the enemy. Gloria West is on the verge of death. All of it's Glory's fault and only her friends can stop her. All this plus the face smashing introduction to the newest, most deadliest member of the Extreme universe!\n\nGlory #29\nThere is only one warrior Glory has ever feared; only one who's more dangerous than her, only one she knows can stop her. Get ready for the coming of Nanaja, Glory's little sister.","torrent":{"xt":"urn:btih:10273adbef52db5c61a4249557c904dfc8356b9e","amp;dn":"Glory+%2323-29+%28Ongoing%29+%5BImage+Comics%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10273adbef52db5c61a4249557c904dfc8356b9e","infoHashBuffer":{"type":"Buffer","data":[16,39,58,219,239,82,219,92,97,164,36,149,87,201,4,223,200,53,107,158]},"announce":[],"urlList":[]}}