{"title":"Thief and the Cobbler Workprint HQ","uid":6918701,"size":3541888122,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:10baa90ed0e2484921df6ead60985a1f468f9e70&amp;dn=Thief+and+the+Cobbler+Workprint+HQ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tygerbug","files":3,"time":1325130142,"description":"  Enjoy the original version of this lost animation classic, written and \ndirected by three-time Academy Award winning animator Richard Williams \n(animation director of Who Framed Roger Rabbit).\n\n  On a certain Tube video site, [TheThiefArchive] you can see The Thief and the \nCobbler: Recobbled Cut, an unofficial restoration of the film by Garrett \nGilchrist. (orangecow.org)\n\n   But this is Richard Williams' original, unrestored workprint from 1992 \n[production on the film began in the mid 1960s!] ... many scenes are unfinished,\n but it's a great way to see what Williams had in mind, whether or not you've\nalready seen the restored Recobbled Cut.\n\n   This is a brand new DVD copy from a first generation PAL VHS. We've been looking\n for a decent quality copy of the workprint since 1998, and it's absolutely\n amazing to finally see the film in acceptable quality. While not up to today's\n high-def standards, this will be the basis for a new &quot;Mark 4&quot; Recobbled Cut of\n the film, coming in 2012. The video format is MPEG-2, the same format as a DVD,\n although this is not a DVD-R.\n\n  Two rare deleted/extended scenes featuring The Brigands are also included.\n\n   Nearly 30 years in the making, a labor of love by a team of animation greats,\n this was to be the masterpiece of Williams' career, perhaps the most ambitious \nindependent animated film ever conceived. Williams funded the film over the \nyears with his millions of dollars of his own money, until after Roger Rabbit, \nWarner Brothers decided to fund the film. The Thief was the inspiration for \nDisney's film Aladdin, which proved to be its undoing. After over two decades of \nwork, the film was taken away from Williams when he couldn't meet his deadline. \nIt was eventually recut and destroyed, bought by Disney and destroyed further.\n\nDirected by Richard Williams\nScreenplay by Richard Williams and Margaret French\nMaster animator Ken Harris\nProduced by Imogen Sutton and Richard Williams\n\n&quot;Animation among the most glorious and lively ever created.&quot; - The New York Times\n\n&quot;It is written among the limitless constellations of the celestial heavens, and \nin the depths of the emerald seas, and upon every grain of sand in the vast \ndeserts, that the world which we see is an outward and visible dream, of an \ninward and invisible reality ... Once upon a time there was a golden city. In \nthe centre of the golden city, atop the tallest minaret, were three golden \nballs. The ancients had prophesied that if the three golden balls were ever \ntaken away, harmony would yield to discord, and the city would fall to \ndestruction and death. But... the mystics had also foretold that the city might\n be saved by the simplest soul with the smallest and simplest of things. In the\n city there dwelt a lowly shoemaker, who was known as Tack the Cobbler. Also in\n the city... existed a Thief, who shall be ... nameless.&quot;\n\nAlso known (in horrifically butchered form) as Arabian Knight and The Princess \nand the Cobbler.\t\t\n","torrent":{"xt":"urn:btih:10baa90ed0e2484921df6ead60985a1f468f9e70","amp;dn":"Thief+and+the+Cobbler+Workprint+HQ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10baa90ed0e2484921df6ead60985a1f468f9e70","infoHashBuffer":{"type":"Buffer","data":[16,186,169,14,208,226,72,73,33,223,110,173,96,152,90,31,70,143,158,112]},"announce":[],"urlList":[]}}