{"title":"Crawfish Bottom- Recovering a Lost Kentucky Community by Douglas","uid":11138088,"size":24783921,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1127efd15ce399aec597979914e150e56b046506&amp;dn=Crawfish+Bottom-+Recovering+a+Lost+Kentucky+Community+by+Douglas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":1,"time":1412131199,"description":"A small neighborhood in northern Frankfort, Kentucky, Crawfish Bottom was located on fifty acres of swampy land along the Kentucky River. &quot;Craw's&quot; reputation for vice, violence, moral corruption, and unsanitary conditions made it a target for urban renewal projects that replaced the neighborhood with the city's Capital Plaza in the mid-1960s.\n\nDouglas A. Boyd's Crawfish Bottom: Recovering a Lost Kentucky Community traces the evolution of the controversial community that ultimately saw four-hundred families displaced. Using oral histories and firsthand memories, Boyd not only provides a record of a vanished neighborhood and its culture but also demonstrates how this type of study enhances the historical record. A former Frankfort police officer describes Craw's residents as a &quot;rough class of people, who didn't mind killing or being killed.&quot; In Crawfish Bottom, the former residents of Craw acknowledge the popular misconceptions about their community but offer a richer and more balanced view of the past","torrent":{"xt":"urn:btih:1127efd15ce399aec597979914e150e56b046506","amp;dn":"Crawfish+Bottom-+Recovering+a+Lost+Kentucky+Community+by+Douglas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1127efd15ce399aec597979914e150e56b046506","infoHashBuffer":{"type":"Buffer","data":[17,39,239,209,92,227,153,174,197,151,151,153,20,225,80,229,107,4,101,6]},"announce":[],"urlList":[]}}