{"title":"About Group - Between the Walls (2013) [FLAC]","uid":8652585,"size":278737975,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:113b364b629efde03056cb6e2a2c8a3257fb93d5&amp;dn=About+Group+-+Between+the+Walls+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1373144351,"description":"\n  About Group - Between the Walls (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Electronic, Alternative, Experimental\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 After Video \n  02 Walk On By \n  03 All Is Not Lst \n  04 Words \n  05 Graph Paper \n  06 Make The World Laugh\n  07 Love Because\n  08 Nightlife/Sinking\n  09 Untitled\n  10 I Never Lock That Door\n  11 Yes\n  12 If You Can't Love Me\n\n  About Group has always been an outlet for some of the wilder impulses of its members, and while there is still plenty of loose-limbed improvisation on Between the Walls, it continues Start &amp; Complete's trend of bringing a little more order to the chaos. The band keeps its most disjointed experiments brief, like the shambling opening track &quot;After Video&quot; or the keyboard doodles of &quot;Graph Paper,&quot; and focuses most of its energy on more structured songs. &quot;Structured&quot; is still a relative term, though; for Hot Chip fans here for more of Alexis Taylor, these songs might still be too unruly -- even the most experimental moments from Taylor's other band feel neatly gridded-out compared to the maelstroms About Group generates here. Aside from the playful electro-country pop of &quot;I Never Lock That Door,&quot; Between the Walls puts his often somber reflections on love's best and worst moments in settings that are anything but smooth. At times these juxtapositions are inspired; the errant blips and bleeps on &quot;If You Can't Love Me&quot; balance the melody's extreme sweetness. \n\n  Other times, these experimental and sentimental impulses clash with each other, as on &quot;Words&quot; and &quot;Love Because,&quot; where discordant synths cut through the songs as if they're scribbling over the most heartfelt parts. Yet Between the Walls' best moments use this roughness as a lightning rod for a complex mix of emotions that are hard to pin down, and hard to shake off. The band's deconstruction of &quot;Walk on By&quot; is especially powerful, with a lumbering pace and an almost threatening edge to Taylor's silvery croon that sets the stage for melodic tangents that sound like anger and sadness duking it out. Likewise, the instrumental &quot;Untitled&quot; embodies the messiness of heartbreak in its roiling interplay. This moodiness trickles down to more sedate tracks like the aptly smoky &quot;Nightlife/Sinking&quot; and &quot;All Is Not Lost,&quot; both of which show how well About Group can use their intentional loose ends to channel similarly unpredictable emotions. At times, Between the Walls is a frustrating album, but more often than not, the risks About Group take pay off in expressive, rewarding music.","torrent":{"xt":"urn:btih:113b364b629efde03056cb6e2a2c8a3257fb93d5","amp;dn":"About+Group+-+Between+the+Walls+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"113b364b629efde03056cb6e2a2c8a3257fb93d5","infoHashBuffer":{"type":"Buffer","data":[17,59,54,75,98,158,253,224,48,86,203,110,42,44,138,50,87,251,147,213]},"announce":[],"urlList":[]}}