{"title":"Schawinski-TV Monopoly-Die Inside Story(monopolization of media ","uid":6597420,"size":6563414,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:131912393faa62045b066b7df6849acfb51b8cef&amp;dn=Schawinski-TV+Monopoly-Die+Inside+Story%28monopolization+of+media+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"red_gonzo","files":1,"time":1313073422,"description":"For english-only speaking:\nThis book is in german language. English title would be: TV-Monopoly - The Inside Story (2002). Roger Schawinski's first hand account on how he tried to break the SRG media monopoly in Switzerland. Meet the players who have the power to legally prevent any kind of competition. Schawinski first tried with TeleZuri, then with Tele24, to create an independent private television, yet to no avail. Filled with insider information and unknown facts, the author also shows ways to improve this situation that cannot possible be in the public interest. 215 pages.\n\nFur Deutschsprachige:\nKaum ein Medienunternehmer hat die Schweizer Medienszene in den letzten Jahrzehnten derart durcheinandergewirbelt wie Roger Schawinski. Er kennt alle wichtigen Player der Branche und beschreibt, wer welche Interessen aus welchen GrÃƒÂ¼nden vertritt. Sein Buch ist ein PlÃƒÂ¤doyer gegen das SRG-Monopol in den elektronischen Medien. Mit TeleZÃƒÂ¼ri, spÃƒÂ¤ter Tele24, versuchte Schawinski, dieses Monopol aufzubrechen. Doch die rechtlichen Grundlagen erlauben keine echte Konkurrenz zur SRG. Akribisch schildert Schawinski seinen Kampf mit Tele24 um ein unabhÃƒÂ¤ngiges Schweizer Privatfernsehen. Er zeigt die Markt- und Machtmechanismen im Schweizer MediengeschÃƒÂ¤ft, portrÃƒÂ¤tiert alle wichtigen Vertreter sowohl auf privater als auch auf ÃƒÂ¶ffentlich-rechtlicher Seite und liefert dabei eine Vielzahl von neuen, bisher unbekannten Fakten. Kurz vor der EinfÃƒÂ¼hrung eines neuen Radio- und Fernsehgesetzes zeigt er Wege, wie die schweizerische Medienordnung verbessert werden kann. 215 Seiten.\n","torrent":{"xt":"urn:btih:131912393faa62045b066b7df6849acfb51b8cef","amp;dn":"Schawinski-TV+Monopoly-Die+Inside+Story%28monopolization+of+media+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"131912393faa62045b066b7df6849acfb51b8cef","infoHashBuffer":{"type":"Buffer","data":[19,25,18,57,63,170,98,4,91,6,107,125,246,132,154,207,181,27,140,239]},"announce":[],"urlList":[]}}