{"title":"WinRAR 5.00 Beta7! Exclusive Upload By munish83:::","uid":8751147,"size":1761352,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:135d18e08b53b167cbd00900e0983ed46ce6ecc2&amp;dn=WinRAR+5.00+Beta7%21+Exclusive+Upload+By+munish83%3A%3A%3A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Munish83","files":1,"time":1375034703,"description":"WinRAR 5.00 Beta7! Exclusive Upload By munish83:::\n\nAbout:::\n\nWinRAR is an archiving utility that completely supports RAR and ZIP archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, 7Z, Z archives. It consistently makes smaller archives than the competition, saving disk space and transmission costs.\n\nWinRAR offers a graphic interactive interface utilizing mouse and menus as well as the command line interface. WinRAR is easier to use than many other archivers with the inclusion of a special &quot;Wizard&quot; mode which allows instant access to the basic archiving functions through a simple question and answer procedure.\n\nWinRAR offers you the benefit of industry strength archive encryption using AES (Advanced Encryption Standard) with a key of 128 bits. It supports files and archives up to 8,589 billion gigabytes in size. It also offers the ability to create selfextracting and multivolume archives. With recovery record and recovery volumes, you can reconstruct even physically damaged archives.\n\n\nChanges:::\n\n# Bugs fixed:\n* when processing a command like: WinRAR.exe a -sfxmymodule.sfx arcname.exe WinRAR ignored the optional parameter of -sfx switch and used default.sfx module. Console RAR.exe did not have this bug\n* WinRAR did not create the folder structure necessary to store unpacked hard links. So if folder containing a hard link did not exist yet, hard link extraction failed\n* &quot;rn&quot; command displayed wrong file names for processed files. Files were renamed properly, only the screen output was incorrect\n* when extracting ACE archive, WinRAR could create empty folders contained in such archive in a wrong destination folder.\n\n\n\n                                                              Upload By munish83:::","torrent":{"xt":"urn:btih:135d18e08b53b167cbd00900e0983ed46ce6ecc2","amp;dn":"WinRAR+5.00+Beta7%21+Exclusive+Upload+By+munish83%3A%3A%3A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"135d18e08b53b167cbd00900e0983ed46ce6ecc2","infoHashBuffer":{"type":"Buffer","data":[19,93,24,224,139,83,177,103,203,208,9,0,224,152,62,212,108,230,236,194]},"announce":[],"urlList":[]}}