{"title":"David Guetta feat. Akon - Sexy Chick  (2nafish)","uid":5264943,"size":128393220,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:139481f7d43dd74ab02e72390f41862e9fb099bc&amp;dn=David+Guetta+feat.+Akon+-+Sexy+Chick++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1262862799,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Sexy Bitch&quot;, and its clean version &quot;Sexy Chick&quot;, is a song recorded by French producer David Guetta. It features guest Senegalese-American R&amp;B vocalist Akon and was released digitally on July 24, 2009 worldwide and later on July 28 in the United States. It is the second single from Guetta's fourth studio album One Love following &quot;When Love Takes Over&quot;. The song has been a surprise hit, and has reached the number-one spot on nine different charts so far. Additionally, the song also appears in DJ Hero as part of downloadable content.\n\nAmerican pop girlband Girlicious leaked a cover version of &quot;Sexy Bitch&quot; that will not appear on their sophomore album and was used for promotional use only. \n\nThe video starts with a plane coming and girls in bikinis are seen tanning and swimming. The camera switches to Akon who wakes up and finds pictures of his date from David Guetta's pool party. He then finds lipstick note on his mirror that reads &quot;find me at the pool party&quot; with yet another photo. As the party starts, people enter; a group of teenage boys are not allowed but they employ various methods to get in. The camera switches to Akon again, who is shown singing underwater. The camera flicks to Guetta arriving meeting up with Akon, who then grabs Guetta and they throw each other in the pool. The party continues as Akon pushes more people in, girls dance and Akon with Guetta are shown to be having a water fight. The scene then skips to a club that is called &quot;Fuck Me, I'm Famous&quot; where David Guetta is performing a concert with Tocadisco, and Akon is walking in from the back, where he meets some girls. Akon then arrives and performs &quot;Sexy Bitch&quot; at the concert. A light up man in blue and green appears. Girls are shown dancing and Akon does a crowd surf before the video ends. At the end, Akon is seen sleeping in the bed waking up finding pictures but goes back to sleep.\n\nThe video was filmed in Eivissa (Ibiza), Barcelona, Spain, and Swindon, England around July 27th, 2009.\n\nOne Love is the fourth studio album by French house DJ David Guetta. It was released onto the official iTunes Store on 21 August 2009 and was released on CD format on 24 August 2009 throughout Europe and 25 August 2009 in the United States. A double disc deluxe edition have also been released; the second disc contains extended/club mixes of album tracks, as well as two new songs.\n\nThe album received three nominations for the 52nd Grammy Awards in the categories, Best Dance Recording and Best Remixed Recording, Non-Classical for the song &quot;When Love Takes Over&quot;. It was also nominated for Best Electronic/Dance Album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:139481f7d43dd74ab02e72390f41862e9fb099bc","amp;dn":"David+Guetta+feat.+Akon+-+Sexy+Chick++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"139481f7d43dd74ab02e72390f41862e9fb099bc","infoHashBuffer":{"type":"Buffer","data":[19,148,129,247,212,61,215,74,176,46,114,57,15,65,134,46,159,176,153,188]},"announce":[],"urlList":[]}}