{"title":"New Warriors v4 complete","uid":5376812,"size":362437371,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:13ee5a50b076132277ae5593197c591d97daf44d&amp;dn=New+Warriors+v4+complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"NikkiCabrara","files":20,"time":1266597535,"description":"Title: New Warriors\nPublisher: Marvel\nIssue and Volume Number: Complete Volume 4 (issues 1-20)\nYear: 2007-2009\n\nThe fourth volume of the New Warriors is one of the new team books debuting out of Civil War. The new team has one returning member from the original group, (Night Thrasher), while everyone else is new to the team.\n\nNearly everyone in this new incarnation of the team is a depowered mutant and includes Sofia Mantega, (the de-powered mutant formerly known as Wind Dancer), Night Thrasher (who is the original's illegitimate half-brother, Donyell Taylor), and characters Wondra (Jubilation Lee, formerly known as the X-Man Jubilee), Tempest (Angel Salvadore, a former student of the Xavier Institute), Blackwing (Barnell &quot;Barry&quot; Bohusk, formerly known as Beak), Decibel (Jonothan &quot;Jono&quot; Starsmore, formerly known as Chamber), siblings Longstrike (Christine Cord, formerly known as Tattoo) and Phaser (Christian Cord, formerly known as Radian), Skybolt (Vincent &quot;Vin&quot; Stewart, formerly known as Redneck), and Ripcord (Miranda Leevald, formerly known as Stacy X). The group uses stolen and reverse-engineered technology (with the help of supporting teammates Grace and Kaz), such as a shrinking formula based on Bill Foster's derivative of Pym Particles, Spider-Man's webbing, Stilt-Man's telescopic legs and arms, and Wakandan technology in their war on crime.\n\nNOTE: If you have downloaded New Warriors v4 that had been posted by smokebogey, you can add those files to the folder for this torrent.\n\nEnjoy and remember to seed so that others can also enjoy.","torrent":{"xt":"urn:btih:13ee5a50b076132277ae5593197c591d97daf44d","amp;dn":"New+Warriors+v4+complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13ee5a50b076132277ae5593197c591d97daf44d","infoHashBuffer":{"type":"Buffer","data":[19,238,90,80,176,118,19,34,119,174,85,147,25,124,89,29,151,218,244,77]},"announce":[],"urlList":[]}}