{"title":"Dean Koontz - Odd Hours [Audiobook - Unabridged] ","uid":4228655,"size":215529353,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:151b4eb5fad42565bafc49afe5fdd919273a19ef&amp;dn=Dean+Koontz+-+Odd+Hours+%5BAudiobook+-+Unabridged%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"captainelliotspencer","files":11,"time":1212937392,"description":"                               Dean Koontz \n                   - Odd Hours [Audiobook - Unabridged] - \n\n\nThe legend began in the obscure little town of Pico Mundo. A fry cook named Odd was rumored to have the extraordinary ability to communicate with the dead. Through tragedy and triumph, exhilaration and heartbreak, word of Odd Thomas&amp;#039; gifts filtered far beyond Pico Mundo, attracting unforgettable new friends - and enemies of implacable evil. With great gifts comes the responsibility to meet great challenges. But no mere human being was ever meant to face the darkness that now stalks the world - not even one as oddly special as Odd Thomas.\n\nAfter grappling with the very essence of reality itself, after finding the veil separating him from his soul mate, Stormy Llewellyn, tantalizingly thin yet impenetrable, Odd longed only to return to a life of quiet anonymity with his two otherworldly sidekicks - his dog Boo and a new companion, one of the few who might rival his old pal Elvis. But a true hero, however humble, must persevere. Haunted by dreams of an all-encompassing red tide, Odd is pulled inexorably to the sea, to a small California coastal town where nothing is as it seems. Now the forces arrayed against him have both official sanction and an infinitely more sinister authority...and in this dark night of the soul, dawn will come only after the most shattering revelations of all.\n\nIt began with Odd Thomas, a strange young fellow living in a small California town of Pico Mundo and working as a fry cook. Then came Forever Odd, Brother Odd and now Odd Hours. Odd Thomas, the fry cook, has remained a steadfast character from the first book to the fourth even though life has not been kind to him. But while Odd has remained the same humble, innocent, and generally good guy he has always been, he has continued to develop as a character with new facets added in each story. Odd has had two companions, a ghost dog name Boo and his long time friend Elvis Presley. In Odd Hours, Elvis is seemingly replaced with Frank Sinatra.\n\nIn Odd Hours, Odd is faced with perhaps his most profound challenge yet. A dream and all encompassing red tide haunts Odd. At the close of Brother Odd, Odd wants nothing more than to return to Pico Mundo and resume his quiet life as a fry cook. However, fate steps in and he lands in a small coastal town of Magic Beach working for a former movie actor and author of childrens books. With terrific characters such as Annamarie and Brush Cut, Koontz has written another terrific page turner. Packed with suspense, a dark eerieness, fast action, and tight plot, Odd Hours will not disappoint. You&amp;#039;ll have to suspend plausibility, but you&amp;#039;ll enjoy this fourth Odd Thomas installment.\n\n\nRead by: David Aaron Baker \n\n------------------------------------------\n\nPLEASE SEED WHEN YOU FINISH THE DOWNLOAD.\n\nEnjoy!!","torrent":{"xt":"urn:btih:151b4eb5fad42565bafc49afe5fdd919273a19ef","amp;dn":"Dean+Koontz+-+Odd+Hours+%5BAudiobook+-+Unabridged%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"151b4eb5fad42565bafc49afe5fdd919273a19ef","infoHashBuffer":{"type":"Buffer","data":[21,27,78,181,250,212,37,101,186,252,73,175,229,253,217,25,39,58,25,239]},"announce":[],"urlList":[]}}