{"title":"Questions Jesus Asks - Israel Wayne","uid":11773232,"size":9574617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16d1cd39e60a6562ecc53e14b9eb37760de84cf2&amp;dn=Questions+Jesus+Asks+-+Israel+Wayne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427159473,"description":"\n\nJesus questions expose our false assumptions and preconceived ideas, and leave us mesmerized by the Truth standing in front of us - Jesus Himself.\n\nExplore the unique paradox of Jesus divinity and humanity\nBe challenged by the questions Jesus asks each of us\nLearn more about Jesus and find the answers to your own life s questions.\n\nJesus rarely answered questions He was asked, but instead turned the tables by asking a piercing question of His own. Questions Jesus Asks goes through a broad spectrum of these, dealing with issues like morality, suffering, humility, faith, and much more. John 17:3 tells us: And this is eternal life, that they know you the only true God, and Jesus Christ whom you have sent. There is no higher purpose in life then the knowledge of God through His Son. Prepare to learn far more about God and the humanity and divinity of Jesus than you thought was possible. Jesus asks penetrating questions that cut past the pretense and reach the target of our hearts.\n\n\nAbout the author:\nIsrael Wayne is an author and conference speaker who has a passion for defending the Christian faith and promoting a Biblical worldview. The author of Homeschooling from a Biblical Worldview and Full-Time Parenting: A Guide to Family-Based Discipleship, Israel is the Director of Family Renewal, and site editor for ChristianWorldview.net. He is a homeschooled graduate, father of eight and author of the previous title, Questions God Asks, which was released in the Spring of 2014 by New Leaf Press","torrent":{"xt":"urn:btih:16d1cd39e60a6562ecc53e14b9eb37760de84cf2","amp;dn":"Questions+Jesus+Asks+-+Israel+Wayne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16d1cd39e60a6562ecc53e14b9eb37760de84cf2","infoHashBuffer":{"type":"Buffer","data":[22,209,205,57,230,10,101,98,236,197,62,20,185,235,55,118,13,232,76,242]},"announce":[],"urlList":[]}}