{"title":"Saints Row 2","uid":7665196,"size":17326376240,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1996e7b2acc1917921aef377ffac4e2675841e50&amp;dn=Saints+Row+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"n17n3uq","files":196,"time":1348417934,"description":"Saints Row 2 is an action-adventure open world video game developed by Volition, Inc. and published by THQ for Microsoft Windows, PlayStation 3 and Xbox 360. It is the second title in the Saints Row series, after the release of Saints Row in 2006. It is succeeded by Saints Row: The Third, released on 15 November 2011. It was released in North America, Australia and Europe in October 2008 for video game consoles and ported to Windows in January 2009. Before the game's original release, it was ported by G5 Entertainment to mobile phones.[15] Three downloadable content packages were developed for the PlayStation 3 and Xbox 360; Ultor Exposed, Corporate Warfare, and The Unkut Pack.\n\nSet in the fictional city of Stilwater, players control the same nameless protagonist, who has survived the yacht explosion from the first game, and leads the Third Street Saints gang. Assisted by the gang, the protagonist seeks to eliminate three rival gangs who have formed during the five-year period between Saints Row and Saints Row 2. The game is presented as an action-adventure in an open world with driving sequences, featuring online co-operative play and competitive multiplayer in addition to the single player campaign.\n\nThe initial release versions of Saints Row 2 were met with general approval. The Windows port was met with more mixed reviews. Praise was directed at the game's fast-paced action sequences and nonlinear gameplay; criticisms were directed at technical issues. In its first month of release, the game sold an estimated 400,000 units. It has sold in excess of 3.4 million units as of September 2010.","torrent":{"xt":"urn:btih:1996e7b2acc1917921aef377ffac4e2675841e50","amp;dn":"Saints+Row+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1996e7b2acc1917921aef377ffac4e2675841e50","infoHashBuffer":{"type":"Buffer","data":[25,150,231,178,172,193,145,121,33,174,243,119,255,172,78,38,117,132,30,80]},"announce":[],"urlList":[]}}