{"title":"Freedy Johnston - This Perfect World [1994]","uid":9566512,"size":262095132,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1a7a9f305730efa16b7916cc50c475bf04937302&amp;dn=Freedy+Johnston+-+This+Perfect+World+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1391526491,"description":"Review by Kristi Coulter  [-]\nFreedy Johnston's major-label debut is less consistently stunning than its predecessor, 1992's Can You Fly but, taken on its own terms, it affirms his position as one of the best songwriters of his generation. Certainly no one paints more evocative portraits of lonely, disappointed people. The majority of these 12 tracks are about men who either know or strongly suspect that they've done something unforgivable, and such is Johnston's mastery as a lyricist that it's even subtly apparent when his narrators are lying to themselves. Johnston frames his bleak narratives with melodic, chiming folk-rock; if anything, the predominantly mid-tempo songs and radio-ready Butch Vig production are a little too smooth, robbing This Perfect World of the edge that made Can You Fly so piercing. The most memorable tracks are the sparsest ones, where Johnston's words and appealingly plain voice take center stage. In addition to the melancholy opener, &quot;Bad Reputation,&quot; other highlights include &quot;Can't Shake This Town&quot; and the witty &quot;Dolores&quot; -- few songwriters could pack so many Lolita allusions into three minutes of guitar pop without sounding too clever by half. Best of all is the mournful, eerie title track, which describes the possibly mortal sins of one man's past and the hopelessness of his future with the economy and punch of a good short story. (4/5)","torrent":{"xt":"urn:btih:1a7a9f305730efa16b7916cc50c475bf04937302","amp;dn":"Freedy+Johnston+-+This+Perfect+World+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a7a9f305730efa16b7916cc50c475bf04937302","infoHashBuffer":{"type":"Buffer","data":[26,122,159,48,87,48,239,161,107,121,22,204,80,196,117,191,4,147,115,2]},"announce":[],"urlList":[]}}