{"title":"Darwin's Bards: British and American Poetry in the Age of Evolu","uid":6500136,"size":1861918,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1bb193ff3254f1939e9c8b5f58a36b711a1c7911&amp;dn=Darwin%5C%27s+Bards%3A+British+and+American+Poetry+in+the+Age+of+Evolu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309217915,"description":"John Holmes, &quot;Darwin's Bards: British and American Poetry in the Age of Evolution&quot;\nPublisher: Edinburgh University Press | 2009 | ISBN: 0748639403 | PDF | 352 pages | 2 MB\n\nIs a Darwinian universe necessarily a godless one? What might Darwinism tell us about the nature of God? Is Darwinism compatible with immortality, and if not, how can we face death or the loss of those we love? Darwin's Bards is the first comprehensive study in more than fifty years to examine how poets have responded to the ideas of Darwin. John Holmes argues that poetry can have a profound impact on how we think and feel about the Darwinian condition. What is our own place in the Darwinian universe, and our ecological role here on earth? How does our kinship with other animals affect how we see them? How does the fact that we are animals ourselves alter how we think about our own desires, love, and sexual morality? All told, is life in a Darwinian universe grounds for celebration or despair? Holmes explores the ways in which some of the most perceptive and powerful British and American poets of the last hundred and fifty years have grappled with these questions, from Alfred Tennyson, Robert Browning, and Thomas Hardy to Robert Frost and Edna St. Vincent Millay, and from Ted Hughes and Thom Gunn to Amy Clampitt and Edwin Morgan.","torrent":{"xt":"urn:btih:1bb193ff3254f1939e9c8b5f58a36b711a1c7911","amp;dn":"Darwin%5C%27s+Bards%3A+British+and+American+Poetry+in+the+Age+of+Evolu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bb193ff3254f1939e9c8b5f58a36b711a1c7911","infoHashBuffer":{"type":"Buffer","data":[27,177,147,255,50,84,241,147,158,156,139,95,88,163,107,113,26,28,121,17]},"announce":[],"urlList":[]}}