{"title":"World of Warcraft - Solid Gaming's Gold Guide","uid":4932656,"size":15541530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1bfe8952e7a78c0cd3780a50d7f4d5fb1196d5bb&amp;dn=World+of+Warcraft+-+Solid+Gaming%5C%27s+Gold+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GStingray","files":20,"time":1244110194,"description":"This is s World of Warcraft guide pack for making gold fast.  It also includes guides on leveling professions.  This is the description from the ebay listing:\n\n\n\n\nComplete 200+ Page Epic Gold Making Guide!\n Find out which daily quest you can take to make over 5000+ Gold an hour!\n\nLearn how to make TONS of gold with your profession whether it's Gathering, Production, or Secondary. This guide covers it ALL!\n\nComprehensive list of items that each class/profession needs to level up or complete a quest. These sell for TONS of Gold!\n\nSee which items you can purchase for silver and turn around to sell for gold all the time.\n\nContains the very BEST gold making spots you never knew about. See which spots can make you over 1000+ Gold per hour!!\n\nWorks for Horde and Alliance. Also works for any Race and Class.\n\nLearn how to make money on World of Warcraft while not even playing.\n\nWhether it's the Auction House or general trading, I will show you how to dominate the market.\n\nI'll show you which items are always popular no matter how flooded the market is...Don't get stuck with an expensive item that no one wants.\n\nLearn easy tips to get your auction items purchased in less than 15 minutes.\n\nI'll show you all of the mods that I use to make gold fast and how to use them!\n\nHands down...the best places to farm for the hard to find designs, recipes, formulas, and other rare items.\n\nContains a Low Level Gold Making Strategies section dedicated to players that are level 30 or less.\n\nSee which reputation items you can make a ton of cash on and where to get them.\n\nThis guide is LOADED with Burning Crusade tips that will show you exactly how to make TONS of Gold!\n\nLearn the secrets to getting all the Motes and Primals you could ever want.","torrent":{"xt":"urn:btih:1bfe8952e7a78c0cd3780a50d7f4d5fb1196d5bb","amp;dn":"World+of+Warcraft+-+Solid+Gaming%5C%27s+Gold+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bfe8952e7a78c0cd3780a50d7f4d5fb1196d5bb","infoHashBuffer":{"type":"Buffer","data":[27,254,137,82,231,167,140,12,211,120,10,80,215,244,213,251,17,150,213,187]},"announce":[],"urlList":[]}}