{"title":"Easy Hi-Q Recorder v2.2","uid":4106026,"size":7760754,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1c3582dcf1beb4275334a18bc52860488ffdc75c&amp;dn=++Easy+Hi-Q+Recorder+v2.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"captainelliotspencer","files":1,"time":1206810751,"description":"                  Easy Hi-Q Recorder v2.2\n\nRecording software to record streaming audio, Internet radio,         \nwebcasts, music, convert LP&amp;#039;s, records, tapes and a lot more. It      \nwill record anything you can hear! It can also be used as podcast     \nsoftware to create podcasting ready audio content.                    \n                                                                        \nEasy Hi-Q Recorder is so easy to use, all you have to do to is        \nclick Record to get started!                                          \nIt&amp;#039;s the easiest way to record absolutely any sound in real-time!     \nRecord directly to: MP3, (Constant Bitrate: CBR or Variable           \nBitrate: VBR), WMA 9, (Windows Media Audio 9), WAV or OGG Vorbis.     \nAt the high-end you can record to above CD quality 48 kHz stereo      \nand at the low-end you can record all the way down to 8 kHz mono.        \nThere is a very wide range of MP3 Bitrates, also for WMA, from 5      \nto 320 Kbps. The quality is excellent at all settings! Record         \nstreaming Internet audio or video broadcasts or webcasts of any       \nkind, whether it&amp;#039;s news, sports, music, talk radio or any other       \nformat, (records audio only). Record audio or video sounds from       \nDVD, Windows Media Player, RealOne Player, Winamp, QuickTime or       \nany other media player, games, Midi, Software synthesizer, etc.       \nConvert, (record), LP&amp;#039;s, any records, tapes, CD&amp;#039;s, radio, DAT,        \nMini-Disc, video tape sounds, T.V. sounds, video games, telephone,    \nmicrophone or from any other external device. You can also use it     \nas a universal audio or video sound file converter.                   \n                                                                          \nThere is also a built-in VCR-like timer so you&amp;#039;ll never miss one      \nof your favorite broadcasts again! You can set it to record once,     \ndaily or weekly. Easy Hi-Q Recorder also includes some advanced           \nnew features such as sound or voice activation that can               \nautomatically create new files for each new song or sound             \ndetected, silence detection and removal, file splitting and more!     \nIt also has a versatile player. Easy Hi-Q Recorder is easy enough     \nfor any beginner to use, yet is loaded with powerful, high-quality    \nfeatures that will satisfy advanced and professional user&amp;#039;s           \nrecording needs. Automatic file naming is just one of many            \nfeatures that make it so easy to use!                                 \n                                                                          \nRecord and save music that is ready to transfer to your Apple         \niPod, Rio, iRiver, Sony or any other portable MP3 music player!       \nWMA, OGG and WAV are also supported in many portable players.         \n                                                                          \nCreate your own iPod iTunes podcast audio content. You&amp;#039;ll be          \npodcasting in no time!   \n\n-----------------------------------------------------------------------\nExtract all files with latest Winrar or 7zip.\nInstall \nGenerate yourself a serial from the Keygen.\n-----------------------------------------------------------------------\n\nPLEASE SEED WHEN YOU FINISH THE DOWNLOAD.\n\nEnjoy!!\n\n\n                                            ","torrent":{"xt":"urn:btih:1c3582dcf1beb4275334a18bc52860488ffdc75c","amp;dn":"++Easy+Hi-Q+Recorder+v2.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c3582dcf1beb4275334a18bc52860488ffdc75c","infoHashBuffer":{"type":"Buffer","data":[28,53,130,220,241,190,180,39,83,52,161,139,197,40,96,72,143,253,199,92]},"announce":[],"urlList":[]}}