{"title":"El Tiempo Escondido - Joaquin M Barrero [Epub][Spanish]","uid":6945062,"size":1076859,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cc8f27fe4a108c171618d241a9752dacf1a6046&amp;dn=El+Tiempo+Escondido+-+Joaquin+M+Barrero+%5BEpub%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"virana","files":-1,"time":1326194614,"description":"El tiempo escondido, JoaquÃƒÂ­n M. Barrero\n\nUna mujer es el centro del misterio y tiene todas las respuestas. Dos asesinatos. El odio de la Guerra Civil y el amor que supera el tiempo y los lÃƒÂ­mites. Una intriga apasionante que recorre la historia de EspaÃƒÂ±a y llega al corazÃƒÂ³n.\n\nEn la iglesia de una aldea apartada del occidente montaÃƒÂ±oso de Asturias se descubren los restos de dos hombres que desaparecieron sesenta aÃƒÂ±os atrÃƒÂ¡s. El hijo de uno de ellos contrata a un investigador privado para averiguar la identidad del asesino. El detective, al que los avatares de su propia existencia han convertido en un escÃƒÂ©ptico, va adentrÃƒÂ¡ndose en una trampa apasionante, rescatando de un tiempo escondido las vivencias de unos personajes inolvidables que enlazan la ÃƒÂºltima batalla de la guerra de Cuba con el final del siglo XX. Un misterio, una investigaciÃƒÂ³n y un viaje que le llevarÃƒÂ¡ por derroteros insospechados a encontrar su propio destino.\n\nEl tiempo escondido es una novela que conjuga la calidad literaria con el rigor histÃƒÂ³rico. El lector, atrapado desde el principio por una narraciÃƒÂ³n que va creciendo en intensidad y dramatismo hasta llegar a un final sorprendente, disfrutarÃƒÂ¡ de este relato que se sirve de los recursos del thriller para construir un hermoso y emocionante canto al Amor que trasciende las barreras del tiempo.","torrent":{"xt":"urn:btih:1cc8f27fe4a108c171618d241a9752dacf1a6046","amp;dn":"El+Tiempo+Escondido+-+Joaquin+M+Barrero+%5BEpub%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cc8f27fe4a108c171618d241a9752dacf1a6046","infoHashBuffer":{"type":"Buffer","data":[28,200,242,127,228,161,8,193,113,97,141,36,26,151,82,218,207,26,96,70]},"announce":[],"urlList":[]}}