{"title":"The Incredibly Strange Creatures Who Stopped Living and Became M","uid":10663208,"size":322950831,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1d1db7be63d362445c07ecbeea4e3891e541c358&amp;dn=The+Incredibly+Strange+Creatures+Who+Stopped+Living+and+Became+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kansatica","files":1,"time":1406755669,"description":"The Incredibly Strange Creatures Who Stopped Living and Became Mixed-Up Zombies: The MST3K classic. This isn't the MST3K version- this is the full length, original movie, here for you!\n\n--Wikipedia--\n\nJerry (Steckler as &quot;Flagg&quot;), his girlfriend Angela (Sharon Walsh), and his buddy Harold (Atlas King) head out for a day at the carnival. In one venue, a dance number is performed by Marge (Carolyn Brandt), an alcoholic who drinks before and between shows, and her partner, Bill Ward, for a small audience. There Jerry sees stripper Carmelita (Erina Enyo) who hypnotizes him with her icy stare and he is compelled to see her act. Carmelita is the young sister of powerful fortune-teller Estrella (Brett O'Hara), and Estrella turns Jerry into a zombie by hypnotizing him with a spiraling wheel. He then goes on a rampage, killing Marge and fatally wounding Bill. Later, Jerry attempts to strangle his girlfriend Angela as well. It develops that Estrella, with her henchman Ortega (Jack Brady), has been busy turning various patrons into zombies, apparently by throwing acid on their faces.\n\nInterspersed through the film are several song-and-dance production numbers in the carnival's nightclub, with songs like &quot;Choo Choo Ch'Boogie&quot; and &quot;Shook out of Shape&quot;. The titular zombies only make an appearance in the final act, where they escape and immediately kill Estrella, Carmelita, Ortega and several performers before being shot by police. Jerry, himself partially disfigured but not a zombie, escapes the carnival and is pursued to the shoreline, where the police shoot him dead in front of Angela and Harold.\n\nStarring:\nCash Flagg\nCarolyn Brandt\nBrett O'Hara\nAtlas King\nSharon Walsh\nMadison Clarke","torrent":{"xt":"urn:btih:1d1db7be63d362445c07ecbeea4e3891e541c358","amp;dn":"The+Incredibly+Strange+Creatures+Who+Stopped+Living+and+Became+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d1db7be63d362445c07ecbeea4e3891e541c358","infoHashBuffer":{"type":"Buffer","data":[29,29,183,190,99,211,98,68,92,7,236,190,234,78,56,145,229,65,195,88]},"announce":[],"urlList":[]}}