{"title":"Call.of.Juarez.Gunslinger.-.RELOADED [Berlink]","uid":8738343,"size":4986218235,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1d8a97b0fb453c5534dbbc53c083098fda5022b3&amp;dn=Call.of.Juarez.Gunslinger.-.RELOADED+%5BBerlink%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"berlinkenh","files":-1,"time":1374723834,"description":"&quot;In 1910, a legendary old bounty hunter named Silas Greaves enters a saloon in Abilene, Kansas and regales the patrons with tales of his adventures in exchange for free drinks. The patrons, Steve, Jack, and a teenager named Dwight, awe-struck at first, grow increasingly incredulous and irritated the more they listen to his ludicrous stories, in which he takes credit for the killings of numerous legendary outlaws including Butch Cassidy and Newman Haynes Clanton. Finally, they lose their temper and denounce him as a fraud. Silas then declares that Ben the bartender is actually Roscoe &quot;Bob&quot; Bryant, the last of three outlaws who murdered Silas' brothers 42 years earlier. Bob gave himself away by mentioning facts about his partners that only he could have known. The finale offers the player a choice: take revenge by killing Bob in a duel, or forgive Bob and thereby redeem Silas' blood-stained soul. Regardless, Silas decides to hit the road again, while Dwight is revealed to be none other than a young Dwight D. Eisenhower, who is either stunned into silence by the slaying of Bob, or is offered some words of advice by Silas as he heads out.&quot;","torrent":{"xt":"urn:btih:1d8a97b0fb453c5534dbbc53c083098fda5022b3","amp;dn":"Call.of.Juarez.Gunslinger.-.RELOADED+%5BBerlink%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d8a97b0fb453c5534dbbc53c083098fda5022b3","infoHashBuffer":{"type":"Buffer","data":[29,138,151,176,251,69,60,85,52,219,188,83,192,131,9,143,218,80,34,179]},"announce":[],"urlList":[]}}