{"title":"Discovery.Ch.Submarines.Sharks.Of.Steel.3of4.The.Hunters.and.the","uid":6550829,"size":854829056,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1e97f583f713be35570443774d9f8d1f68b696cc&amp;dn=Discovery.Ch.Submarines.Sharks.Of.Steel.3of4.The.Hunters.and.the&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DocFreak08","files":-1,"time":1311066477,"description":"\nCome aboard and step into the exciting world of submarines. Learn the transformation from crude containers designed to keep the water out to the nuclear powered steel underwater sharks of today. Striking from below, the submarine has struck fear into the hearts of sailors for over one hundred years. Now, take a four-part journey into the silent ranks of one of the world's deadliest weapons. Each episode of Sharks of Steel takes viewers inside the world of the submarine and the submariners who serve aboard them. Used as weapons for over a hundred years, it was during the world wars when submarines found their purpose as commerce raiders by sinking enemy shipping. Later, when nuclear weaponry came of age, submarines became an integral part of naval force. Capable of electronically picking your pocket or destroying an enemy's submarines, these sleek, nuclear powered sharks of steel are currently at front line of defense. With stealth and quiet submarines accomplish their missions around the sometimes hostile world while surviving deep underwater.\n\nDirected by Scott Hicks\nProduced by Michael Caulfield\n\nA Beyound Productions &amp; Discovery Communications Co-Production (1992)\n\n\n\nEpisode 3 : The Hunters and the Hunted \nTHE HUNTERS AND THE HUNTED outlines the true history of the submarine and wartime strategies with the assistance of well-known German U-Boat commanders, their British counterparts and American veterans. As early as the Civil War, a new breed of predator appeared in the seas and in one frightening instant forever changed the balance of world power. The submarine, by pure function of design and simplicity in purpose, evolved into the most terrifying weapon of mass destruction ever seen. Obeying only the tenants of surprise and stealth, submarine warfare in both World Wars was by necessity a ruthless endeavor. Now there were only two kinds of ships: subs and targets.\nGerman U-boat wolf packs nearly strangled a nation, U.S. submarines sank 1/3 of the Japanese Navy. And Japan's suicide subs threatened to make the Pacific Fleet obsolete. Inspiring fear from the moment of their creation, no one could have predicted just how deadly these machines ultimately would prove to be.\n\n\n\nTechnical Specs\n----------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2228 kbps\nVideo Resolution: 576x432\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 224kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 46:20.172\nNumber Of Parts: 4\nPart Size: 854,827,008 Bytes\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:1e97f583f713be35570443774d9f8d1f68b696cc","amp;dn":"Discovery.Ch.Submarines.Sharks.Of.Steel.3of4.The.Hunters.and.the","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e97f583f713be35570443774d9f8d1f68b696cc","infoHashBuffer":{"type":"Buffer","data":[30,151,245,131,247,19,190,53,87,4,67,119,77,159,141,31,104,182,150,204]},"announce":[],"urlList":[]}}