{"title":"L'ispettore Coliandro S01E03 In trappola [CR-Bt]","uid":4755502,"size":605009938,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1f61f923d18216c9b795f4faf6ada07609fcf8ef&amp;dn=L%5C%27ispettore+Coliandro+S01E03+In+trappola+%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CR-Bt","files":1,"time":1236435318,"description":"L'Ispettore Coliandro ÃƒÂ¨ una serie televisiva diretta dai Manetti Bros. Creatore della serie ÃƒÂ¨ il famoso giallista Carlo Lucarelli: l'Ispettore Coliandro ÃƒÂ¨ nato dalla penna dello scrittore bolognese, ed ÃƒÂ¨ il protagonista di numerosi suoi gialli.\nGiampaolo Morelli ÃƒÂ¨ il protagonista della serie che sarÃƒÂ  affiancato da un cast fisso, nonchÃƒÂ©, per ogni singolo episodio, da una diversa protagonista femminile. Al centro di questi gialli urbani, c'ÃƒÂ¨ la figura dell'ispettore Coliandro, un investigatore di Bologna con tratti molto diversi dai tradizionali poliziotti della fiction. Ogni episodio ÃƒÂ¨ in pratica un film a se stante, come richiamo ad uno dei suoi modelli ispiratori ovvero i film interpretati da Thomas Milian nel ruolo dell'ispettore Giraldi.\n\n\nIn trappola\nMessa in onda: 31 agosto 2006 (Rai Due)\nDurante un'operazione di polizia contro la mala del quartiere Mazzini (periferia orientale di Bologna) a cui Coliandro partecipa assieme agli altri agenti della Squadra Mobile, Trombetti, durante un inseguimento nei sotterranei di un palazzo, provoca la morte di un pregiudicato. Accusato dal sostituto procuratore Longhi di non avere agito secondo le procedure corrette, viene incriminato per omicidio sulla base di alcuni elementi poco chiari. Per esempio, Trombetti dice di aver sparato due colpi in aria rispondendo ad un colpo esploso contro di lui dal buio, ma di proiettili sparati dalla sua pistola ce ne sono tre: due nel soffitto e uno nel corpo del pregiudicato Piras, che risulta invece disarmato. Inoltre Trombetti, prima di entrare in polizia, era stato amico di Piras, che giura di non aver piÃƒÂ¹ incontrato da allora nonostante ci siano testimonianze e foto che li mostrano assieme qualche giorno prima. Davanti a questi elementi, Trombetti viene sospeso dal servizio e messo agli arresti domiciliari, e su di lui viene aperta un'indagine. Coliandro ÃƒÂ¨ tormentato dal dubbio sulla colpevolezza dell'amico, ma riuscirÃƒÂ  a scoprire come sono andate davvero le cose.","torrent":{"xt":"urn:btih:1f61f923d18216c9b795f4faf6ada07609fcf8ef","amp;dn":"L%5C%27ispettore+Coliandro+S01E03+In+trappola+%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f61f923d18216c9b795f4faf6ada07609fcf8ef","infoHashBuffer":{"type":"Buffer","data":[31,97,249,35,209,130,22,201,183,149,244,250,246,173,160,118,9,252,248,239]},"announce":[],"urlList":[]}}