{"title":"Jonestown: The Life and Death of Peoples Temple","uid":3661102,"size":1022494720,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1f6b39a3df73bc539450bb53ab19bcf65daa0d86&amp;dn=Jonestown%3A+The+Life+and+Death+of+Peoples+Temple&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Xorro","files":1,"time":1176254640,"description":"Jonestown: The Life and Death of Peoples Temple \n\n On November 17, 1978, Congressman Leo Ryan traveled to an isolated rain forest in Guyana to investigate the concerns of his San Francisco-area constituents. Their alarming stories focused on a jungle compound known as Jonestown, a group called the Peoples Temple, and its leader, Rev. Jim Jones. According to news filtering back to America, U.S. citizens were being held against their will in prison camp conditions. There were allegations of physical and sexual abuse and even rumors of a planned mass suicide.\n\nCongressman Ryan, an impassioned human rights advocate, decided to get the facts for himself. Within forty-eight hours, Ryan, Jones, and over 900 Jonestown settlers were dead -- casualties of the largest mass murder-suicide in history. In the next few days, horrifying details of cyanide-laced soft drinks and disturbing images of children poisoned by their parents emerged from the jungle. American Experience goes beyond the salacious headlines to provide a revealing portrait of Jones, his followers, and the times that produced the calamity in the Guyanese jungle. The film&amp;#039;s compelling narrative is told by the people who know the story firsthand, including Jonestown survivors, Temple defectors, and the families of the dead.\n\nVideo: XviD 1133 vbr\nAudio: English Ac3 192 Kbit/sec","torrent":{"xt":"urn:btih:1f6b39a3df73bc539450bb53ab19bcf65daa0d86","amp;dn":"Jonestown%3A+The+Life+and+Death+of+Peoples+Temple","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f6b39a3df73bc539450bb53ab19bcf65daa0d86","infoHashBuffer":{"type":"Buffer","data":[31,107,57,163,223,115,188,83,148,80,187,83,171,25,188,246,93,170,13,134]},"announce":[],"urlList":[]}}