{"title":"Yuli Turovsky - Violonchelo Espanol - I Musici de Montreal (2008","uid":5840171,"size":275539231,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2016f8dda1badf5fff9f0e4cb72f760bb4ae04e9&amp;dn=Yuli+Turovsky+-+Violonchelo+Espanol+-+I+Musici+de+Montreal+%282008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"insinuendo","files":18,"time":1284918692,"description":"Yuli Turovsky - Violonchelo Espanol - I Musici de Montreal (2008) [FLAC] - insinuendo\n\nProduct Details:\nPerformer: I Musici de Montreal\nConductor: Yuli Turovsky\nComposer: Gaspar Cassado, Alexander Glazunov, Isaac Albeniz, Enrique Granados, Manuel de Falla, et al.\nAudio CD (September 16, 2008)\nLabel: Analekta\nGenre: Classical, Chamber Music\nQuality: FLAC &lt;a href=&quot;\nhttp://www.amazon.com/Violonchelo-espa%C3%B1ol-Gaspar-Cassado/dp/B001B5CS8U&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Violonchelo-espa%C3%B1ol-Gaspar-Cassado/dp/B001B5CS8U&lt;/a&gt;\n\nProduct Description:\nSpain's &quot;Golden Age&quot; of Music was the sixteenth century, when composers like CristÃƒÂ³bal de Morales, Francisco Guerrero, TomÃƒÂ¡s Luis de Victoria and Antonio CabezÃƒÂ³n held sway.\n\nMusic continued to be important throughout the following centuries, but, as in England, creative activity tended to centre around musicians from abroad (Domenico Scarlatti and Luigi Boccherini spring immediately to mind). That changed with the arrival on the scene of Felipe Pedrell (1841-1922), composer, and founder of modern Spanish music, and Spain's first modern musicologist. Pedrell imparted to his students a patriotic awareness of their country's rich musical heritage, encouraging them to blend classical and folkloric elements. His three most famous pupils are all represented on this CD. \n\nAbout the Artist:\nFounded in 1983 by cellist and conductor Yuli Turovsky, I Musici de Montreal is a chamber orchestra of 15 musicians that presents a vast repertoire extending from the baroque to the contemporary. The orchestra presents a busy schedule of over 100 concerts per season throughout the world including three prestigious series in Montreal. This extraordinary amount of activity places I Musici amongst the most important touring orchestras in Canada.\n\nSince its beginnings, I Musici has, to date, released 44 CDs that are distributed in more than 50 countries around the world. These recordings have won the orchestra and Maestro Turovsky many awards. The Orchestra has received the coveted Diapason d'or for its recording of Shostakovich's Symphony No. 14, and was presented with a Rosette from Penguin Guide to Compact Discs and Cassettes in 1992 for its recording of Handel's Concerti grossi, Opus 6 - which is now considered a benchmark.\n\nIn December of 1998, the Conseil Quebecois de la musique gave two Opus Awards to the orchestra for &quot;Recording Event of the Year and Best Recording - contemporary music&quot; for a CD grouping works by Gorecki, PÃƒÂ¤rt and Schnittke. In April of 2002, I Musici was nominated for another Canadian Juno Award as Best Classical Album of the Year, this after having won a Juno for their recording of Ginastera, Villa-Lobos and Evangelista. Furthermore, I Musici's recording, The Modern Cello was singled out by the Conseil quÃƒÂ©bÃƒÂ©cois de la musique as &quot;Album of the Year&quot; in the Classical, Romantic &amp; Modern category.\n\nUnder the dynamic and visionary direction of Maestro Yuli Turovsky who also performs as cello soloist with the orchestra, I Musici has performed in some of the greatest halls in the world : New York's Lincoln Center, the Gewandhaus in Leipzig, Germany, the Palais des Beaux-Arts in Brussels, the Seiji Ozawa Hall in Tanglewood, Kioi Hall in Tokyo, the Tonhalle in Zurich and the Conservatoire de Musique in Luxemburg, among others. Public enthusiasm and the critical acclaim that underlines the precision, the cohesion and the virtuosity of performance as well as the brio and distinctive sound of the orchestra confirm I Musici's importance on the world's musical stage. \n\n1. Requiebros \t\n2. Spanish Serenade Opus 20, No.2 \t\n3. Song of a Minstrel, Op.71 \t\n4. Malaguena \t\n5. I. Intermezzo \t\n6. Sonata in the Old Spanish Style : I. Largo ; Allegro \t\n7. Sonata in the Old Spanish Style : II. Grave e Maestoso \t\n8. Sonata in the Old Spanish Style : III. Tema E Variazioni \t\n9. El Amor Brujo : Danza ritual del fuego \t\n10. Spanish Serenade \t\n11. Seven Spanish Folksongs : I. El pano moruno \t\n12. Seven Spanish Folksongs : II. Seguidilla Murciana \t\n13. Seven Spanish Folksongs : III. Nana \t\n14. Seven Spanish Folksongs : IV. CanciÃƒÂ³n \t\n15. Seven Spanish Folksongs : V. Jota \t\n16. Seven Spanish Folksongs : VI. Asturiana \t\n17. Seven Spanish Folksongs : VII. Polo \t\n18. In Imitation of Albeniz ","torrent":{"xt":"urn:btih:2016f8dda1badf5fff9f0e4cb72f760bb4ae04e9","amp;dn":"Yuli+Turovsky+-+Violonchelo+Espanol+-+I+Musici+de+Montreal+%282008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2016f8dda1badf5fff9f0e4cb72f760bb4ae04e9","infoHashBuffer":{"type":"Buffer","data":[32,22,248,221,161,186,223,95,255,159,14,76,183,47,118,11,180,174,4,233]},"announce":[],"urlList":[]}}