{"title":"Kelly Clarkson - Breakaway","uid":4374316,"size":143988740,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2204911d633c3cdfe2abef40fed3b8a560003c70&amp;dn=Kelly+Clarkson+-+Breakaway&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1220325610,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Breakaway&quot; is a 2004 song co-written by Avril Lavigne, Bridget Benenate and Matthew Gerrard and produced by John Shanks. It was recorded by pop rock singer Kelly Clarkson for the soundtrack to the film The Princess Diaries 2: Royal Engagement by Disney Records where it quickly became a charting single and video from the soundtrack. Later, it was included on Clarkson&amp;#039;s second album, Breakaway, being released again by RCA Records as the album&amp;#039;s first single. It was the first single in North America, Latin America and Australia, and the fifth single in Europe and Indonesia, from Clarkson&amp;#039;s second album.\n\nBecause &quot;Breakaway&quot; was recorded for The Princess Diaries 2: Royal Engagement, the music video is tied in with the film. Clarkson wanted the video to be balanced between the theme of the song and the theme of the film. The video includes both themes, starting with a young actress, Lindsey Krueger, representing Clarkson as a child, who can be seen looking forlorn. Years pass, and an adult Clarkson, now a star, is seen attending the fictional premiere of The Princess Diaries 2: Royal Engagement. Scenes from the film can be seen when Clarkson remembers her past, and how she &quot;broke away&quot;. Originally the video was supposed to include more scenes of Clarkson growing up at a more gradual pace, but they had to be eliminated because of time constraints.\n\nThe music video released in the UK was filmed at the London Hammersmith Apollo when Clarkson toured Europe.\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2204911d633c3cdfe2abef40fed3b8a560003c70","amp;dn":"Kelly+Clarkson+-+Breakaway","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2204911d633c3cdfe2abef40fed3b8a560003c70","infoHashBuffer":{"type":"Buffer","data":[34,4,145,29,99,60,60,223,226,171,239,64,254,211,184,165,96,0,60,112]},"announce":[],"urlList":[]}}