{"title":"War of the Worlds by H.G.Wells (Star Trek Series Cast)","uid":4591911,"size":21426937,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:22d7ba1159cd95d6fb04a14dbe4dd99fca681dff&amp;dn=War+of+the+Worlds+by+H.G.Wells+%28Star+Trek+Series+Cast%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Welshguy","files":-1,"time":1229868174,"description":"War Of The Worlds! (Star Trek Series Cast) (L.A. Theater Works) [ABRIDGED] [AUDIOBOOK] \n\nby H.G. Wells (Author), John De Lancie (Narrator), Leonard Nimoy (Narrator), Jerry Hardin (Narrator), Gates McFadden (Narrator), Armin Shimerman (Narrator), Brent Spiner (Narrator), Wil Wheaton (Narrator) \n\n\n\n\nWith brilliantly appropriate casting, L.A. Theatre Works presents a reinterpretation of Orson Welles' radio adaptation of &quot;War of the Worlds,&quot; starring members of &quot;Star Trek&quot; and &quot;Star Trek: The Next Generation.&quot; (It's even directed by TNG's John de Lancie.) Fifty-nine years after its original broadcast, &quot;War of the Worlds&quot; still sends &quot;waves of fear&quot; through listeners as they hear reports of the destruction of modern life by aliens from Mars. Leonard Nimoy's Professor Pierson is rendered with grace and poignancy as &quot;the last man on earth.&quot; Brent Spiner is excellent in his role as the stranger in the latter half of the piece. With its heart-racing pace and fantastic sound effects, &quot;War of the Worlds&quot; reminds us how realistic radio drama can be.\n\n\nListen, amazed as actors from television's Star Trek re-create the &quot;eyewitness&quot; report that caused a nationwide panic in 1938 when first performed on the radio by Orson Welles and the Mercury Theatre Company. Narrated by Leonard Nimoy of the original Star Trek series, the breathless pace and convincing details of this classic drama are brilliantly reinterpreted in this full-cast production by L.A. Theatre Works. Joining Leonard Nimoy are Star Trek actors Jerry Hardin, Gates McFadden, Dwight Schultz, Armin Shimerman, Brent Spiner and Wil Wheaton.\n\n\nA classic and no other way to say it! Some of the cast have sadly passed away so well worth collecting this.\n\nPlease seed as much as your able so others can enjoy this!\nArtwork included!","torrent":{"xt":"urn:btih:22d7ba1159cd95d6fb04a14dbe4dd99fca681dff","amp;dn":"War+of+the+Worlds+by+H.G.Wells+%28Star+Trek+Series+Cast%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22d7ba1159cd95d6fb04a14dbe4dd99fca681dff","infoHashBuffer":{"type":"Buffer","data":[34,215,186,17,89,205,149,214,251,4,161,77,190,77,217,159,202,104,29,255]},"announce":[],"urlList":[]}}