{"title":"HEROIC TALES - THE BILL EVERETT ARCHIVES volume 2 (2013) (Fantag","uid":8973351,"size":308932493,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:234d5f5b5f01344c3b4d4b2136c9e6ae23d8747a&amp;dn=HEROIC+TALES+-+THE+BILL+EVERETT+ARCHIVES+volume+2+%282013%29+%28Fantag&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1380378883,"description":"Heroic Tales: The Bill Everett Archives Vol. 2\n\nAuthor: Bill Everett; edited by Blake Bell\n248 Pages, full color\n2013\n\nThe 1939 creation of the Sub-Mariner for the first issue of Marvel Comics assures Bill Everett a place in history. Co-creating Daredevil, the Man Without Fear, for Marvel Comics in 1964 gave Everett a link to one of the most popular superheroes of the past 50 years. And producing over 400 additional pages of superhero-related work in the very early days of the Golden Age of Comics (1938-42) makes Bill Everett a legend.\n\nHeroic Comics: The Bill Everett Archives Vol. 2 collects over 200 pages of never-before-reprinted work from such titles as Amazing Mystery Funnies (1938), Amazing-Man Comics (1939), Target Comics (1940), Heroic Comics (1940), and Blue Bolt Comics (1940). These titles feature an endless array of vintage Everett characters such Amazing-Man, Hydroman, Skyrocket Steele, The Chameleon and many more, all produced by Everett's shop Funnies, Inc. for such clients as Centaur, Novelty Press, and Eastern Color. This book also features, reprinted for the first time, the rarest of Everett material, his romance work from the early 1950s for Eastern Color on titles such as New Heroic Comics (1950/51) and Personal Love (1953). All of the stories within display Everett's brilliant cartooning and energetic storytelling growing by leaps and bounds.\n\nEdited by best-selling author and comic-book historian Blake Bell (Strange and Stranger: The World of Steve Ditko), The Bill Everett Archives is a stunning companion to Bell's 2010 critically acclaimed Everett biography and art book, Fire and Water: Bill Everett, The Sub-Mariner and the Birth of Marvel Comics. This volume follows the format of Bell's Steve Ditko Archives series; never-before-reprinted, beautifully restored, full-color stories from one of comic books' greatest visionaries and most accomplished artists. This book also includes an introduction about the man, his art, the history of the era, and his relationship with Marvel Comics.\n","torrent":{"xt":"urn:btih:234d5f5b5f01344c3b4d4b2136c9e6ae23d8747a","amp;dn":"HEROIC+TALES+-+THE+BILL+EVERETT+ARCHIVES+volume+2+%282013%29+%28Fantag","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"234d5f5b5f01344c3b4d4b2136c9e6ae23d8747a","infoHashBuffer":{"type":"Buffer","data":[35,77,95,91,95,1,52,76,59,77,75,33,54,201,230,174,35,216,116,122]},"announce":[],"urlList":[]}}