{"title":"Hybrid Identities: Theoretical and Empirical Examinations","uid":6624807,"size":1886832,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:267688e4189fdd24d13f691793c08c0b5ae74136&amp;dn=Hybrid+Identities%3A+Theoretical+and+Empirical+Examinations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1314118818,"description":"Hybrid Identities: Theoretical and Empirical Examinations (Studies in Critical Social Sciences)\nKeri E. Iyall Smith (Editor), Patricia Leavy (Editor)\n\nHardcover: 409 pages\nPublisher: Brill Academic Pub (September 15, 2008)\nLanguage: English\nISBN-10: 9004170391\nISBN-13: 978-9004170391\n\nCombining theoretical and empirical pieces, this book will explore the emerging theoretical work seeking to describe hybrid identities while also illustrating the application of these theories in empirical research. The sociological perspective of this volume sets it apart from others. Hybrid identities continue to be predominant in minority or immigrant communities, but these are not the only sites of hybridity in the globalized world. Given a compressed world and a constrained state, identities for all individuals and collective selves are becoming more complex. The hybrid allows for the perpetuation of the local, in the context of the global.This book presents studies of types of hybrid identities: transnational, double consciousness, gender, diaspora, the third space, and the internal colony. Contributors include: Keri E. Iyall Smith, Patrick Gun Cuninghame, Judith R. Blau, Eric S. Brown, Fabienne Darling-Wolf, Salvador Vidal-Ortiz, Melissa F. Weiner, Bedelia Nicola Richards, Keith Nurse, Roderick Bush, Patricia Leavy, Trinidad Gonzales, Sharlene Hesse-Biber, Emily Brooke Barko, Tess Moeke-Maxwell, Helen Kim, Bedelia Nicola Richards, Helene K. Lee, Alex Frame, Paul Meredith, David L. Brunsma and Daniel J. Delgado.","torrent":{"xt":"urn:btih:267688e4189fdd24d13f691793c08c0b5ae74136","amp;dn":"Hybrid+Identities%3A+Theoretical+and+Empirical+Examinations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"267688e4189fdd24d13f691793c08c0b5ae74136","infoHashBuffer":{"type":"Buffer","data":[38,118,136,228,24,159,221,36,209,63,105,23,147,192,140,11,90,231,65,54]},"announce":[],"urlList":[]}}