{"title":"Video2Webcam 3.4.0.6 Incl Keygen - KurdTM","uid":8495915,"size":3105444,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:26768386dc56faa5f8a489fc3be5698e0a5848f2&amp;dn=Video2Webcam+3.4.0.6+Incl+Keygen+-+KurdTM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KurdTM","files":-1,"time":1369143475,"description":"Video2Webcam 3.4.0.6  enables you to show video clips as virtual webcam during video chat whether you own a real webcam or not. You could either share your home-made video clips easily with your friends while chatting on line or make fun of them by pretending to be somebody else. Video2Webcam 3.4.0.6  - With it, you can play a variety of videos on messengers and switch between real &amp; virtual webcams easily &amp; quickly.It supports all kinds of media file formats including video formats (avi, asf, flv, mp4,mpeg, mpg, ram, rm, rmvb, wmv and etc.) and picture formats (jpg, gif, bmp, png and etc). Besides, it works on all webcam programs such as MSN, Camfrog, Skype, ICQ, AIM, Paltalk, Yahoo Messenger, ANYwebcam, Stickam, ICUII, Ustream.tv, iSpQ, etc.\n \nKey Features of Video2Webcam 3.4.0.6 :\nShow video clips during video chat - You could either share your home made videos with your family or make fun of your friends by pretending to be somebody else.\nWork even without a real webcam - Play a variety of videos on messengers no matter whether you have a real webcam or not.\nSupport all kinds of media file formats - Include video formats (avi, asf, flv, mp4,mpeg, mpg, ram, rm, rmvb, wmv and etc.) and picture formats (jpg, gif, bmp, png and etc).\nWork for all webcam programs - MSN, Camfrog, Skype, ICQ, AIM, Paltalk, Yahoo Messenger, ANYwebcam, Stickam, ICUII, Ustream.tv, iSpQ.","torrent":{"xt":"urn:btih:26768386dc56faa5f8a489fc3be5698e0a5848f2","amp;dn":"Video2Webcam+3.4.0.6+Incl+Keygen+-+KurdTM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26768386dc56faa5f8a489fc3be5698e0a5848f2","infoHashBuffer":{"type":"Buffer","data":[38,118,131,134,220,86,250,165,248,164,137,252,59,229,105,142,10,88,72,242]},"announce":[],"urlList":[]}}