{"title":"PROJECT X XVID CAM GLOBE","uid":7100203,"size":816511077,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:271b91df98554a8672bc6e4156f63270d578e8e2&amp;dn=PROJECT+X+XVID+CAM+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1331667297,"description":"* XVID   * 01H17M39S    * + 1200 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n\n* Plot :\n\nThe film begins with a disclaimer from Warner Bros. by &quot;apologizing&quot; to the citizens of North Pasadena.\n\nThomas (Thomas Mann) is turning seventeen, and his friends Costa (Oliver Cooper) and J.B. (Jonathan Daniel Brown) are planning to throw a huge birthday bash at Thomas' house, and to increase their popularity among their schoolmates. As Thomas' parents are going away for the weekend for their anniversary, Thomas' father lays down the rules, which include having a max of five people at their house, not to drive his expensive Mercedes, and no one is allowed in his office. Thomas is first reluctant to have the party at his house because of these rules, but Costa encourages him to have the party. Costa even hires AV-student Dax (Dax Flame), to record the events. Throughout their day at school, Costa and J.B. remind everyone about the party using text messaging and spreading it by word of mouth. Thomas also decides to invite Alexis (Alexis Knapp), the hottest girl at school. Thomas also talks to his best female friend Kirby (Kirby Bliss Blanton), whom he has a crush on.\n\nAs the trio plan for the party, Costa lures Thomas and J.B. to buy marijuana for the party from T-Rick (Rick Shapiro), a former soldier living in a dilapidated house. As T-Rick goes to get the weed for them, Costa steals a gnome displaying the middle finger and gives it to Dax to put in the car. As the three leave T-Rick's home, T-Rick discovers his gnome stolen, and chases them relentlessly as they escape in Thomas' mini-van which he received as a gift from his parents, destroying the windshield in the process.\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:271b91df98554a8672bc6e4156f63270d578e8e2","amp;dn":"PROJECT+X+XVID+CAM+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"271b91df98554a8672bc6e4156f63270d578e8e2","infoHashBuffer":{"type":"Buffer","data":[39,27,145,223,152,85,74,134,114,188,110,65,86,246,50,112,213,120,232,226]},"announce":[],"urlList":[]}}