{"title":"Night Watch (Nochnoi Dozor) [2004] [H.264] [Frank_UK].mp4","uid":4268848,"size":872509136,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:272c395331f9d2fdb414f1e2c90f79446e1fae90&amp;dn=Night+Watch+%28Nochnoi+Dozor%29+%5B2004%5D+%5BH.264%5D+%5BFrank_UK%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Frank_UK","files":1,"time":1214842836,"description":"Night Watch (Nochnoi Dozor)\n\nRussian with English Subtitles\n\nAspect Ratio: 16:9 Widescreen 640x360\n\nVideo: H.264 900kbps 25fps\n\nAudio: AAC 128kbps Stereo\n\n[Frank_UK]\t\n\nFor as long as humanity has existed, there have been &quot;Others&quot; among us; Witches, Vampires and Shape-Shifters who are soldiers in the eternal war between Light and Dark.\n\nLight Others protect mankind from Dark Others, who plague and torture humans.\n\nOver 1000-years ago a truce was struck between Gesser, Lord of the Light, and Zavulon, General of Darkness. They agreed that no one could be forced to good or evil, people must choose freely for themselves. To uphold this truce, each side established underground forces; the soldiers of the Light would be called Night Watch, making sure Dark Others obeyed the truce. And the soldiers of Darkness would be called Day Watch, to do the same. \n\nAncient prophecy foretells that one day the Great One will arrive who can end the threat of an apocalyptic battle between Light and Dark Others. That day has come, and the Great One, once he or she is identified, must choose whether to destroy the light within or battle the surrounding darkness. This choice will reveal mankind&amp;#039;s destiny.\n\n1992:\nAnton Gordesky, a broken-hearted man, desperate to win back his fiancÃƒÂ©e, seeks out the black magic services of a witch. This Dark Other, about to use her magic for evil, is arrested by the Night Watch moments before for completing her spell. The cataclysmic event awakens Anton to discover that he is an Other. Now he must choose whether to become a protector of light or warrior of darkness. \n\nToday:\nSomewhere on the streets of Moscow the &quot;Great One&quot; wanders, oblivious to his or her powers. Anton, along with his Night Watch team, race to find and protect the Great One from Zavulon and his Day Watch vampires who seek to plunge the world into darkness. Whoever reaches the Great One first will hold the balance of power in their hands and control the fate of humanity.\n\nNIGHT WATCH (NOCHNOI DOZOR) is the first installment of a trilogy based on the best-selling Russian sci-fi novels of Sergei Lukyanenko (which also includes Day Watch and Dusk Watch). This visionary horror fantasy film features a dazzling mix of mind-blowing effects, adrenaline-fuelled action and suspenseful terror. \n\nNIGHT WATCH (NOCHNOI DOZOR) was an instant smash hit in its native Russia when it was released in July 2004 shattering all previous box office records. Made for a mere $4 million, the film surpassed both LORD OF THE RINGS: THE RETURN OF THE KING and SPIDER-MAN 2 at the Russian box office. Internationally acclaimed, it was also Russia&amp;#039;s contender for the 2004 foreign language OscarÃ‚Â® award.\n\n\n","torrent":{"xt":"urn:btih:272c395331f9d2fdb414f1e2c90f79446e1fae90","amp;dn":"Night+Watch+%28Nochnoi+Dozor%29+%5B2004%5D+%5BH.264%5D+%5BFrank_UK%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"272c395331f9d2fdb414f1e2c90f79446e1fae90","infoHashBuffer":{"type":"Buffer","data":[39,44,57,83,49,249,210,253,180,20,241,226,201,15,121,68,110,31,174,144]},"announce":[],"urlList":[]}}