{"title":"Tarasov-Tarasova-Discussions-On-Refraction-Of-Light","uid":7464490,"size":12683494,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2830c294d1795113167aebff0947860b48410280&amp;dn=Tarasov-Tarasova-Discussions-On-Refraction-Of-Light&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"damitr","files":1,"time":1342948636,"description":"Discussions on Refraction of Light (Science for Everyone)\nby \nLev Tarasov and Aldina Tarasova\n\n\n\nWhy does a beam of light change its direction when passing through the interface between two media? Why does the setting sun appear oblate on the horizon? What causes mirages? Why does a prism disperse sunlight into different colours? How can one calculate the angular dimensions of a rainbow? Why do distant objects appear close when we view them through a telescope? What is the structure of the human eye?  Why does a light ray get broken into two in a crystal? Can the plane of the polarization of a ray be turned?  Can light rays be bent at will?  Is the refractive index controllable?\n\n    This book will give the reader answers t o all these questions. He will get to know how the law of refraction was discovered, how Newton's theory of the refraction of light in the atmosphere was nearly lost forever, how Newton's experiments changed radically the old ideas concerning the origin of colours, how the telescope was invented, how it took twenty centuries to understand the anatomy of  human vision, and how difficult it was t o discover the polarization of light.  To make the historical and the physical aspects of the book more convincing, the authors have introduced a number of problems and their detailed solutions, geometrical constructions, and optical diagrams of some instruments and devices. No doubt, the reader will get a better understanding of some excerpts from the classics of physical optics (for example, Newton's &quot;Optics&quot; or Huygens' &quot;Treatise on Light&quot;) after they have been illustrated with the help of diagrams, constructions and concrete problems.  Thus, as he explores the world of refracted rays, the reader will be able to familiarize himself not only with the physics of the topics being considered but also with the evolution of some of the concepts of physics and their practical applications to problems, constructions and optical schemes. It is the authors' hope that this journey will be both instructive and enjoyable.\n\nThis book was first published in English in 1984 by Mir in the Science for Everyone series and was translated from Russian by Vladimir Kolesnikov\nand Nicolas Kulanin.\n\nThanks to Anish.Dot for this book.\n\nReleased on TPB by mirtitles.org\n\nPDF | OCR | Bookmarked | Cover | Paginated | 242 Pages | 12.1 MB\n ","torrent":{"xt":"urn:btih:2830c294d1795113167aebff0947860b48410280","amp;dn":"Tarasov-Tarasova-Discussions-On-Refraction-Of-Light","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2830c294d1795113167aebff0947860b48410280","infoHashBuffer":{"type":"Buffer","data":[40,48,194,148,209,121,81,19,22,122,235,255,9,71,134,11,72,65,2,128]},"announce":[],"urlList":[]}}