{"title":"Tears For Fears - Head Over Heels","uid":4912427,"size":150761476,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2855438eb750c2df42d720efd8f069d7ea096a89&amp;dn=Tears+For+Fears+-+Head+Over+Heels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1243239868,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Head over Heels&quot; is a song by the British pop/rock band Tears for Fears. It was the band's tenth single release in the United Kingdom (the fourth taken from their second LP Songs from the Big Chair) and eighth UK Top 40 hit, peaking at #12 in July 1985. In the USA, it was the third single from the album and continued the band's run of hits there, peaking at #3 on the Billboard Hot 100. A limited edition four-leaf clover shaped picture disc was issued for the single's release in the UK.\n\n&quot;Head over Heels&quot; had been developed nearly two years prior as part of a segue with the song &quot;Broken&quot;, which was previously a stand alone B-side to the 1983 &quot;Pale Shelter&quot; single. As the two songs share the same piano/synth motif, &quot;Head over Heels&quot; eventually came to be sandwiched in between two bookend parts of &quot;Broken&quot; in live performances. This placement carried over to the final track listing of the Big Chair LP, with a studio recording of &quot;Broken&quot; preceding &quot;Head Over Heels&quot; and a live reprise of &quot;Broken&quot; following it.\n\nThe song features guitarist Roland Orzabal on lead vocals.\n\n&quot;Head over Heels&quot; was featured in the film Donnie Darko alongside a cover of Tears for Fears' &quot;Mad World&quot; by Gary Jules and Michael Andrews.\n\nSongs from the Big Chair is the second album by the British pop band Tears for Fears. It was released in 1985, and remains their highest selling album to date. The album peaked at no.2 in the UK (where it remained in the Top 10 for over six months and in the Top 40 for over a year) and reached no.1 (for five weeks) in the US. It contained a string of international hit singles, including: &quot;Mothers Talk&quot;, &quot;Shout&quot;, &quot;Everybody Wants to Rule the World&quot; and &quot;Head Over Heels&quot;.\n\nThe album title was derived from the 1976 television film Sybil about a woman with multiple personality disorder who only feels safe when she is sitting in her analyst's &quot;big chair&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2855438eb750c2df42d720efd8f069d7ea096a89","amp;dn":"Tears+For+Fears+-+Head+Over+Heels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2855438eb750c2df42d720efd8f069d7ea096a89","infoHashBuffer":{"type":"Buffer","data":[40,85,67,142,183,80,194,223,66,215,32,239,216,240,105,215,234,9,106,137]},"announce":[],"urlList":[]}}