{"title":"Ancient Eugenics: The Arnold Prize Essay For 1913","uid":11551277,"size":278223,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28683b59c32f1e6a82bc790f0a79d98399b476d1&amp;dn=Ancient+Eugenics%3A+The+Arnold+Prize+Essay+For+1913&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":3,"time":1416780549,"description":"The preface to a history of Eugenics may be compiled from barbarism, for the first Eugenist was not the Spartan legislator, but the primitive savage who killed his sickly child. The cosmic process was checked and superseded by another as ruthless as Nature sown method of elimination. The lower the community, the more rapidly it reproduces itself. There is an extravagant production of raw material, and the way of Nature, red in tooth and claw, is the ruthless rejection of all that is superfluous. When there is no differential birth-rate, the result of foresight and self-control, and the attainment of a higher level of civilization, Nature adjusts the balance by means of a differential death-rate. In the days when human or animal foe threatened on every side, when force and fraud were the two cardinal virtues, and the life of man was solitary, poor, nasty, brutish, and short, natural selection must have been ruthless and severe. Some conception of the wasteful processes of Nature dawned upon the savage mind. While they lived their short lives, the weakly, the deformed, and the superfluous were a burden to the tribe","torrent":{"xt":"urn:btih:28683b59c32f1e6a82bc790f0a79d98399b476d1","amp;dn":"Ancient+Eugenics%3A+The+Arnold+Prize+Essay+For+1913","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28683b59c32f1e6a82bc790f0a79d98399b476d1","infoHashBuffer":{"type":"Buffer","data":[40,104,59,89,195,47,30,106,130,188,121,15,10,121,217,131,153,180,118,209]},"announce":[],"urlList":[]}}