{"title":"Rupert Sheldrake - Réenchanter la science","uid":12986156,"size":9774320,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29c707fa50aea5afa54af63c4a1382487eee8614&amp;dn=Rupert+Sheldrake+-+R%26eacute%3Benchanter+la+science&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":4,"time":1450083431,"description":"Rupert Sheldrake - Réenchanter la science\r\nAlbin Michel | ISBN : 2226245456 | 2003-08 | EPUB | 365 pages | 4 MB\r\n\r\nFigure de la science contemporaine, pionnier de la découverte du processus de vieillissement cellulaire, le biologiste Rupert Sheldrake, chercheur associé à l'université de Cambridge, suscite passions et débats au sein de la communauté scientifique.\r\nSon nouveau livre, qui a déclenché une polémique dans les pays anglo-saxons, revient sur sa théorie de la « résonance morphique » et remet en cause les bases mêmes de la recherche fondamentale. Alors que les sciences et la technologie sont au faîte de leur puissance, des postulats vieux de plusieurs siècles l'empêchent aujourd'hui d'avancer. En pointant l'un après l'autre ces postulats érigés en dogmes intouchables (la nature est une machine ; les lois de la nature sont immuables ; la matière est inconsciente ; les phénomènes « paranormaux » sont des illusions ; la conscience est une production du cerveau...), il démontre dans cet essai aussi remarquable que subversif l'urgence de s'en libérer. Et lance le mot d'ordre d'une indispensable régénération de la science, passionnante invitation à imaginer une autre façon de voir le monde.\r\n\r\nAuteur de best-sellers mondiaux, dont &quot;Une nouvelle science de la vie&quot; (Le Rocher) et &quot;L'âme de la nature&quot; (Albin Michel), le biologiste Rupert Sheldrake, directeur de recherche à Cambridge et membre-chercheur de la Royal Society, la plus ancienne académie des sciences du monde, est un scientifique novateur et iconoclaste. Pour certains même, un hérétique dont les livres « devraient êtres brûlés » (Nature) !\r\nCe pionnier de la découverte du processus de vieillissement des cellules est surtout connu pour sa théorie des « champs morphogénétiques », qui pourrait expliquer comment les espèces vivantes prennent forme","torrent":{"xt":"urn:btih:29c707fa50aea5afa54af63c4a1382487eee8614","amp;dn":"Rupert+Sheldrake+-+R%26eacute%3Benchanter+la+science","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29c707fa50aea5afa54af63c4a1382487eee8614","infoHashBuffer":{"type":"Buffer","data":[41,199,7,250,80,174,165,175,165,74,246,60,74,19,130,72,126,238,134,20]},"announce":[],"urlList":[]}}