{"title":"beach house, The - James Patterson-viny","uid":6415911,"size":734515,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29d6f38ab7b785c9866961f1935aa0a4187435ed&amp;dn=beach+house%2C+The+-+James+Patterson-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"daemonx0x","files":-1,"time":1306159916,"description":"beach house, The - James Patterson-viny\n\n&quot;Jack Mullen is in law school in New York City when the news comes that his brother, Peter, has drowned in the ocean off East Hampton. Jack knows his brother practically grew up in the water, and that this couldn't be an accident. Someone must have wanted his brother dead.&quot; &quot;But the police say otherwise. As Jack tries to uncover details of his brother's last night, he confronts a maddening barricade of lawyers, police, and paid protectors who separate the wealthy summer residents from local workers like Peter. Motivated by a hundred forms of grief, Jack rallies his home-town friends to help him find the truth of Peter's death - no matter how rich or corrupt the people who stand in their way.&quot; Jack's relentless crusade puts him into a head-on collision with one of the most powerful and ruthless men in New York, a man who wipes out resistance with a snap of his fingers. As it unfolds that his brother was involved with some of the richest women and men in America - in ways Jack never imagined - his dream of justice fades. Only if he can somehow beat the rich at their own game will he be able to avenge his brother","torrent":{"xt":"urn:btih:29d6f38ab7b785c9866961f1935aa0a4187435ed","amp;dn":"beach+house%2C+The+-+James+Patterson-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29d6f38ab7b785c9866961f1935aa0a4187435ed","infoHashBuffer":{"type":"Buffer","data":[41,214,243,138,183,183,133,201,134,105,97,241,147,90,160,164,24,116,53,237]},"announce":[],"urlList":[]}}