{"title":"Anaconda 1-4 Box PAL DVD9","uid":5546029,"size":17804300758,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2a6c48f2de6402d3c01c98085bb19913890d63b7&amp;dn=Anaconda+1-4+Box+PAL+DVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ubehage","files":-1,"time":1273386238,"description":"Anaconda 1-4 Box\n----------------\n\nAnaconda (1997)\n---------------\n&quot;You can't scream if you can't breathe.&quot;\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0118615/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0118615/&lt;/a&gt;\n\nAudio: English (DS5.1), German (DS5.1)\n\nSubs: Danish, Swedish, Norwegian, Finnish, English, German, Turkish\n\nExtra Materials:\n- none.\n\n\nPlot outline:\nSent on a National Geographic survey of the jungle to capture the largest anaconda, a group of cardboard cutouts posing as actors bite off more than they can chew and get chewed up by an over sized and very agitated snake. That sums up the film. What looks like it may be a turkey is saved by a CGI snake upstaging all the actors and devouring them. Unfortunately J-Lo survives since she would be too glamorous to be devoured and she would have made the snake look tame by comparison by throwing a hissy fit if she was to be eaten. The perfect Saturday night film showing that not all films need to aspire to Citizen Kane and fun for the sake of it is an art form in itself.\n\n\n\nAnacondas: The Hunt for the Blood Orchid (2004)\n-----------------------------------------------\n&quot;The hunters will become the hunted.&quot;\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0366174/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0366174/&lt;/a&gt;\n\nAudio: English (DS5.1), Czech (DS5.1), Hungarian (DS5.1)\n\nSubs: Danish, Swedish, Norwegian, Finnish, English, Arabic, Bulgarian, Croatian, Czech, Dutch, Greek, Hebrew, Hindi, Hungarian, Icelandic, Romanian, Serbian, Slovenian, Turkish\n\nExtra Materials:\n- none.\n\n\nPlot outline:\nIn New York, the ambitious Dr. Jack Byron and his associate Gordon Mitchell present the research of his assistant Sam Rogers to the CEO and board of directors of a corporation to sponsor a scientific expedition to Borneo. The objective is to find a flower, Blood Orchid, that flourishes for a couple of weeks every seven years and could be a fountain of youth, prolonging the expectation of life of human beings. They are succeeded and once in Borneo, they realize that it is the raining season and there is no boat available to navigate on the river. They pay US$ 50,000.00 to convince Captain Bill Johnson and his partner Tran to sail to the location. After an accident in a waterfall, the survivors realize that a pack of anacondas have gathered for mating and their nest is nearby the plantation of Blood Orchid, which made them bigger and bigger.\n\n\n\nAnaconda III (2008) (TV)\n------------------------\n&quot;They Can Taste Your Fear.&quot;\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1137996/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1137996/&lt;/a&gt;\n\nAudio: English (DS5.1), Czech (DS5.1), Hungarian (DS5.1), Polish (DS5.1)\n\nSubs: Danish, Swedish, Norwegian, Finnish, English, Arabic, Bulgarian, Croatian, Czech, Hebrew, Hindi, Hungarian, Icelandic, Polish, Romanian, Slovakian, Slovenian, Turkish.\n\nExtra Materials:\n- none.\n\n\nPlot outline:\nA mercenary-for-hire accepts a mission from a billionaire to capture a dangerous snake that could possibly help cure a terminal illness.\n\n\n\nAnaconda 4: Trail of Blood (2009) (TV)\n--------------------------------------\n&quot;Bigger, Faster, Hungrier.&quot;\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1150934/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1150934/&lt;/a&gt;\n\nAudio: English (DS5.1), Italian (DS5.1)\n\nSubs: Danish, Swedish, Norwegian, Finnish, English, Italian\n\nExtra Materials:\n- none.\n\n\nPlot outline:\nPicking up immediately where Anaconda 3 left off, herpetologist Amanda Hayes finally learns her employer Murdoch's true colors when he hires a doctor to harvest a fresh supply of blood orchids to experiment with the regenerative nectar on a baby snake in order to seek treatment for his own terminal illness. Amanda is forced to secretly bring together another team of scientists whom face off against a heavily armed squad of Murdoch's men to steal the coveted orchids before the killer Anaconda hunts both parties down.","torrent":{"xt":"urn:btih:2a6c48f2de6402d3c01c98085bb19913890d63b7","amp;dn":"Anaconda+1-4+Box+PAL+DVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a6c48f2de6402d3c01c98085bb19913890d63b7","infoHashBuffer":{"type":"Buffer","data":[42,108,72,242,222,100,2,211,192,28,152,8,91,177,153,19,137,13,99,183]},"announce":[],"urlList":[]}}