{"title":"L.A.Success - The Novel by Lonnie Raines","uid":13219883,"size":1310182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b833091de40adf9e6a6850b3628333035da0dff&amp;dn=L.A.Success+-+The+Novel+by+Lonnie+Raines&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vladimir2112","files":1,"time":1452743829,"description":"L.A. Success is a very weird, quirky comedy that will change the way you see Los Angeles forever. It is a book in which the drunkenness and pure stupidity of the narrator lead to endlessly ridiculous situations. Readers who want books to be realistic and believable should definitely avoid this bizarre tale.\r\n\r\nBut for those of you who can handle a poodle named &quot;Ballsack&quot;, a toilet-dwelling extra-terrestrial, and a foreign exchange student who learned to speak English by memorizing heavy metal lyrics, read on:\r\n\r\nIn the black hole of excess and wealth that is Los Angeles, Lonnie Herisson’s life is about to get weird. Forced to find work after his live-in girlfriend stops paying the bills and moves out of his eyesore of a house, Lonnie takes a job house sitting for a private investigator. When a mysterious man arrives looking to hire someone to keep tabs on his supposedly unfaithful lover, Lonnie sees it as a golden opportunity to make easy money. He pretends to be the investigator and takes the case. The job leads Lonnie into the seedy world of L.A. real estate, where his target, the sexagenarian, chain-smoking nymphomaniac Gertie Elliot, uses a variety of dubious techniques to sell houses. But as he gets deeper into the investigation, he learns that things aren’t as obvious as they appeared to be at the beginning, and that Gertie Elliot is actually linked to the surprising, secret origins of one of Hollywood’s most cherished films. With this new knowledge in hand, Lonnie must find a way to make as much money as possible off of an increasingly complicated situation. Funded by rent money he receives from his mysterious foreign renter and accompanied by his side-kick black poodle, Lonnie navigates his way through blackmail, violence, and epic superficiality as he attempts to straighten out his life, win back his girlfriend, and become an L.A. success","torrent":{"xt":"urn:btih:2b833091de40adf9e6a6850b3628333035da0dff","amp;dn":"L.A.Success+-+The+Novel+by+Lonnie+Raines","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b833091de40adf9e6a6850b3628333035da0dff","infoHashBuffer":{"type":"Buffer","data":[43,131,48,145,222,64,173,249,230,166,133,11,54,40,51,48,53,218,13,255]},"announce":[],"urlList":[]}}