{"title":"Biochemistry and Molecular Biology of Parasites","uid":15455273,"size":30298481,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b868e412dbc1f076cc38420ec3fd0d2e70c325b&amp;dn=Biochemistry+and+Molecular+Biology+of+Parasites&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469980548,"description":"Biochemistry and Molecular Biology of Parasites - Joseph Marr, Miklos Muller (AP, 1995).pdf\r\n\r\nThe study of parasitic organisms at the molecular level has yielded fascinating new insights of great medical, social, and economical importance, and has pointed the way for the treatment and prevention of the diseases they cause. Biochemistry and Molecular Biology of Parasites presents an up-to-date account of this modern scientific discipline in a manner that allows and encourages the reader to place the biochemistry and molecular biology of these organisms in their biological context. The chapters are cross-referenced and grouped in an arrangement that provides a fully integrated whole, and permits the reader to create a composite of the biochemical function of these organisms.\r\nIndividual chapter includes those devoted to metabolism, in both aerobic and anaerobic protozoa; antioxidant mechanisms; parasite surfaces; organelles; invasion mechanisms; and chemotherapy. The helminths are discussed not only from the point of view of their cellular biochemistry and metabolism, but also with respect to both their integrated functions such as neurochemistry, structure and functions of surfaces, and reproduction. Written by expert investigators, this book will be of interest to all experienced researchers, graduate students, and to the newcomer eager to become familiar with the biochemistry and molecular biology of parasites","torrent":{"xt":"urn:btih:2b868e412dbc1f076cc38420ec3fd0d2e70c325b","amp;dn":"Biochemistry+and+Molecular+Biology+of+Parasites","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b868e412dbc1f076cc38420ec3fd0d2e70c325b","infoHashBuffer":{"type":"Buffer","data":[43,134,142,65,45,188,31,7,108,195,132,32,236,63,208,210,231,12,50,91]},"announce":[],"urlList":[]}}