{"title":"ZOOT WOMAN - DISCOGRAPHY","uid":11291687,"size":670673890,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2cba60b250c022e1a5ecaf1d90a53e5465bf8e94&amp;dn=ZOOT+WOMAN+-+DISCOGRAPHY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mirrormaster82","files":-1,"time":1414337243,"description":"Zoot Woman is a British electronic music group consisting of Adam Blake, Johnny Blake and Stuart Price.\n\nFrom their live shows, the group has gained a worldwide following. With the album Living in A Magazine Zoot Woman established themselves on the music scene. The live act is Adam Blake, Johnny Blake and different supporting musicians.\n\nCredited by many within the industry as one of the most important forerunners of electroclash. The band in full generally disassociates itself from the largely instrumental material released by Adam Blake and Stuart Price before adding Johnny Blake to the line-up and taking a new direction stylistically. This is evidenced by the lack of its coverage on the official website.\n\nStuart Price and Adam Blake also do remixes under the alias Paper Faces and have reworked tracks for Zoot Woman as well as other established recording artists such as Madonna, Scissor Sisters, Armand Van Helden, Chromeo and Frankmusik. DJs Felix Da Housecat and Pete Tong have shown Paper Faces much support.\n\nIncluded in this torrent are all thei albums in 320 kbps and all singles in various\nquality.\n\n2001 - Living in a Magazine \n2003 - Zoot Woman \n2009 - Things Are What They Used To Be \n2014 - Star Climbing \n\nI'll seed this for few days and then it's up to you to keep this one alive.\n\nENJOY AND SEED","torrent":{"xt":"urn:btih:2cba60b250c022e1a5ecaf1d90a53e5465bf8e94","amp;dn":"ZOOT+WOMAN+-+DISCOGRAPHY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cba60b250c022e1a5ecaf1d90a53e5465bf8e94","infoHashBuffer":{"type":"Buffer","data":[44,186,96,178,80,192,34,225,165,236,175,29,144,165,62,84,101,191,142,148]},"announce":[],"urlList":[]}}