{"title":"Live at Watkins Glen (1994)","uid":8372778,"size":108844270,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2ce7094544c8e5644201546e8983b87d0fb7b5f5&amp;dn=Live+at+Watkins+Glen+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"geo64","files":14,"time":1365963121,"description":"Performance: Perfection.\nRecording: Good, considering.\nWhat a Band, what a Band, what a mighty fine Band! This is a loose, exuberant recording made before an intimate crowd of 600,000 at the Watkins Glen &quot;Summer Jam&quot; on July 28 1973, where the Band performed during a de rigueur upstate New York rock-festival thunderstorm. The CD was drawn from the &quot;most complete available tape&quot; of the event, which makes me regret the loss of the rest of the set, as the 45 minutes here are marvelous indeed. At the time of Watkins Glen, the Band was coming out of a period of hibernation, having laid off the road while working on their covers album, Moondog Matinee. They sound feisty and full of sass on this hot July day, anteing up a juking set of jams, cover tunes, a new original (the fatalistic &quot;Endless Highway&quot;, which prefigured their disbanding), and some old favorites. The covers are revelatory, from Rick Danko's soulful reading of the Four Tops' &quot;Loving You Is Sweater Than Ever&quot; to the group's high- spirited stab at Chuck Berry's &quot;Back to Memphis&quot; to a shaggy ramble through Bob Dylan's salty &quot;Basement Tapes&quot;-era tossoff, &quot;Don't Ya Tell Henry&quot;. The group chemistry is amazing: Robbie Robertson's steely, jabbing guitar, Garth Hudson's ornate keyboard sorcery, Levon Helm's joyfully musical drum thumping, Danko's bopping bass lines, Richard Manuel's rich piano chording. This previously lost concert seems, in hindsight, to have been a high point for the Band, whose playing is informed with both a casual humor and a reckless energy lacking in The Last Waltz. This is how the Band should be remembered.\n--Parke Puterbaugh, &quot;Stereo Review&quot;, Aug. 1995,\n\n\nPLEASE SEED. ","torrent":{"xt":"urn:btih:2ce7094544c8e5644201546e8983b87d0fb7b5f5","amp;dn":"Live+at+Watkins+Glen+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ce7094544c8e5644201546e8983b87d0fb7b5f5","infoHashBuffer":{"type":"Buffer","data":[44,231,9,69,68,200,229,100,66,1,84,110,137,131,184,125,15,183,181,245]},"announce":[],"urlList":[]}}