{"title":"Gordon Giltrap-Visionary (1976), Fear of the Dark (1978) EAC","uid":15578922,"size":446460844,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2d4e1eb34b9339723a56801f9f59c3837369f039&amp;dn=Gordon+Giltrap-Visionary+%281976%29%2C+Fear+of+the+Dark+%281978%29+EAC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rontoolsie","files":27,"time":1471378206,"description":"Giltrap started to learn the guitar at the age of twelve. Never receiving any formal tuition on the instrument, he gradually developed his own style and technique.\r\nHis musical career started to take off in the 1960s, when he played on the folk scene in London alongside contemporaries such as Bert Jansch, John Renbourn and Mike Oldfield. Giltrap cites Jansch as a great influence.\r\n\r\nAt the age of eighteen Giltrap signed to Transatlantic Records and between 1968 and 1971 released a folk album (performing guitar and vocals) every year. While popular on the folk and university circuit, Giltrap reached a turning point and received much greater recognition during the 1970s. During this time Giltrap started to concentrate on more purely instrumental pieces, and in 1976 released the album Visionary, based on the art and poetry of William Blake.\r\n\r\nThe success of this album prompted Giltrap to move on from the singer-songwriter approach and to form the Gordon Giltrap Band, which toured extensively in the UK at that time. His follow-up album Perilous Journey consolidated his success, being named one of the best albums of 1977 by The Sunday Times. It peaked in the UK Albums Chart at #29.[2] A single taken from the album, &quot;Heartsong&quot;, received extensive airplay and reached #21 in the UK Singles Chart.[2] The track was later used as the theme tune of the BBC TV series Holiday. Another of Giltrap's tracks, &quot;The Carnival&quot;, was used as the theme to Wish You Were Here...? the holiday programme of ITV.\r\nGiltrap's next album, Fear of the Dark, was released in 1978","torrent":{"xt":"urn:btih:2d4e1eb34b9339723a56801f9f59c3837369f039","amp;dn":"Gordon+Giltrap-Visionary+%281976%29%2C+Fear+of+the+Dark+%281978%29+EAC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d4e1eb34b9339723a56801f9f59c3837369f039","infoHashBuffer":{"type":"Buffer","data":[45,78,30,179,75,147,57,114,58,86,128,31,159,89,195,131,115,105,240,57]},"announce":[],"urlList":[]}}