{"title":"Garfield #1-7","uid":7810095,"size":137095220,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2d7340141efd2427da7399995c54de0a14fa1a8f&amp;dn=Garfield+%231-7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"blackcanary","files":-1,"time":1352503475,"description":"English | CBR | 7 Issues\n\nGarfield #1-7\nPublisher:  KaBOOM!\nPublication Date:  May - November 2012\n\nWritten by Mark Evanier\nArt by Gary Barker (#1-6), Dan Davis (#2-3, 5-7), Mike DeCarlo (#5-7), Mike Heike (#7), Stephanie Heike (#7), and Andy Hirsch (#7)\nColored by Lisa Moore (#3)\n\nGarfield #1\nEveryone's favorite lasagna-scarfing cat opens the fridge to an all-new ongoing comic book series! Join Garfield as he begins his monthly exploits with Jon, Odie, and the rest of the gang in the latest all-ages must-read from KaBOOM! The Garfield Show writer and comics luminary Mark Evanier teams up with beloved Garfield strip cartoonist Gary Barker to bring you all the laughs (and lasagna) you can handle. With brand new stories featuring everyone's favorite feline, this debut #1 issue is sure to please Garfield fans, both new and old alike!\n\nGarfield #2\nThe Big Kitty's comic book extravaganza continues! Garfield, Odie, and the rest of the gang bring the fun and the funny in this all-new KaBOOM! series. What wacky schemes will Garfield come up with next? How will Jon embarrass himself with the ladies this time? There's only way to find out!\n\nGarfield #3\nThe only thing better than a plate of lasagna is an all-new Garfield comic! We've got two hot &amp; fresh stories coming your way from chefs Evanier &amp; Barker, and well, we're getting hungry just thinking about it!\n\nGarfield #4\nThe good times continue to roll with Garfield and friends! Where, oh where, will Garfield send Nermal this time? Will Jon be able to get through a date without embarrassing himself? Well, let's not get too crazy here -- what we CAN guarantee is that the entire gang will bring the funny in two ALL-NEW stories.\n\nGarfield #5\nFEATURING GARFIELD'S PET FORCE! This month, not only will you get two ALL-NEW stories featuring our loveable gang getting into wacky shenanigans, but we're taking a trip to Planet Polyester with our GARFIELD'S PET FORCE back-up story! Don't miss out on the intergalactic goodness!\n\nGarfield #6\nSkip the candy, just give Garfield the lasagna -- on second thought, throw in the candy, too! This month, we've got two terrific Halloween-themed stories for you! Garfield may be lazy, but offer him free treats, and he's running to every house in town!\n\nGarfield #7\nA holiday where you eat and watch TV -- that's Garfield's kind of day! That's right, this month, in addition to a hilarious tale by the Garfield Dream Team of Evanier, Barker, and Davis -- we also have a special Thanksgiving story! What's for dinner? Find out in the pages of GARFIELD!","torrent":{"xt":"urn:btih:2d7340141efd2427da7399995c54de0a14fa1a8f","amp;dn":"Garfield+%231-7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d7340141efd2427da7399995c54de0a14fa1a8f","infoHashBuffer":{"type":"Buffer","data":[45,115,64,20,30,253,36,39,218,115,153,153,92,84,222,10,20,250,26,143]},"announce":[],"urlList":[]}}