{"title":"Red_Widow-S01E01-Pilot.mp4","uid":8168493,"size":206239466,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2dceac56feef4ec8959f571c8476aaa6858de40a&amp;dn=Red_Widow-S01E01-Pilot.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"NetUnit","files":-1,"time":1361377554,"description":"--Hulu Rip--\n\nMelissa Rosenberg (executive producer and head writer on &quot;Dexter&quot; and screenwriter of the Twilight franchise), Howard Klein (executive producer of &quot;The Office,&quot; &quot;Parks &amp; Recreation&quot;) and Endemol Studios (&quot;Hell On Wheels&quot;) join forces for a riveting new thriller that takes you inside the world of crime and intrigue and shows you just how far one woman will go to protect her family. Meet Marta Walraven (Radha Mitchell - Melinda and Melinda) a suburban housewife who's living the good life in Northern California. She has a loving husband, a beautiful home overlooking Sausalito, and three amazing kids. But behind this perfect facade is a family of organized criminals. Marta's father, her brother, and husband Franklin all make their living through illegal means, and up until now, she has turned a blind eye to this fact. But when Franklin is murdered, Marta uncovers a tenacity she never knew she had. She'll do whatever it takes to avenge his death and keep her family alive. Even if it means filling her husband's shoes and joining the family business. As Marta digs into this dark underworld, she'll test her own strength, relying on her resourcefulness, determination and family ties like never before. ","torrent":{"xt":"urn:btih:2dceac56feef4ec8959f571c8476aaa6858de40a","amp;dn":"Red_Widow-S01E01-Pilot.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dceac56feef4ec8959f571c8476aaa6858de40a","infoHashBuffer":{"type":"Buffer","data":[45,206,172,86,254,239,78,200,149,159,87,28,132,118,170,166,133,141,228,10]},"announce":[],"urlList":[]}}