{"title":"MEN IN BLACK 3 xvid cam GLOBE","uid":7303212,"size":1017399049,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ecb4368764849523ae57d0bd515c0b7647454de&amp;dn=MEN+IN+BLACK+3+xvid+cam+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1338106606,"description":"* XVID CAM  * 01H32M20S    * + 1300 Bitrate    * Worked with the Dub plugins\n\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n\n* Plot :\n\nThe intergalactic criminal Boris the Animal (Jemaine Clement) escapes from the LunarMax prison on Earth's moon, intent on going back in time and killing Agent K (Tommy Lee Jones), who on July 16, 1969, had shot off one of his arms and captured him. After investigating a spaceship crash in New York City, and following a skirmish in a Chinese restaurant, K deduces Boris has escaped, and K regrets not having killed him. He returns to his apartment, where all traces of him disappear. Agent J (Will Smith), however, still remembers K, though no one else at Men in Black headquarters does.\n\nAgent O (Emma Thompson), the new Chief after Zed's passing, deduces from J's statements that a fracture has occurred in the space-time continuum. The two realize Boris must have time-jumped to 1969 and killed K, resulting in an imminent invasion of Earth by his race, the Biglodyans, due to the absence of the protective ArcNet device that created a planetary shield around Earth, installed by K in 1969. Through electronic-shop owner Jeffrey Price, son of Boris' cellmate Obadiah Price, who also created the time travel device, J acquires the same time-jump mechanism as Boris. After jumping off the Chrysler Building to reach time travel velocity and being told he has 24 hours to stop Boris, J arrives a day before Boris kills K.\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:2ecb4368764849523ae57d0bd515c0b7647454de","amp;dn":"MEN+IN+BLACK+3+xvid+cam+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ecb4368764849523ae57d0bd515c0b7647454de","infoHashBuffer":{"type":"Buffer","data":[46,203,67,104,118,72,73,82,58,229,125,11,213,21,192,183,100,116,84,222]},"announce":[],"urlList":[]}}