{"title":"Rifles :An Illustrated History of Their Impact {BBS}","uid":6690602,"size":50890458,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ee4a584ca5434ef891f95ea67a2bb8f1dee0b00&amp;dn=Rifles+%3AAn+Illustrated+History+of+Their+Impact+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316563300,"description":"From the musket to the M-16, rifles have played a major role in battle - sometimes tilting the scales in a pivotal moment of war. Yet all too often, poor decisions and ill-conceived &quot;innovations&quot; resulted in putting inappropriate weapons into ill-trained hands, with disastrous consequences. From the earliest muskets to the present-day assault rifles, combat rifles have been developed to offer ever-increasing range, accuracy, effectiveness, and ease of use. But the story of the deployment of the infantry rifle is not one of continuous progress. How is it that the weapons on the front lines have too often been neither what the soldiers wanted nor needed? Ranging primarily from the late 18th century to the present, this richly illustrated volume tells the fascinating, sometimes problematic, history of rifled weapons and ammunition for military use. Battle to battle, readers will see how faster-loading, more accurate rifles changed the battlefield. Readers will also encounter many instances where decision makers chose to issue rifles ill suited for the task at hand when better options were available.\n\nAuthor David Westwood has handled every weapon he describes, from muskets to breech loaders, from repeaters and bolt-action rifles to semi-automatic and self-loaders, His exhaustive research reveals new insights into both the successes and failures of rifled weapons. The result is a fresh look at a common weapon's most uncommon story. \n\n\n\n# Hardcover: 470 pages\n# Publisher: ABC-CLIO Ltd; Ill edition (31 Dec 2004)\n# Language English\n# ISBN-10: 1851094016\n# ISBN-13: 978-1851094011","torrent":{"xt":"urn:btih:2ee4a584ca5434ef891f95ea67a2bb8f1dee0b00","amp;dn":"Rifles+%3AAn+Illustrated+History+of+Their+Impact+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ee4a584ca5434ef891f95ea67a2bb8f1dee0b00","infoHashBuffer":{"type":"Buffer","data":[46,228,165,132,202,84,52,239,137,31,149,234,103,162,187,143,29,238,11,0]},"announce":[],"urlList":[]}}