{"title":"CleanMyMac v1.9.3 (2011) [Multilenguaje]","uid":6598184,"size":6738543,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:2f0ac1cf2d0217a66acef02e9ba6803b3d9f3964&amp;dn=CleanMyMac+v1.9.3+%282011%29+%5BMultilenguaje%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":5,"time":1313100781,"description":"CleanMyMac v1.9.3 (2011) [Multilenguaje]\n &lt;a href=&quot;\nhttp://macpaw.com/pc_cleaner&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://macpaw.com/pc_cleaner&lt;/a&gt;\n\n--------\nEnglish:\n--------\nCategory: MAC Software \nLanguage: Multilingual including Spanish \nMedicine including \n\nDescription: \n------------ \nCleanMyMac is a maintenance tool that lets you clean Mac OS X Elements of the Long That one I slow down or filled with useless Disk File. \nOn one hand, CleanMyMac scans the cache and the records program, and The Other Translations Delete allows you to not need or do not use universal binaries. \n\nWith CleanMyMac will have your Mac as a primer Day. \n\nCatacterÃƒÂ­sticas \n--------------- \nCache Cleaner \nClean the cache of obsolete files and give a zero Programs ITS Some Relief. \n\nCleaning records \nIf free space is exhausted on your Mac? DELETE records with a few steps useless. \n\nUniversal Binary \nEliminate the burden of unused binary code. \n\nGarbage System \nProgrammers and Mac Operating System Files Create Tons of 'disposable'. Take them to the UN blink of an eye. \n\nClean Language \nEliminates languages ??that do not occupy your system. \n\nThash and leftovers \nFind and delete all the garbage from your system. \n\nQuality \nYour satisfaction and performance of your Mac will depend on the quality of our application. \n\nProgram uninstaller \nIt has never been so easy, as convenient or as sure paragraph Completely Remove Programs! \n\nFast Erase \nDelete files and leave no traces. \n\nMonitor status of waste \nGive yourself one less task. Automating the process of emptying the Trash. \n\nCleaning device \nRemovable clean Mantegna ITS Archives annoying. \n\nExtensions Manager \nManage your widgets, plug-ins and preference panes in a single application. \n\nCustomize Appearance \nIf one goes Clear, you may as well look good doing it. \n\nNew version 1.9.3 \n------------------------ \nAdded CleanMyMac Knowledge Base to eliminate all the problems with Adobe, Microsoft and some other software products. \nImproved update manager so you can seamlessly upgrade all ignore lists, knowledge base and software. \nAdded greylisting caches and memory selection to help users with less errors and improve the performance of the application. CleanMyMac intellectually now select only the caches to be removed, but has the ability to remove some larger if necessary. \nNew log window and an innovative &quot;One Click&quot; activation. \nAdded possibility to update Beta for more testing of new releases in the future. \nImproved drag and drop. Now you can place items in some modules CleanMyMac others. \nAdded a list of unknown languages. \nImproved search and display the cache module. \nWidgets Improved uninstaller. \nTroubleshooting! \nFixed a cleaning problem that could result in rupture TimeMachine backups. \nLarge improvement in localization. Germans and French are converted back completely to improve the quality of the location. \nFixed problem with checkboxes plugin in the Extensions Manager area when users could unintentionally select all plugins for disposal. \nEliminates the possibility of eliminating some dialects location when there are no primary language in the list of configuration languages. \nThe same folder can not be taken several times in CleanMyMac by mistake. \nFixed upgrade issues CleanMyMac alert dialog in the preferences. \nFixed all known exceptions, accidents and minor errors. \nGoogle Chrome Fixed cache cleanup problems.\n\n--------\nEspaÃƒÂ±ol:\n--------\nCategoria: Software MAC\nIdioma: Multilenguaje incluido EspaÃƒÂ±ol\nMedicina incluida\n\nDescripcion:\n------------\nCleanMyMac es Una Herramienta de Mantenimiento Con La Que Podras Limpiar Elementos de Mac OS X Que uno la Larga he ralentizan o llenan de El Disco de Ficheros inutiles. \nPor Un Lado, CleanMyMac escanea la cachÃƒÂ© y los Registros de Programas, y Por El Otro te permite Traducciones Borrar Que no necesitÃƒÂ¡s o Binarios Universales Que no utilizas. \n\nCon CleanMyMac tendras tu Mac de como El DÃƒÂ­a de imprimaciÃƒÂ³n. \n\nCatacterÃƒÂ­sticas \n---------------\nLimpieza de cachÃƒÂ© \nLimpia la cachÃƒÂ© de Archivos Obsoletos un cero y dar una Programas SUS Un poco de Alivio. \n\nLos registros de limpieza \nSi Se Agota El Espacio libre en tu Mac? ELIMINAR de registros inutiles Con UNOS Pocos Pasos. \n\nBinarios universales \nELIMINAR la Carga de CÃƒÂ³digo binario no utilizada. \n\nSistema de basura \nSus Programas y El Sistema Operativo Mac Crean Toneladas de Archivos 'desechables'. Eliminalos en la ONU abrir y cerrar de ojos. \n\nIdioma Limpia \nElimina los Lenguajes Que no ocupas en tu Sistema. \n\nThash y las sobras \nEncuentra y eliminaciÃƒÂ³n Toda la basura de tu Sistema. \n\nCalidad \nSu satisfaccion y El Rendimiento de Su Mac dependerÃƒÂ¡ de la Calidad de Nuestra AplicaciÃƒÂ³n. \n\nDesintalador de Programas \nNunca ha Sido Tan Sencillo, Seguro o tan tan conveniente pÃƒÂ¡rrafo ELIMINAR Programas Completamente! \n\nBorrado RÃƒÂ¡pido \nELIMINAR ARCHIVOS y no rastro Dejar. \n\nMonitor de estado de la basura \nDese Una Tarea Menos. Automatizar El Proceso de vaciar la Papelera. \n\nDispositivo de limpieza \nMantegna SUS Dispositivos extraÃƒÂ­bles limpio de los Archivos molestos. \n\nAdministrador de Extensiones \nAdministra tus widgets, plug-ins y los Paneles de Preferencia en Una Sola AplicaciÃƒÂ³n. \n\nPersonaliza la Apariencia \nSi va uno Limpiar, es Posible Que Asi se ven bien haciÃƒÂ©ndolo. \n\nNovedades versiÃƒÂ³n 1.9.3 \n------------------------\nAdded CleanMyMac Knowledge Base para eliminar todos los problemas con Adobe, Microsoft y algunos otros productos de software. \nGerente mejorada de actualizaciÃƒÂ³n para que pueda actualizar sin problemas todas las listas de ignorados, base de conocimientos y de software. \nAdded cachÃƒÂ©s lista gris y la memoria de selecciÃƒÂ³n para ayudar a los usuarios menos errores y mejorar el comportamiento de la aplicaciÃƒÂ³n. CleanMyMac ahora intelectualmente seleccionar sÃƒÂ³lo los cachÃƒÂ©s que hay que eliminar, pero tenga la capacidad de eliminar algunos mÃƒÂ¡s grandes, si es necesario. \nNueva ventana de registro y un innovador sistema &quot;One Click&quot; de activaciÃƒÂ³n. \nAÃƒÂ±adida la posibilidad de actualizaciÃƒÂ³n de Beta para mÃƒÂ¡s pruebas de los nuevos lanzamientos en el futuro. \nMejora de arrastrar y soltar. Ahora usted puede colocar elementos en algunos mÃƒÂ³dulos CleanMyMac otros. \nSe ha aÃƒÂ±adido una lista de ignorados Idiomas. \nMejora de la bÃƒÂºsqueda y la visualizaciÃƒÂ³n en el mÃƒÂ³dulo de cachÃƒÂ©. \nMejora de Widgets de desinstalaciÃƒÂ³n. \nSoluciÃƒÂ³n de errores! \nSe ha corregido un problema de limpieza que podrÃƒÂ­an resultar en la ruptura copias de seguridad de TimeMachine. \nAmplia mejora de la localizaciÃƒÂ³n. Alemanes y franceses se vuelven a convertir por completo para mejorar la calidad de la localizaciÃƒÂ³n. \nSolucionado el problema con el plugin de casillas de verificaciÃƒÂ³n en el ÃƒÂ¡rea Administrador de extensiones cuando los usuarios no intencional podrÃƒÂ­a seleccionar todos los plugins para su eliminaciÃƒÂ³n. \nElimina la posibilidad de eliminar algunos dialectos localizaciÃƒÂ³n cuando no hay presencia de idioma principal en la lista de configuraciÃƒÂ³n de idiomas. \nLa misma carpeta no puede ser llevado en varias ocasiones en CleanMyMac por error. \nFijo CleanMyMac actualizar los temas de diÃƒÂ¡logo de alerta en las preferencias. \nSe corrigieron todos conocidas excepciones, los accidentes y errores menores. \nFijo Google Chrome problemas de limpieza de cachÃƒÂ©.","torrent":{"xt":"urn:btih:2f0ac1cf2d0217a66acef02e9ba6803b3d9f3964","amp;dn":"CleanMyMac+v1.9.3+%282011%29+%5BMultilenguaje%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f0ac1cf2d0217a66acef02e9ba6803b3d9f3964","infoHashBuffer":{"type":"Buffer","data":[47,10,193,207,45,2,23,166,106,206,240,46,155,166,128,59,61,159,57,100]},"announce":[],"urlList":[]}}