{"title":"Coast to Coast AM April 14 2013","uid":8375344,"size":59414670,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2f28e486ce0cfecd3497689eb2e2a6355f2d792b&amp;dn=Coast+to+Coast+AM+April+14+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"runcdfirst","files":5,"time":1366039098,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t04-14-13\nHost: \tIan Punnett\nGuests: \tMary Roach, Charles Pellegrino\n\nJoining Ian Punnett (Twitter), science writer Mary Roach discussed her research into the alimentary canal - the pathway by which food enters the body and solid wastes are expelled. In her new book, Gulp, she explores the digestive system from &quot;nose to tail,&quot;-- the nose, she pointed out is involved in how we taste food in the mouth. What most people don't know is that there is a second set of nostrils in the back of the mouth, and gaseous molecules waft up into the nose from your mouth as you're eating or drinking, she revealed. People's taste for foods can be influenced as early as when they are still in the womb, as different flavors such as from garlic can enter the amniotic fluid, Roach detailed.\n\nRegarding pet food, up until WWII, cats and dogs were fed cans of horse meat. When dried food or kibble was introduced, she discovered that it was partially made with items that animals wouldn't normally eat, so manufacturers spray on additives or coatings that make the food more irresistible to pets. Viscera is typically one of the ingredients, as dogs and cats in the wild typically eat the guts or organ meats of their prey, rather than muscle, she continued.\n\nRoach recounted how in the late 19th century, Horace Fletcher introduced the dietary fad of 'Fletcherizing,'-- excessively chewing one's food, in the belief that you would get more nutrients from it, and need to eat less. Eventually, you would no longer even need to excrete more than a couple &quot;pellets&quot; a week, Fletcher claimed. She also shared the bizarre case of Alexis St. Martin, who in 1822 was accidentally shot in the stomach. Dr. William Beaumont treated the wound, which never completely healed, and formed a fistula. Beaumont discovered he could look inside the wound and see the stomach's digestive processes. He engaged in a set of experiments tying food on a silk string and inserting it into St. Martin's stomach and then pulling it out to observe digestive effects. Beaumont's research culminated in his 1838 tome, Experiments and Observations on the Gastric Juice, and the Physiology of Digestion.\nTitanic Revisited\n\nFirst hour guest, author Charles Pellegrino talked about the Titanic, on the 101st anniversary of its sinking. He shared details about the British steamship, the USS Californian, which had been in the area of Titanic, just before it hit the iceberg, and had tried to send them a warning. Curiously, another ship, the Deutschland, had sent the Titanic a message earlier in the evening that they were in trouble, but the Titanic's captain opted not to stop and help them. Pellegrino also shared updates about his research into Japanese survivors of Hiroshima.\nWebsite(s):\n\n    maryroach.net\n    charlespellegrino.com\n\nBook(s):\n\n    Gulp: Adventures on the Alimentary Canal\n    Stiff: The Curious Lives of Human Cadavers\n    Farewell, Titanic: Her Final Legacy\n    Ghosts of the Titanic\n    The Last Train from Hiroshima\n\n","torrent":{"xt":"urn:btih:2f28e486ce0cfecd3497689eb2e2a6355f2d792b","amp;dn":"Coast+to+Coast+AM+April+14+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f28e486ce0cfecd3497689eb2e2a6355f2d792b","infoHashBuffer":{"type":"Buffer","data":[47,40,228,134,206,12,254,205,52,151,104,158,178,226,166,53,95,45,121,43]},"announce":[],"urlList":[]}}