{"title":"What is it Viagra","uid":5260585,"size":233246,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f6a6793cd8393f830c71b71b91fe4db3ceed409&amp;dn=What+is+it+Viagra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"babalox","files":1,"time":1262716963,"description":"Viagra is a drug that was formulated to aid in the blood flow to the penis to help relieve the stress of erectile dysfunction. When Viagra is taken, it relaxes muscles within the penis, allowing increased blood flow into the penis, which is necessary for the promotion, and maintaining, of an erection. Viagra is mainly prescribed to treat ED (erectile dysfunction), also known as impotence. Viagra may also be utilized for other purposes not listed in this Viagra medication guide. \nWhat do I need to discuss with my doctor before using Viagra?\nDo not take Viagra if you are currently on a nitrate drug for heart problems or chest pains. Nitrates include: \nnitroglycerin (common names Nitrolingual, Nitro-Bid, Nitro-Dur, Nitrostat Minitran, Deponit, Transderm-Nitro, and others), isosorbide mononitrate (common names Monoket, Imdur, ISMO), isosorbide dinitrate (Isordil, Sorbitrate, Dilatrate-SR), and others, as well as nitrates that are found in various recreational drugs such as nitrite or amyl nitrate.\nUsing Viagra in conjunction with any of the above-listed medications may cause a drop in blood pressure, which can result in dizziness, fainting, stroke or a heart attack in extreme cases. ","torrent":{"xt":"urn:btih:2f6a6793cd8393f830c71b71b91fe4db3ceed409","amp;dn":"What+is+it+Viagra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f6a6793cd8393f830c71b71b91fe4db3ceed409","infoHashBuffer":{"type":"Buffer","data":[47,106,103,147,205,131,147,248,48,199,27,113,185,31,228,219,60,238,212,9]},"announce":[],"urlList":[]}}