{"title":"Demetrius And The Gladiators","uid":10400042,"size":1322031953,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2f8abe5ce8bd8b20df3029ab20095261d2870c37&amp;dn=Demetrius+And+The+Gladiators&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"strawberry5","files":-1,"time":1403345587,"description":"Demetrius And The Gladiators\n\n\nIMDB:\nThe film opens with Emperor Caligula (Jay Robinson) calling for his guards to find him the robe to bring him eternal life. Caligula stakes his life on the loyalty of the Praetorian Guards, So if they can keep him alive at all, why not forever?\nPeter (Michael Rennie) gave Demetrius of Corinth (Victor Mature) their master's robe to keep for him. As we all remember, Demetrius took the robe from the foot of the cross before Jesus died.\nBy order of Caligula, 20 pieces of gold were authorized to pay for information concerning the robe that Jesus wore to the cross. Defending Lucia (Debra Paget) from malicious attack of a Praetorian Decurion, Demetrius is caught and sentenced to train as gladiator in the Claudian school.\nBeing fully a Christian entails having a commitment: Demetrius, obviously, is condemned to death because he can't take a man's life. Puzzled by his religion, and fascinated by his magnificent physique, and wanting to find out if Demetrius will kill or not his opponent, Messalina asks to be put in the arena against the king of swordsmen the Nuban Glycon (William Marshall).\nThe dramatic moment of the film comes when Lucia (Debra Paget),Demetrius' sweetheart,sneaks in and is attacked by Dardanius (Richard Egan) and other gladiators... His faith shaken, Demetrius makes several kills, renounces his god, and succumbs to Messalina's charms...\nSusan Hayward looked gorgeous as the wicked Messalina. The part, however, was not developed... It might have been an ideal role for this beloved actress... This was Hayward's second movie with the radiant Debra Paget, who was still considered a promising starlet, but, again, they were never together in a scene...","torrent":{"xt":"urn:btih:2f8abe5ce8bd8b20df3029ab20095261d2870c37","amp;dn":"Demetrius+And+The+Gladiators","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f8abe5ce8bd8b20df3029ab20095261d2870c37","infoHashBuffer":{"type":"Buffer","data":[47,138,190,92,232,189,139,32,223,48,41,171,32,9,82,97,210,135,12,55]},"announce":[],"urlList":[]}}