{"title":"Giordano plays Beethoven (Piano Concerto No 5) - AVI","uid":5161006,"size":686140225,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2f96f16239b8593f5fb8cdf90c9f9c3cccb4d7c1&amp;dn=Giordano+plays+Beethoven+%28Piano+Concerto+No+5%29+-+AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_CMANHG_","files":1,"time":1258144218,"description":"***\n\nShould the seeding rate be too low, just send an e-mail to Mr. Giordano's M'Y'S'P'A'C'E account or Y'O'U'T'U'B'E account.\n\n***\n\nThis is a compressed DVD with Manlio Giordano, the Swedish-Italian concert pianist, performing (live) Beethoven's 5th piano concerto in E flat major (often called the &quot;Emperor&quot; concerto), opus 73, and four encores (Rachmaninoff etudes [op. 33/2; op. 39/9], a Rachmaninoff prelude [op. 32/10] and an improvisation). Conductor: Hans Ek.\n\nCompression has been made to the AVI format. (VLC Media Player is one of many free players that can be used to play the AVI movie files.)\n\n***\n\nThe uncompressed DVD (3.3 GB) is available for download on PiratePay @\n &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3732289&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3732289&lt;/a&gt; \n\t\t\n*** \n\nMore music with and information about Manlio Giordano is available at\n \nM'Y'S'P'A'C'E \n\nand\n\nY'O'U'T'U'B'E\n\n*** \n\nInformation about the torrent:\n\nCopyright-free material.\n\nWinRAR file archive containing compressed video files (AVI format). (Original total size approx. 3.3 GB.) DECOMPRESS with WinRAR or other suitable software.\n\nScreenshots included, as well as promotional photographs (JPEG, low resolution) and quotes from reviews (PDF).\n\n***\n\nKeywords:\n\nManlio Giordano Beethoven The Emperor Concerto Concert Konsert Pianokonsert Music Musik Classical Klassisk Piano Pianist Italy Sweden Kejsarkonserten Hjelm Live Free Fri Improvisation Serge Sergei Sergej Rachmaninov Rachmaninoff Etude Etyd Etudes Etyder Etude-Tableau Etudes-Tableaux Tableau Tableaux Hans Ek Lulea Sverige Sweden Europe European Malmo Malmo Norden Scandinavia Skandinavien opus op 39 33 32 73\t\t\n\n***\n\nSome reviews from the music critics in the newspapers for this concert:\n\n&quot;A tour-de-force of good taste and analytical skill.&quot; (NSD, Sweden, October 29, 2001.)\n\n&quot;...not a single tone is left unattended.&quot; (NSD, Sweden, October 29, 2001.)\n\n&quot;...a performance of international proportions.&quot; (NSD, Sweden, October 29, 2001.)\n\n&quot;...his playing seems devoid of technical difficulty.&quot; (NK, Sweden, October 29, 2001.)\n\n***\n\nFrom e-mail from Mr. Gunnar Ostlund, former president of the orchestra heard in the recording:\n\n&quot;I still [weeks after the concert] find myself in a state of shock, due to the high level of your performance... ...I will of course recommend you anywhere, in writing or otherwise...&quot;\n\n***\n\nSelect feedback for this concert, posted by listeners at Y'O'U'T'U'B'E:\n\n&quot;Very nice sound quality, and a great performance&quot; - &quot;vladimirhorowitz&quot;, 2007\n\n&quot;This is one of my favorite pieces and Giordano plays it like heaven.....you can almost feel like you are there.&quot; - &quot;LauraA9&quot;, 2007\n\n&quot;soaring beauty! your performance is equal, if not better than Vladimir Ashkenazy's performance of it! breath taking!&quot; - &quot;Rinny 17&quot;, 2007\n\n&quot;Only those who can play this know how deep your talent must be...&quot; - &quot;hootersnooter&quot;, December 2008\n\n&quot;Wow! Very impressive. No histrionics, but huge sonorous campanilo sound. Compares very favourably with Horowitz and Kissin.&quot; - &quot;Sagalat&quot;, 2007\n\n&quot;...it would've been great to see you play this. This is the best performance\nof this work I've heard so far... ... I must thank you for making this\npublically available. It is the greatest tribute to Rachmaninoff anyone\ncould every give. Merci.&quot; - &quot;operacommentator&quot;, 2008\n\n&quot;This piece has always been very dear to me, almost as though it contains everything that is good in the world, and you executed it beautifully, I will make sure to let the local promoters know about you.&quot; - &quot;GregoryHRoth&quot;, July 2009\n\n&quot;You know, this is the only piece of classical music that has ever made me\ncry. This may sound cliche, but this music is truly beyond words.\n&quot;Absolute supreme beauty&quot; is the best I can come up with right now. You\nplayed it beautifully.&quot; - &quot;HARMONICO101&quot;, October 2008\n\n&quot;Wonderful.The first classical music to make an impression on me, as a child 50\nyears ago, was the 'Emperor' on scratchy 78s, tragically lost in a\nhouse move a few years later. The pianist was Benno Moisewitsch. In all\nthe performances I have heard since, only yours approaches that magic\ndelicacy. You are your own man &amp; comparisons are pointless, but for\nme, the tempo and touch put you virtually on a par with Moisewitsch,\namong the all-time greats. Will check out your recordings. Thank you.&quot; - &quot;jonno52&quot;, 2007\n\n&quot;My GOD you played this so beautifully. The beginning, so sweet, soft and\nsoothing. The keys are struck to perfection. I feel like I'm in heaven\njust listening to you. (^o^) Not everyone plays the beginning as dolce\nas you did. Thank you, Manlio Giordano, for sharing your brilliance\nwith us. Please let me know where I can purchase your next CD.&quot; - &quot;YGYGYGYGYGYGYGYGYGYG&quot;, 2007\n\n&quot;Sublime playing and performance of one of the most beautiful pieces of music ever written. This, and your video of the second movement, are truly transporting me to places better than earth. Thank you. Bravo! I look forward to hearing more and to hearing you play in person one day.&quot; - &quot;BrinaMarySeattle&quot;, 2009 [This woman also contacted Mr. Giordano via e-mail and revealed that she is a highly trained solo musician - previously employed during several years at one of the great American concert halls, where she also heard many of the great pianists perform.]\n\n&quot;Very well played.&quot; - &quot;amara01addis&quot;, 2007\n\n&quot;just brilliant, a sound reaching every pianist's ears. absolutely love it.&quot; - &quot;Tsukyume&quot;, 2008 \n\n&quot;Scriabin's lost chord - found at last.&quot; - &quot;ShangoSixela&quot;, 2007\n\n&quot;Dear Mr. Giordano, Greetings from Seattle, Washington USA. I want? to tell you how much I have enjoyed this performance of the Rachmaninoff etude. After such a performance, only one word springs to mind: BRAVO! This piece is a particular favorite of mine, and in my opinion, yours is the best video of it onI have already shared it with a number of my friends, and will be sharing it with more through Facebook. You must come visit us in the USA soon!&quot; - &quot;wildknight1103&quot;, July 2009 \n\n&quot;Wow! This is an amazing performance!&quot; - &quot;FFRPianist&quot;, 2008\n\n&quot;Very well performed...&quot; - &quot;jbdoggy&quot;, 2008\n\n&quot;ABSOLUTELY WONDERFUL, MUSICAL PERFORMANCE OF INSANELY DIFFICULT WORK Your middle\npassage was not rushed, but played lyrically and thoughtfully. You\nnever used too much pedal and you never &quot;pounded&quot; the pedal points.\nGad, I wish I could play half as well as you do... Rachmaninoff would have clapped his hands in delight!&quot; - &quot;sanjosemike&quot;, December 2008\n\n&quot;Wow. THIS IS VERY NICE!!! Bravissimo!!&quot; - &quot;LiradeTerpsichore&quot;, 2008\n\n&quot;Thank you very much for posting this! I am teaching myself this prelude at\nthe moment, it's quite tricky in places and it's useful to hear it\nperformed so well.&quot; - &quot;lecheminduchagrin&quot;, 2007\n\n&quot;tres bon son, et magnifique interpretation ;)&quot; - &quot;shannara65&quot;, 2008\n\n&quot;BRAVO!!!! Very very well played&quot; - &quot;sickasfook&quot;, 2008","torrent":{"xt":"urn:btih:2f96f16239b8593f5fb8cdf90c9f9c3cccb4d7c1","amp;dn":"Giordano+plays+Beethoven+%28Piano+Concerto+No+5%29+-+AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f96f16239b8593f5fb8cdf90c9f9c3cccb4d7c1","infoHashBuffer":{"type":"Buffer","data":[47,150,241,98,57,184,89,63,95,184,205,249,12,159,156,60,204,180,215,193]},"announce":[],"urlList":[]}}