{"title":"Pride and Prejudice by Jane Austen - Transformer.epub","uid":8542504,"size":285837,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30331c87361dbdae97a519feeedb33e41f7df96d&amp;dn=Pride+and+Prejudice+by+Jane+Austen+-+Transformer.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kPulsate","files":1,"time":1370392525,"description":"\nPride and Prejudice is a novel by Jane Austen, first published in 1813. The story follows the main character Elizabeth Bennet as she deals with issues of manners, upbringing, morality, education, and marriage in the society of the landed gentry of early 19th-century England. Elizabeth is the second of five daughters of a country gentleman living near the fictional town of Meryton in Hertfordshire, near London.\nThough the story is set at the turn of the 19th century, it retains a fascination for modern readers, continuing near the top of lists of &quot;most loved books&quot; such as The Big Read. It has become one of the most popular novels in English literature and receives considerable attention from literary scholars. Modern interest in the book has resulted in a number of dramatic adaptations and an abundance of novels and stories imitating Austen's memorable characters or themes. To date, the book has sold some 20 million copies worldwide.\nAs Anna Quindlen wrote, &quot;Pride and Prejudice is also about that thing that all great novels consider, the search for self. And it is the first great novel to teach us that that search is as surely undertaken in the drawing room making small talk as in the pursuit of a great white whale or the public punishment of adultery.&quot;","torrent":{"xt":"urn:btih:30331c87361dbdae97a519feeedb33e41f7df96d","amp;dn":"Pride+and+Prejudice+by+Jane+Austen+-+Transformer.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30331c87361dbdae97a519feeedb33e41f7df96d","infoHashBuffer":{"type":"Buffer","data":[48,51,28,135,54,29,189,174,151,165,25,254,238,219,51,228,31,125,249,109]},"announce":[],"urlList":[]}}