{"title":"Jane's Addiction - Jane Says  (2nafish)","uid":5624363,"size":180217860,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:30347227f52c6db76604f7343e6653311b1b62dd&amp;dn=Jane%5C%27s+Addiction+-+Jane+Says++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1276419799,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Jane Says&quot; is a song by alternative rock group Jane's Addiction. It was first released in live format on the group's 1987 live debut album, Jane's Addiction. It was re-recorded in the studio for their first studio album, Nothing's Shocking. Another live version appears on the band's 1997 rarities compilation Kettle Whistle.\n\nThe title refers to lead singer Perry Farrell's ex-housemate, Jane Bainter, who was a heroin addict. By day, she works in an office, and, at night, she uses. The song carries drug references such as &quot;kick&quot; (stop using). Toward the end of the song, the lyrics say that Jane has never been in love, and that she doesn't know what it is. She only knows if someone wants her; the stanza ends with &quot;I want them if they want me&quot;. The fourth verse contains a reference to St. Andrews St. in Los Angeles, CA.\n\n&quot;Jane Says&quot; uses only two chords and makes extensive use of steel drums. It is one of Jane's Addiction's most famous songs and frequently ends their concerts, despite never being released as a single.\n\nJane's Addiction is the live 1987 debut album  by Jane's Addiction. The audience track is from a Los Lobos concert. The recording contains many studio overdubs and was released in 1987. The tracks &quot;Jane Says&quot; and &quot;Pigs in Zen&quot; were both later released on the band's first studio album, Nothing's Shocking, as studio versions.\n\nThe album included two covers: &quot;Rock &amp; Roll&quot; by The Velvet Underground, and &quot;Sympathy for the Devil&quot; by The Rolling Stones, although the latter was titled &quot;Sympathy&quot; on the album.\n\n&quot;Whores&quot; and &quot;Chip Away&quot; were recently re-recorded by the reunited Jane's Addiction and Nine Inch Nails front man, Trent Reznor.\n\nNothing's Shocking is the debut studio album by the American alternative rock band Jane's Addiction, released on August 23, 1988 through Warner Bros. Records. The album showcases the band's funk-oriented musical style through Dave Navarro's heavy guitar riffs and the distinctive singing style of vocalist Perry Farrell. Nothing's Shocking was well received by critics upon release and is often cited as the band's best album. Despite this, it peaked at number 103 on the Billboard  200 and produced only one noteworthy single, &quot;Jane Says&quot;, which reached number six on the Billboard Modern Rock Tracks in 1988. The album was ranked #309 on Rolling Stones' &quot;500 Greatest Albums of All-Time.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:30347227f52c6db76604f7343e6653311b1b62dd","amp;dn":"Jane%5C%27s+Addiction+-+Jane+Says++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30347227f52c6db76604f7343e6653311b1b62dd","infoHashBuffer":{"type":"Buffer","data":[48,52,114,39,245,44,109,183,102,4,247,52,62,102,83,49,27,27,98,221]},"announce":[],"urlList":[]}}