{"title":"Red Rider - Lunatic Fringe [promo].VOB","uid":9423916,"size":161777664,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:30bf620e95999d86e7e8c594041889293ee37cea&amp;dn=Red+Rider+-+Lunatic+Fringe+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1388647559,"description":"Red Rider - Lunatic Fringe [promo].VOB\n\n\nHQ very rare promo music video from a promo DVD with 2 and 6 channel AC3 audio. &quot;Lunatic Fringe&quot; is a song by the Canadian rock band Red Rider from their 1981 album, As Far as Siam. Guitarist Tom Cochrane wrote the song after becoming concerned about a resurgence of anti-Semitism in the 1970s, and was also inspired after reading a book about Raoul Wallenberg, who rescued Jews from The Holocaust during World War II. Some sources have incorrectly cited the murder of John Lennon as the song's primary inspiration; in fact, Cochrane had already written the song before Lennon was killed, but recorded the song's first demo the evening of the murder. He has stated that his feelings about the event, and how it echoed the theme of his song, galvanized him to release the song as a single despite advice from the record label that the song wasn't commercial enough.\n\nThe song starts with a sinister, low keyboard tone, punctuated by a &quot;double tap&quot; of two medium-pitched short notes. The song then progresses with its main theme, ending dramatically with ambulance sirens and final guitar riffs. Throughout the body of the song is a low, powerful bassline.\n\nThe song is a radio favorite, and has received regular airplay in the United States and Canada. It reached #11 on the Rock Radio Airplay Chart in Billboard in September 1981, and was awarded a SOCAN Classic award in 2009 by the Society of Composers, Authors and Music Publishers of Canada for reaching the 100,000-airplay mark on (Canadian) domestic radio.\n\nRed Rider are a Canadian rock band popular in the 1980s. While the band achieved great success in Canada, the band never had a song in the Top 40 in the US, even though &quot;Lunatic Fringe&quot; became a hit on AOR radio.\n\nIn 1978, Tom Cochrane joined up with Rob Baker on drums, Jeff Jones on bass, Peter Boynton on keyboards and Ken Greer to form Red Rider. They were signed to Capitol Records and released their first album Don't Fight It in 1980. With the singles &quot;White Hot&quot; and &quot;Don't Fight It&quot;, the album quickly reached gold status. Their second album As Far as Siam was released in 1981 and featured the hit &quot;Lunatic Fringe&quot; which was used in the 1985 movie Vision Quest and which is now a mainstay on American classic rock radio. The song also saw high rotation on the United States cable network MTV.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Lunatic_Fringe_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Lunatic_Fringe_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/faFkpaafL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/faFkpaafL&lt;/a&gt;\n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 6000kbps\n   Audio: Dolby Digital AC3 48000Hz 2ch 192kbps\n   Audio: Dolby Digital AC3 48000Hz 6ch 448kbps\n   Duration: 00:04:21\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.1\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:30bf620e95999d86e7e8c594041889293ee37cea","amp;dn":"Red+Rider+-+Lunatic+Fringe+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30bf620e95999d86e7e8c594041889293ee37cea","infoHashBuffer":{"type":"Buffer","data":[48,191,98,14,149,153,157,134,231,232,197,148,4,24,137,41,62,227,124,234]},"announce":[],"urlList":[]}}