{"title":"Creation Seminar - Kent Hovind DivX","uid":3494191,"size":5913224616,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:31217c494b80bedfcdfb1d7ccebf966e8aba759e&amp;dn=Creation+Seminar+-+Kent+Hovind+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bucky katt","files":7,"time":1149929871,"description":"Creation Seminar - Kent Hovind - DivX\n\nRuntime: 17 hrs.\n\nAudio: English\nSubs : None\n\nDr. Hovind&amp;#039;s Creation Seminar Series is his most popular set of videos. God has used the message it presents to bring thousands of people closer to Him.\n\nIn This 17-hour series:\n\nPart 1, The Age of the Earth\n\nGiving scientific evidence to prove a literal six-day creation, Dr. Kent Hovind refutes evolution&amp;#039;s proposition that the earth has evolved over billions of years. The first of seven in the seminar series, The Age of the Earth, uncovers the follies of the Big Bang theory as well as exposing the religious beliefs of evolution. 126 minutes.\n\nPart 2, The Garden of Eden\n\nThe Garden of Eden, part two of the seminar series, describes the earth as it was before the worldwide flood. Dr. Hovind explains in detail how it was possible for man to live over 900 years, for plants and animals to grow much larger than today, and for dinosaurs to thrive along with man. 137 minutes.\n\nPart 3, Dinosaurs and the Bible\n\nFor many years, some thought the existence of dinosaurs discredited the Biblical account of creation. In part three of the seminar series, Dinosaurs and the Bible, Dr. Hovind traces the Biblical and historical references to dinosaurs and interviews people who claim they have seen living dinosaurs. 157 minutes.\n\n\nPart 4, Lies in the Textbooks\n\nIn part four of the seminar series, Dr. Hovind shows how public school textbooks are permeated with fraudulent information in order to convince students that evolution is true. Lies in the Textbooks is a must-see for every public school student, teacher, parent and school board member. 175 minutes.\n\n\nPart 5, The Dangers of Evolution\n\nIn The Dangers of Evolution, Dr. Hovind reveals the terrible effects that evolutionary beliefs have had on societies throughout history. Giving examples of evolution-based philosophies being used to rationalize the brutal acts of rulers, he exposes evolutionary propaganda in its effort toward the &quot;New World Order.&quot; 152 minutes.\n\nPart 6, The Hovind Theory\n\nThe Hovind Theory blends scientific observations with Scripture in a fascinating explanation of what caused Noah&amp;#039;s Flood, the Ice Age, the formation of coal, mountain ranges, and the Grand Canyon. Dr. Hovind gives logical answers to the physical anomalies that geologists cannot explain with the evolutionary theory. 104 minutes.\n\nPart 7, Question and Answer Session\n\nThe last in the seminar series, Questions and Answers, covers a variety of topics including radiometric dating and the speed of light in relation to star distance. In addition to &quot;primitive man&quot; and race origins, Dr. Hovind discusses the mark of the beast and supposed contradiction&amp;#039;s in the Bible. 180 minutes.\n\nCTCA","torrent":{"xt":"urn:btih:31217c494b80bedfcdfb1d7ccebf966e8aba759e","amp;dn":"Creation+Seminar+-+Kent+Hovind+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31217c494b80bedfcdfb1d7ccebf966e8aba759e","infoHashBuffer":{"type":"Buffer","data":[49,33,124,73,75,128,190,223,205,251,29,124,206,191,150,110,138,186,117,158]},"announce":[],"urlList":[]}}