{"title":"Good evening Mr. Wallenberg (1990) (Sweden) (moviesbyrizzo)","uid":7044909,"size":838525022,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:314fd5c9fb2297f75cf6de488039ece391c5b3cc&amp;dn=Good+evening+Mr.+Wallenberg+%281990%29+%28Sweden%29+%28moviesbyrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1329708293,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0099673&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0099673&lt;/a&gt;\n\n\nTo be involved in atrocities is a dehumanizing process for all mankind. \nThe punishment of anyone should always fit his srime and no child should\nbe asked to open a door to check as to whether it is booby trapped as a\nshow of &quot;superior genes&quot; as they do not have any prima facie validity at\nexactly such a moment. It has an effect on the mind which is to cause insanity\ntowards ALL children and if you cannot understand that, you aren't playing with a &quot;full deck&quot;.\n\nMuch to learn from the lessons of wwii - most particularly - how to pick what is\ngood and bad in both barrels of apples that were involved (on both sides that is)\nas no nation has perfect peoples in all of their citizens, and to pick one group\nwhen there is just as much of an argument that it is statistically just as\nreasonable on grades of willingness to show humanity as the larger group is\nin fact an act of sheer stupidity and barbaric madness that is still destroying\nus today hat want to put the past behind us in a way that will allow for the best \nspirit to survive and to reign once more free of guilt from all this - as the\nbest people could never have been guilty in their hearts of anything evil - if \nthey just look at it straight enough to bring perspective to bear. Not everyone\nwas Hitler and ultimately he was the bastard that all need to bury forever - \nas the villain to all he pretended to be fair to, or openly victimized as he did.\n\nMay god restore the Christian Irish spirit to its rightful place as what will now define Germany Sweden Italy and elsewhere as the best way forward - leaving all\nother ideas of &quot;supremacist&quot; in the trash where they belong.\n\nAmen\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n\n\n720 x 480 DivX video from old dvd video 811k bitrate 128k audio\nusing divx author 1.5.2\n\n\n\n","torrent":{"xt":"urn:btih:314fd5c9fb2297f75cf6de488039ece391c5b3cc","amp;dn":"Good+evening+Mr.+Wallenberg+%281990%29+%28Sweden%29+%28moviesbyrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"314fd5c9fb2297f75cf6de488039ece391c5b3cc","infoHashBuffer":{"type":"Buffer","data":[49,79,213,201,251,34,151,247,92,246,222,72,128,57,236,227,145,197,179,204]},"announce":[],"urlList":[]}}