{"title":"JH 1970-05-30 Berkeley","uid":9378343,"size":483062453,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:31513746708081aff1e04dc1e1a266e961e22149&amp;dn=JH+1970-05-30+Berkeley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ghostdogz","files":13,"time":1387664405,"description":"Venue: Berkeley Community Centre\nDate: May 30th 1970 (Early show)\nTitle: Live At Berkeley\nLabel: Rock Of Ages\nMatrix: ROA 1006\n\nPersonnel:\nJimi Hendrix: Guitar/Vocals\nBilly Cox: Bass\nMitch Mitchell: Drums\n\nSetlist:\n1. Fire\n2. Johnny B. Goode\n3. Hear My Train A'comin'\n4. Foxy Lady\n5. Machine Gun\n6. Freedom\n7. Red House\n8. Message to Love\n9. Ezy Rider\n10. Voodoo Chile (Slight Return) \n\nReview of 2005 release on Radioactive label courtesy of http://hendrix.guide.pagesperso-orange.fr/hendrix2.htm\n\nWhen MCA put out the 2nd set at Berkeley in 2003, it left us asking &quot;what about the 1st set ?&quot; It didn't happen, so Radioactive adopted a bold stance with this release. These recordings have been circulating among traders for some time with top soundboard quality and that is the case here. This is the same mix as the three track CD that was free with the old videocassette &quot;Jimi Plays Berkeley&quot;.\nJimi came out that evening looking tough in leather pants and a multicoloured waistcoat to delivered a great set apart from the usual little difficulties with the newer songs. &quot;Freedom&quot; isn't too bad but seems to suffer from tuning problems and drags in parts as Jimi tries to put across what he was busy putting together in the studio. &quot;Message To Love&quot; gets off to a shakey start but soon pulls together well. &quot;Ezy Ryder&quot; suffers a little from a couple of moments of uncertainty, but it's great to hear it live. Mitch puts in a little drum solo on that one.\nOn the opening &quot;Fire&quot;, we hear Billy Cox sing what used to be Noel's backing vocals. He also tends to overplay his bass lines a little but it comes over well, as does that other Experience showstopper &quot;Foxy Lady&quot;.\nThere are of course the terrific and now legendary versions of &quot;Johnny B. Goode&quot; and &quot;Hear My Train a Comin&quot;. Jimi's playing is perhaps his best ever here and this is I feel the best sounding recording there is of him in action. A special effort had been made for the recording, destined for an eventual live album. The two sets were filmed of course and the footage eventually became &quot;Jimi Plays Berkeley&quot;.\nThe set also features excellent performances of &quot;Voodoo Child&quot;, &quot;Machine Gun&quot; and &quot;Red House&quot; (&quot;that we've been playing for about 99 000 years&quot; says Jimi).\nTo make this a single CD release, the superb &quot;Star Spangled Banner&quot;/&quot;Purple Haze&quot; has been left off (if the details I have here are correct). Whatever, this is a great release and it captures Jimi at his best on the last American tour.","torrent":{"xt":"urn:btih:31513746708081aff1e04dc1e1a266e961e22149","amp;dn":"JH+1970-05-30+Berkeley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31513746708081aff1e04dc1e1a266e961e22149","infoHashBuffer":{"type":"Buffer","data":[49,81,55,70,112,128,129,175,241,224,77,193,225,162,102,233,97,226,33,73]},"announce":[],"urlList":[]}}