{"title":"Dead Ringer the RARE Meat Loaf movie DVD","uid":6321704,"size":4624433631,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3164bf46a21aedfdd2d6eaea92c95bc8e3ba611a&amp;dn=Dead+Ringer+the+RARE+Meat+Loaf+movie+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ChiefInsp","files":14,"time":1302914824,"description":"I fixed the sync issues and created a dvd with chapters etc. Also created some artwork for this rare treasure\n\nMeat Loaf's first album, ''Bat Out of Hell,'' was a mega-success, selling more than 11 million copies. This large, talented, sweaty singer hit the scene like a tank out of hell and the fans loved him. Now, several years later and about to go on the road again to promote his new album, Meat Loaf starts to feel the stress of success. His production office looks like a war zone and none of his ''people'' are listening to him. His two agents are either on the phone or playing Space Invaders (remember that?) while pretending to be taking meetings. Meanwhile, his manager keeps booking Meat Loaf for interview after interview, slowly driving the singer insane. The highlight of the film, in fact, is MacIntyre Dixon, who plays Ernie Weaver, a slightly vacuous, enormously patient New York interviewer trying to discover the true ingredients of this Meat Loaf, and believing every false word his subject tells him.\n\nElsewhere, seemingly in some perpendicular universe, are Russell (Josh Mostel) and his nerdy brother, Marvin (Meat Loaf), who not surprisingly bears an uncanny resemblance to his idol, Meat Loaf. It seems that Marvin never talks, but he can belt out a Meat Loaf tune as well as the original. When they learn that the great one is going on tour, they make it their lives' mission to find and maybe, hope against hope, even meet Meat.\n","torrent":{"xt":"urn:btih:3164bf46a21aedfdd2d6eaea92c95bc8e3ba611a","amp;dn":"Dead+Ringer+the+RARE+Meat+Loaf+movie+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3164bf46a21aedfdd2d6eaea92c95bc8e3ba611a","infoHashBuffer":{"type":"Buffer","data":[49,100,191,70,162,26,237,253,210,214,234,234,146,201,91,200,227,186,97,26]},"announce":[],"urlList":[]}}