{"title":"Grosse-Antimachiavell(critical essay on machiavellian Prince)(19","uid":4733482,"size":623790,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31bed973ed51de0e9b9a5f3735f45291cb4e4613&amp;dn=Grosse-Antimachiavell%28critical+essay+on+machiavellian+Prince%29%2819&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"red_gonzo","files":1,"time":1235157143,"description":"For english-only speaking:\nThis booklet is in german language. English title would be: The Antimachiavelli (1900). Prussian king Friedrich II. (also known as Friedrich der GroÃƒÅ¸e) attempted to dissect the text of Niccolo Machiavelli's political tract called The Prince. The result was a fundamentally critical essay that demolished the horrible political methods that have since then been called machiavellian. The author conceptually changes the reason d'etre for state from brutal and cold machine dedicated to elevate only the power elite to being a more humane organism. One can easily see outright revolutionary ideas burried deep in this highly philosophical discussion that among others deal with establishing a system of religious tolerance and defines the king as a servant of the state and not a tyrannt over the population. Although written hundreds of years ago, the ideas presented are more than interesting today as we are confronted by politicians that use machiavellian methods all the time without any regard for humanity. 40 pages.\n\nFur Deutschsprachige:\nIn seinem frÃƒÂ¼hen Werk unternimmt preuÃƒÅ¸ischer Konig Friedrich II. (auch Friedrich der GroÃƒÅ¸e bekannt), in der Geisteshaltung eines glÃƒÂ¼henden AnhÃƒÂ¤ngers der AufklÃƒÂ¤rung, den Versuch den FÃƒÂ¼rsten von Niccolo Machiavelli fundamental zu kritisieren und zu widerlegen. Konzeptionell unternimmt Friedrich II. in jedem der 26 Kapitel den Versuch der rohen StaatsrÃƒÂ¤son, die Machiavelli in seinem Werk erlÃƒÂ¤utert das Ziel und MaÃƒÅ¸ der allgemeinen und menschlichen Vernunft zu geben. Dieses Werk scheitert an methodischen und sprachlichen Problemen sowie seinen eigenen AnsprÃƒÂ¼chen. Den Grundgedanken der Schrift, die moralischen Forderungen der AufklÃƒÂ¤rung auf das ganze Staatswesen zu ÃƒÂ¼bertragen erreicht der Antimachiavell nicht. Der Antimachiavell ist als frÃƒÂ¼hes Werk des jungen, von der AufklÃƒÂ¤rung geprÃƒÂ¤gten Friedrich II. zu betrachten, welches seine politischen Ansichten vor der Thronbesteigung dokumentiert. Eine totgeschwiegene, staatsphilosophische Schrift, die den revolutionÃƒÂ¤ren Kern des PreuÃƒÅ¸entums unter Friedrich dem GroÃƒÅ¸en sichtbar werden lÃƒÂ¤ÃƒÅ¸t und deren Erkenntnisse und GrundsÃƒÂ¤tze auch heute noch aktuell sind. 40 Seiten.\n","torrent":{"xt":"urn:btih:31bed973ed51de0e9b9a5f3735f45291cb4e4613","amp;dn":"Grosse-Antimachiavell%28critical+essay+on+machiavellian+Prince%29%2819","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31bed973ed51de0e9b9a5f3735f45291cb4e4613","infoHashBuffer":{"type":"Buffer","data":[49,190,217,115,237,81,222,14,155,154,95,55,53,244,82,145,203,78,70,19]},"announce":[],"urlList":[]}}