{"title":"108 Windows 7 Dark Themes to Die For!","uid":6072363,"size":1932181250,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:31d618ca7406ba2206d39f25664d4d02015c81ee&amp;dn=108+Windows+7+Dark+Themes+to+Die+For%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dielaughing","files":227,"time":1293679809,"description":"Anyone who loves their Windows 7x64 is REALLY gonna love their Windows7x64 when they get a hold of these!!!! I got them all from http://virtualcustoms.net and have included (or tried to include) either a jpg or a png for each of the themes so it's easier to choose one.. I just am happy as ever with the way my setup looks now, and the next day, and then next theme.. whatever my mood.. it's easy to install them.. the exe's are obviously just double click and viola! But before you even do anything you'll need to use the UniversalThemePatcher (which is included) it'll prompt you to patch 3 things that are a prerequisite for using any of these themes. Then, if you choose a theme that is not a exe, you'll have to take the contents of the RaR and place them inside this folder: WINDOWS\\Resources\\Themes .. and thats it. Once you've done that the theme you've chosen will show up in the 'Personalization' portion of windows, which is just a right click on the desktop.. A hundred and eight of them.. it took me a good deal of time to download them all (leaving out the ones I thought just too lame) from all of the various upload sites, such as(and that one was the worst! Making me wait, while I just ran through downloading all of the others). You're supposed to create an account on the VirtualCustoms site in order to have access to any of this.. and even then I found it difficult to locate them for downloading.. but alas, I found them all and bring them to you. A Great Big Thanks goes out to the creators, who are as follows: \nMr GRiM's Windows 7 Themes\nRazorsedge Windows 7 Themes\nsergiogarcia9 Windows 7 Themes\nLefty's Windows 7 themes\nnofx1994 Windows 7 Themes\nX-ile Windows 7 Themes\nPauliewog's Windows 7 Themes\nbigcyco1 Windows 7 Themes\nDevilsBrandÃ‚Â® Windows 7 Themes\nbbosa's Windows 7 Themes","torrent":{"xt":"urn:btih:31d618ca7406ba2206d39f25664d4d02015c81ee","amp;dn":"108+Windows+7+Dark+Themes+to+Die+For%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31d618ca7406ba2206d39f25664d4d02015c81ee","infoHashBuffer":{"type":"Buffer","data":[49,214,24,202,116,6,186,34,6,211,159,37,102,77,77,2,1,92,129,238]},"announce":[],"urlList":[]}}