{"title":"Led Zeppelin 1971.08.07 - Montreux","uid":4181806,"size":691122757,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:320c7ee03d24f947f0f2dbd7a674166a1ffcf297&amp;dn=Led+Zeppelin+1971.08.07+-+Montreux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TimD54","files":15,"time":1210443815,"description":"Remember a few months ago when we had the brief discussion of &quot;Smoke On\nThe Water,&quot; about how Deep Purple were recording in Montreux when an\nidiot fan with a flare gun fired a flare into the acoustic-cloth ceiling\nof the Montreux Casino Theater, and burned it down during a Frank Zappa\nshow...  And of course that brought up the classic show that Led\nZeppelin played on August 8, 1971, just before the Zappa show in\nquestion.  And that brings up the story of Peter Grant&amp;#039;s generosity, of\nhow he saw hundreds of fans unable to get tickets just camped out on the\nlawn in front of the venue to listen to what they could hear from\nthere.  Peter magnanimously had PA speakers set up outside and broadcast\nthe concert onto the lawn for the fans who rallied to support his band.\nSee, Peter LOVED fans, it&amp;#039;s true!  And the recording of the show was\nalright, taken from a source that was taped in front of these PA\nspeakers, and you could hear the sound get better when the doors opened\nfrom time to time.\n\nMany reviews of this show lament that there is no higher-quality source\nfor such an awesome show - Led Zeppelin is at full throttle, tearing\nthrough maybe the first live Celebration Day, and a rare teaser of\nRamble On.  Well, someone else was taping that night, according to my\nsource.  Inside the arena.  And, brothers and sisters, with a little\nhelping hand from TimD, you can hear it pretty much the way it was heard\non the night.  In fact, unless I&amp;#039;m a total fool (possible,) I think the\ntape authenticates itself - it contains one of the most bizarre oddities\nI&amp;#039;ve ever heard on a bootleg.  I thought I couldn&amp;#039;t possibly be hearing\nit, but I&amp;#039;m sure of it and I&amp;#039;ll explain why.  This recording exhibits\nforward echo.  More specifically, I&amp;#039;m positive that the recording was\nmade from inside the building, because deep in the background, when you\nturn the remastered version way up high, *you can hear Peter&amp;#039;s PA\nspeakers outside* on almost a full second delay, one would assume both\nfrom the extreme length of the cables for the speakers, and the time it\ntakes sound to travel back into the hall.  At first I thought it was an\nodd remastering thing, like I had some sort of reverberation or\nharmonics or ghost-images on the tape - anything but that.  But it&amp;#039;s the\nonly thing that makes sense.  You can only hear it in soft passages,\nmostly of Robert singing - the band or the crowd drowns it out most of\nthe time.  If it were a reverb or harmonic the whole band would\npresumably be doing it, making the recording a bloody mess.  Plus, it\ndoes it with all the effects turned off.  So it&amp;#039;s real.  This is an\ninside tape.\n\nAnd what a tape.  The band launches to a hot Immigrant Song, just like\nthe album, and then straight into Heartbreaker.  The band is absolutely\nincredible this night.  Robert has had a few weeks off and sounds like\nthe Golden God - one truly spectacular performance for Percy as he hits\nevery high note and roars like the banshee of 1968.  You have got to\nhear this Heartbreaker solo.  Jimmy absolutely destroys it, pulling off\na note-perfect hammer-on pull-off display with ease, and the band\nabsolutely stings it coming back in at &quot;Worked so hard to turn it\naround, get some money saved,&quot; one of the most consistently powerful\nZeppelin moments over the years.  A brief hello from Robert to Montreaux\nand Claude Nobs precedes a bleeding-hot &quot;Since I&amp;#039;ve Been Lovin&amp;#039; You&quot;\nwith somewhat screechy keyboards but Bonham laying it down in classic\nfashion - it seems almost odd to say we take this for granted, but I\nguess it&amp;#039;s hard to find ways to praise John Bonham that aren&amp;#039;t\nrepetitive - but I&amp;#039;ll say it here again, loud as I can - John Bonham is\nthe engine that makes Led Zeppelin go.  Jason, great as he is and as\nmuch as we all believe in him...  his old man just had it, whatever *it*\nis for drummers.  Jason has it, just not as much of it.  Know what I\nmean?  And this is the comparison that he&amp;#039;s handled with grace for all\nthese years.  Back to business. The old man is absolutely killing it on\nSIBLY, stomping his way through, his bass pedal at the end sounding like\na heartbroken Robert beating on the door of his own house at midnight,\nand Robert wails his way through the end of the song.\n\nAgain, Robert really is bringing it tonight and Jimmy is\nfeeding off him this time, giving Robert room to\nimprovise and make up lyrics, extending &quot;Black Dog,&quot; which might be the\nbest recorded version I&amp;#039;ve ever heard.  I&amp;#039;m not sure why, but Jimmy&amp;#039;s\ntone is better on Black Dog than I&amp;#039;ve ever heard it during the signature\nriff - maybe it&amp;#039;s because Jonesy is behind him, *deep*, on every single\nnote.  It just plain sounds better, harder, with more roar than maybe\neven the studio track, and certainly any other live version, on a song\nthat in my opinion often didn&amp;#039;t sound very good live.  I wonder why they\nchanged it.  Huge roar from the crowd for a song they&amp;#039;ve never heard before.\n\nWith no further ado, the mighty Zeppelin slams into &quot;Dazed and\nConfused,&quot; Jonesy booming through the theater and the countryside\noutside and Bonham...  well, he did always enjoy Montreaux.  The band\nreally really spanks the ending, and Robert gives Jimmy his due to the\nroar of the crowd...  and then it&amp;#039;s quiet.\n\nAn odd, warbly tease of what&amp;#039;s to come from Jimmy and no applause from\nthe silent crowd for the introduction of &quot;Stairway to Heaven,&quot; which\nmeans to me that they hadn&amp;#039;t heard the fourth album yet.  Of course not\n- the album doesn&amp;#039;t come out until November.  So not only a scorching\nHeartbreaker and maybe a best-ever Black Dog, you get a\npre-album-release Stairway.  This is starting to shape up as a pretty\ngood show.  Jimmy makes mistakes playing around with the intro, and I\ndon&amp;#039;t think the lyrics are completely set yet, Robert changing small\nwords here and there.  It comes together nicely very early though, and\nthrough the first movement is turning out very nice.  Robert, my\ngoodness, is singing he still loves the song, even though he blows the\n&quot;bustle in your hedgerow&quot; line, the crowd is starting to roar underneath\nthe band as they realize what they&amp;#039;re hearing.  Smooth transition and\nBonzo handles the move into the hard section smoothly and appears to be\nplaying his ass off - the tape suffers here from some reason and then\ncomes back, like someone&amp;#039;s muffling the microphone, and damn! there&amp;#039;s a\nsloppy finger-on-the-reel Millard Marking in the middle of Jimmy&amp;#039;s\nextremely hot solo.  The song ends majestically to a roar from an\nappreciative crowd.\n\nA cut in the tape gets us to Going To California, which Robert\nintroduces &quot;for better or worse&quot; - I think he feels like the new\nmaterial is going a little rough after the mistakes at the beginning of\nStairway.  But GTC is gorgeous as always, and the tape is back close to\nthat original quality as Robert&amp;#039;s voice soars and Jimmy&amp;#039;s acoustic rings\nthrough the hall.  Not the cleanest time Jimmy&amp;#039;s ever played it, and\nRobert&amp;#039;s late in at least once.\n\nWanna take the time to mention that this engineering job is going to\nsound best turned up LOUD.  I just couldn&amp;#039;t help it - I had this fucker\ncranked to eleven the entire time I was working the show.  My God, what\na show.  Anyway...\n\nThere&amp;#039;s an ugly blank spot on the tape before That&amp;#039;s The Way with some\nmic banging - I&amp;#039;ve edited it out and the tape sounds gapless now.  I\ndidn&amp;#039;t see the need to leave in a bunch of boomy banging noises with\nnothing going on behind them, so I took them out.  No motive here, I&amp;#039;m\nnot marking the show or anything.  &lt;lol&gt;  Shades of The Battle of\nEvermore in Jimmy&amp;#039;s playing during the middle part of the song.  And\nI&amp;#039;ll be damned if I don&amp;#039;t hear chunks of Swan Song at the end, not to\nmention an extremely famous Everly Brothers lick.\n\nAfter the song Robert says something in French, and then something that\nsounds like &quot;Give me the microphone&quot; and then announces that someone is\nmaking a bootleg album this afternoon - makes a comment about someone\nthinking they&amp;#039;re not capitalists.\n\nOf course, Celebration Day and What Is And What Should Never Be\nelectrify the crowd.  A note about the remaster here - another masterer\nleft notes on a very good job he did that stated he speed-corrected the\nportion of the show between Going To California and Whole Lotta Love.  I\nlistened to it over and over and didn&amp;#039;t feel the need to speed correct\nanything.  I&amp;#039;m not criticizing his job, I&amp;#039;m just saying I didn&amp;#039;t hear\nenough to make that change.\n\nThe Whole Lotta Love medley is as bluesy as I&amp;#039;ve ever heard it, and damn\nlong, with a really unusual intro that gets the crowd clapping and then\nroaring when they finally recognize it.  It&amp;#039;s exactly the thing to\nremind you that this band was playing You Shook Me and ICQYB just a year\nor so ago, and by the time they get back to WLL some 21 minutes later,\nwell, I&amp;#039;m sure Bonham is out of breath, and the crowd is absolutely\ngoing bonkers.  The show finishes with Weekend, the band really\nfinishing it off and playing hard until the end.\n\nThe guy who gave me this described it like this - &quot;i picked up from\n&amp;#039;Collector&amp;#039; - he got his DAT from &amp;#039;Transferrer&amp;#039; who transfered his DAT\nfrom the tapes - unlike the first torrent, - mine is noticeably clearer\n- significantly less hiss - and brighter to my ears...   ...I do believe\nthis show was recorded INSIDE rather than outside - I guess well never\nknow - the evidence from the recording points, in my opinion to the\nformer however&quot;\n\nThat would make the lineage Master &gt; DAT (Transferrer) &gt; DAT (Collector)\n&gt; CD-R (Supplier) &gt; CD-R (TimD) &gt; PC via EAC (TimD&amp;#039;s PC) &gt; Adobe \nAudition 3 &gt; WAV &gt; FLAC(8) via EAC.\n\nThis is the source previously remastered by Eddie Edwards.\nRe-remastered by me at the suggestion of the anonymous supplier.  He\nalso complimented Eddie&amp;#039;s work and simply thought it was time someone\ngave it the full EQ treatment.\n\nSpeaking of which, I&amp;#039;m not going to lie to you at all about what&amp;#039;s been\ndone here - this recording has been twisted and turned through the\nvagaries of Adobe Audition 3, which is an extremely powerful mixing and\nmastering tool.  It&amp;#039;s been subjected to balancing of the channels,\namplification (without compression,) three consecutive layers of graphic\nEQ, adaptive noise reduction to reduce the tape hiss produced by\namplification and EQing, a slight amount of reverb to open up the\nrecording, plus Mastering-EQ, stereo-channel width adjustment, and a\nfull-output gain.  And even then, there are sections that don&amp;#039;t sound as\ngood as others.  Rather than attempting to shift around with a million\nevent-EQs I&amp;#039;ve tried to create one good level for the whole show without\nmaking other parts suffer.  Probably works best with Heartbreaker and\nnot-as-well with Celebration Day, but pretty damn nice overall.\n\nSo again, a new and/or improved set for The TimD Series.  Honey, get it\nwhile ya can...\n\n\nLed Zeppelin\nMontreux, Switzerland\nAugust 7, 1971\n&quot;Led Zeppelin A Montreux: Bon Public&quot;\nA TimD Series production\n\nLineage:\nMaster &gt; DAT (Transferrer) &gt; DAT (Collector) &gt;\nCD-R (Supplier) &gt; CD-R (TimD) &gt; PC via EAC (TimD&amp;#039;s PC) &gt;\nAdobe Audition 3 &gt; WAV &gt; FLAC(8) via EAC.\n\nSetlist:\n\nDisc 1:\n1  Immigrant Song (4:23)\n2  Heartbreaker (6:46)\n3  Since I&amp;#039;ve Been Lovin&amp;#039; You (7:43)\n4  Black Dog (6:03)\n5  Dazed and Confused (18:21)\n6  Stairway To Heaven (10:51)\n7  Going To California (5:00)\n8  That&amp;#039;s The Way (6:46)\n9  Celebration Day (5:05)\n10 What Is And What Should Never Be (4:31)\n\nDisc 2:\n1  Whole Lotta Love (22:57)\n     Blues Medley\n2  Weekend (3:29)\n\nSpecial thanks to the taper, the anonymous source, Eddie Edwards for \nleaving good notes on your previous work, FBO and the members of The \nTimD Series, Claude Nobs, Peter Grant and Led Zeppelin.\n\nTimD\n\n","torrent":{"xt":"urn:btih:320c7ee03d24f947f0f2dbd7a674166a1ffcf297","amp;dn":"Led+Zeppelin+1971.08.07+-+Montreux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"320c7ee03d24f947f0f2dbd7a674166a1ffcf297","infoHashBuffer":{"type":"Buffer","data":[50,12,126,224,61,36,249,71,240,242,219,215,166,116,22,106,31,252,242,151]},"announce":[],"urlList":[]}}