{"title":"Magills Encyclopedia of Science - Plant Life(4 Vols){BBS}","uid":6712103,"size":37396628,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:320fe5fa7544ef79b341118b6faf57c3802dfb97&amp;dn=Magills+Encyclopedia+of+Science+-+Plant+Life%284+Vols%29%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317393305,"description":"Written by subject authorities, this encyclopedia provides approximately 380 articles on botany and related sciences. About half of the articles were updated and revised from other Salem publications, among them Magill's Survey of Science: Life Science (1991), Magill's Survey of Science: Life Science, Supplement (1998), Encyclopedia of Environmental Issues (2000), and Earth Science (2001). The rest were written specifically for this encyclopedia. The easy-to-understand, alphabetically arranged, signed entries are written at a level appropriate for high-school and undergraduate students as well as the general reader. Averaging several pages in length, discussions begin with an overview of the topic and end with an annotated bibliography of books and articles. All bibliographies, even those attached to articles taken from previous sets, are new. Examples of topics covered include Acid precipitation, Carbon cycle, Deforestation, Estrogens from plants, Fruit crops, Ginkgos, Medicinal plants, Rubber, Soil, Stems, Taiga, and Zygomycetes.\n\nBlack-and-white line drawings, photographs, charts, tables, sidebars, and maps augment the text. About 200 pages of useful supplemental materials are provided, including one-paragraph biographies of important botanists, a plant classification overview, a 35-page glossary, a time line of important advances in plant science, common-to-scientific plant names, scientific-to-common plant names, Web sites, and an annotated bibliography. A well-constructed 50-page index provides subject access to the set.\n\nTwo other recent encyclopedias on the topic, Macmillan's Plant Sciences (2001) and Grolier's Plants and Plant Life (2001), are designed to meet the needs of middle-school students and up. Salem's entry on the plant science shelves is recommended for high-school, public, and undergraduate libraries in need of a general encyclopedia of plant science. RBB\nCopyright Ã‚Â© American Library Association. All rights reserved\nProduct Details\n\n    * Hardcover: 1200 pages\n    * Publisher: Salem Pr Inc (April 2003)\n    * Language: English\n    * ISBN-10: 1587650843\n    * ISBN-13: 978-1587650840","torrent":{"xt":"urn:btih:320fe5fa7544ef79b341118b6faf57c3802dfb97","amp;dn":"Magills+Encyclopedia+of+Science+-+Plant+Life%284+Vols%29%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"320fe5fa7544ef79b341118b6faf57c3802dfb97","infoHashBuffer":{"type":"Buffer","data":[50,15,229,250,117,68,239,121,179,65,17,139,111,175,87,195,128,45,251,151]},"announce":[],"urlList":[]}}