{"title":"Renaissance and Mannerist Art (Art Ebook).pdf","uid":12097834,"size":42139800,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3235fd84433d29da571742c9b157b4366d13fae2&amp;dn=Renaissance+and+Mannerist+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1436221337,"description":"Renaissance and Mannerist Art\nHarry N. Abrams, Inc. | 1968 | ISBN: N/A | English | 272 pages | PDF | 40.2 MB\n\nNever has the Western world experienced such an abundance of creative genius as it did during the 2 centuries with which this book is concerned. The rediscovery of Antiquity, after nearly 1,000 years in which the magnificent achievements of Greece and Rome had been forgotten or even reviled, was a major force behind the unprecedented explosion of great talent and production of an overwhelming body of masterpieces that were to influence every artistic movement in Europe for the next 500 years. The authors tell how this rebirth came about, and how, nourished by a new awareness of Man and of Nature, the Italian masters of the early 15th century finally threw off the chains of the International Gothic style and laid the foundations of the new art that was to find its ultimate expression in the works of those giants of the High Renaissance--Leonardo, Raphael, and Michelangelo. The unusually wide scope of this book embraces also the simultaneous, but very different, Renaissances that took place outside Italy. Spain, France, the Low Countries, Germany and England are each treated in turn. More than 250 carefully selected and finely reproduced plates--illustrating not only the 3 major arts of painting, sculpture, and architecture, but also the minor decorative arts, and adding an exciting visual dimension to the lively text--help to tell the story of how the new forms took root, grew, and were transformed; how they were influenced and shaped by the historic events and personalities of the time; how ideas and methods were interchanged between North and South; and, in particular, how the calm classicism of the Renaissance quickly evolved into the introspective, often distorted, sometimes almost neurotic art of Mannerism","torrent":{"xt":"urn:btih:3235fd84433d29da571742c9b157b4366d13fae2","amp;dn":"Renaissance+and+Mannerist+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3235fd84433d29da571742c9b157b4366d13fae2","infoHashBuffer":{"type":"Buffer","data":[50,53,253,132,67,61,41,218,87,23,66,201,177,87,180,54,109,19,250,226]},"announce":[],"urlList":[]}}