{"title":"EnigmaT Set Rips { Cuts } - August 20th, 2013","uid":8831534,"size":1082509931,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:333d9081a6a75ed75e7688ca56962e259f197fe6&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+August+20th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"EnigmaT","files":107,"time":1376995443,"description":"A$AP Rocky &amp; Skrillex - Wild For The Night (Dog Blood Remix) (Cut From D-Mad Set)-enTc.mp3\nA.M.R Feat. Ai Tekekawa - Whispers (Cut From Tydi Set)-enTc.mp3\nAirtight - Hydra (Original Mix) (Cut From Shah Set)-enTc.mp3\nAraya - Stakato (Asteroid Belt Remix) (Cut From tranzLift Set)-enTc.mp3\nArctic Moon &amp; Paul Webster - We Are In The Crowd (Original Mix) (Cut From Sied Set)-enTc.mp3\nArisa &amp; Colak - What Lies Within (Behind The Sunset Remix) (Cut From RAM Set)-enTc.mp3\nArston - ID (Cut From D-Mad Set)-enTc.mp3\nArty Feat. Fiora - Grand Finale (Arston Remix) (Cut From D-Mad Set)-enTc.mp3\nAWD - Freedom (-Short- Cut From Tritonal Set)-enTc.mp3\nBardalimov - Four Points (Mike van Fabio Remix) (Cut From Summerville Set)-enTc.mp3\nBaron Massilia Feat. Maela Evans - L.O.V.E. (Club Edit) (Cut From Young Free Set)-enTc.mp3\nBlue Horizon &amp; Shyprince - Lithium (Type 41 Remix) (Cut From Above Clouds Set)-enTc.mp3\nBlue Horizon &amp; Shyprince - Lithium (Type 41 Remix) (Cut From tranzLift Set)-enTc.mp3\nBrad Ashtar - Azure (ID Remix) (Cut From Summerville Set)-enTc.mp3\nChevy One - Blade Crawler (Cut From Patterson Set)-enTc.mp3\nChristian Burns &amp; Paul Van Dyk - We Are Tonight (Walden Remix) (Cut From Shah Set)-enTc.mp3\nCosta - Sky Light (Original Mix) (Cut From First Effect Set)-enTc.mp3\nD-Mad - ID (Cut From D-Mad Set)-enTc.mp3\nDamian Wasse - Key to Life (Cut From Stowers Set)-enTc.mp3\nDavizzino Barretti &amp; VDMV - La Otra (Fer BR Remix) (Cut From Patterson Set)-enTc.mp3\nDogus Cabakcor Feat. Elif - Rise Again (Cut From Tydi Set)-enTc.mp3\nDon Diablo &amp; Cid - Prototype (Cut From W&amp;W Set)-enTc.mp3\nDreamy &amp; Ikerya Project - Our Story (Amitacek Remix) (Cut From Amitacek Set)-enTc.mp3\nDreamy - Always With Me (Ikerya Project Remix) (Cut From Indayo Set)-enTc.mp3\nErik Strong - Backstage (Hydrogenio Remix) (Cut From Fabio XB Set)-enTc.mp3\nEstigma - Nymeria (Mike van Fabio &amp; Araya Remix) (Cut From Vale Set)-enTc.mp3\nEtasonic - Foreign Dust (UDM Remix) (Cut From Cold Set)-enTc.mp3\nFrench Skies - Quantum Effect (Akku Remix) (Cut From Lazarus Set)-enTc.mp3\nFrench Skies - Quantum Effect (Akku Remix) (Cut From Uplift Set)-enTc.mp3\nFunction C presents Keelin Temple - Ascent (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nGelius - Pleasure by Freedom (Cut From Defcon Set)-enTc.mp3\nGlynn Alan - The Vision (Cut From Stowers Set)-enTc.mp3\nID - ID (Darren Porter Remix) (Cut From Marian Set)-enTc.mp3\nIroc - She Moves (Go Large Vocal Dub Mix) (Cut From Tydi Set)-enTc.mp3\nJames Williams - Inspired (Dave Cold Remix) (Cut From Marian Set)-enTc.mp3\njjoo &amp; Jamboys feat. Anna Yvette - Higher (Original Mix) (Cut From Faruk Set)-enTc.mp3\nJohan Ekman - Brighter Days (Original Mix) (Cut From Vale Set)-enTc.mp3\nJohn O'Callaghan Feat. Erica Curran - I Believe (Craig Connelly Remix) (Cut From A&amp;F Set)-enTc.mp3\nJohnny Yono &amp; Broning - The Storm Before The Calm (Original Mix) (Cut From Johnnie Play Set)-enTc.mp3\nJulian Vincent feat. Cathy Burton - Certainty (Philippe El Sisi Remix) (Cut From Amitacek Set)-enTc.mp3\nK.I. - Moonblind (Original Mix) (Cut From Stowers Set)-enTc.mp3\nKaltFlut &amp; Jos van Aken- Absolution (Brett Wood Remix) (Set Rip)-enTc.mp3\nKukuzenko feat. Al Jet - Beyond The Words (Kheiro &amp; Medi Vocal Mix) (Cut From Indayo Set)-enTc.mp3\nLange presents LNG - Hoover Damn (Save The Robot Remix) (Cut From Haslam Set)-enTc.mp3\nLedo - Hear My Scream (Original Mix) (Cut From Vale Set)-enTc.mp3\nLekSin - Only You (Ico Remix) (Cut From Vale Set)-enTc.mp3\nLele Troniq - Under The Spotlight (Steven Kirkwood Remix) (Cut From Haslam Set)-enTc.mp3\nLiquid Soul - Have You Ever (Cut From Patterson Set)-enTc.mp3\nMaor Levi Feat. Daphne - Beautiful Disaster (Cut From W&amp;W Set)-enTc.mp3\nMatson - Hold Back (Hydro Aquatic &amp; I-Luminate Remix) (Cut From Vale Set)-enTc.mp3\nMatt Chowski - Painting Clouds (Sunset Heat Remix) (Cut From Shadows Set)-enTc.mp3\nMatt Chowski - Painting Clouds (Sunset Heat Remix) (Cut From Uplift Set)-enTc.mp3\nMatt Eray - Manihi (Ikerya Project Remix) (Cut From Marian Set)-enTc.mp3\nMatthew Norrs - Sunset Express (Cut From GO Set)-enTc.mp3\nMax Freegrant feat. Nevee - Twin Flame (Original Mix) (Cut From Tempo Set)-enTc.mp3\nMichael Tanner - We Went There (Dub Mix) (Cut From Valentine Set)-enTc.mp3\nMiikka Pelkonen - Adesso (Tmo Vaittinen Remix) (Cut From Above Clouds Set)-enTc.mp3\nMilamDo pres. Harmonic Rush - The Dark Side Of Persia (Original Mix) (Cut From Marian Set)-enTc.mp3\nMino Safy pres. Pure Amine - Evening Star (Original Mix) (Cut From Uplift Set)-enTc.mp3\nMiss Cortex &amp; Chrys Ruff - Lucky Strike (Cut From Vale Set)-enTc.mp3\nMohamed Ragab - Sharm (ID Remix) (Cut From A&amp;F Set)-enTc.mp3\nNivaya - New Logo (Cut From A&amp;F Set)-enTc.mp3\nOneRepublic - If I Lose Myself (Lush &amp; Simon Bootleg) (Cut From Ronski Set)-enTc.mp3\nOnur Camur - Dysphoria (Mike Van Fabio Remix) (Cut From Saux Set)-enTc.mp3\nOnur Camur - Dysphoria (UDM Remix) (Cut From Amitacek Set)-enTc.mp3\nPapercut - Black Dog (Speerit White Dog Remix) (Cut From Young Free Set)-enTc.mp3\nPassion Pit - Let Your Love Grow Tall (Maor Levi's Starlight Mix) (ABGT 041 Rip)-enTc.mp3\nPete Silver - UNTITLED 001 (Set Rip)-enTc.mp3\nPete Silver - UNTITLED 002 (Set Rip)-enTc.mp3\nPete Silver - UNTITLED 003 (Set Rip)-enTc.mp3\nPeter Hulsmans - Intouchable (Cut From Stowers Set)-enTc.mp3\nPeter Plaznik pres. Chemical Content 1 - The Swamp (Jordan Suckley Remix) (Cut From JOC Set)-enTc.mp3\nPhil Parry - Venomous (Renato Dinis Remix) (Cut From Dinaire Set)-enTc.mp3\nPure Amine - Evening Star (Peter O'Ski Remix) (Cut From tranzLift Set)-enTc.mp3\nRAM - RAMnesia (Cut From RAM Set)-enTc.mp3\nRene Ablaze &amp; 7 Baltic - Phoenix Sun (Original Mix) (Cut From Shah Set)-enTc.mp3\nRigby - Where Earth Meets Water (Jacob van Hage &amp; Nash Remix) (-Short- Cut From W&amp;W Set)-enTc.mp3\nRoger Shah Pres. Sunlounger Feat. Alexandra Badoi - I'll Be Fine (Roger Shah Rework) (Cut From Shah Set)-enTc.mp3\nRoger Shah Pres. Sunlounger Feat. Suzie Del Vecchio - If You Were Here (Original Mix) (Cut From Shah Set)-enTc.mp3\nRoma Pafos feat. Sunblind - For A Second (Maison &amp; Dragen Remix) (Cut From Tempo Set)-enTc.mp3\nRonny K. - City Of Angels (Original Mix) (Set Rip)-enTc.mp3\nRonny K. - Collateral (Original Mix) (Set Rip)-enTc.mp3\nRonny K. - Pelagea (Cut From Space Gadren Set)-enTc.mp3\nRonski Speed with Tony Awake Feat. Gracia Ho - Not Easy (Cut From Ronski Set)-enTc.mp3\nSaphirSky - The Promise (Playme Remix) (Cut From Uplift Set)-enTc.mp3\nSash featuring Tina Cousins - Mysterious Times (Touchstone Remix) (Cut From Lazarus Set)-enTc.mp3\nScarface - Tears Of Joy (Original Mix) (Cut From Shah Set)-enTc.mp3\nSebastian Brushwood - Alone (Original Mix) (Cut From Uplift Set)-enTc.mp3\nSebastian Weikum - Paroxysm (LTN Remix) (Cut From D-Mad Set)-enTc.mp3\nSeneta - The North Remembers (Original Mix) (Cut From Uplift Set)-enTc.mp3\nSergey Shabanov - Other Point (Original Mix) (Cut From Vale Set)-enTc.mp3\nSilica - Samurai (Cut From Defcon Set)-enTc.mp3\nSimon Patterson - Bulldozer (Harmonic Rush Remix) (Cut From Patterson Set)-enTc.mp3\nSqaurz Kamel &amp; Love Dimension - Say Me (Mark Bester Remix) (Cut From Gomrass Set)-enTc.mp3\nSuper8 &amp; Tab - The Way You Want (D-Mad Remix) (Cut From D-Mad Set)-enTc.mp3\nSuprano Feat. Claire Willis - Holding On (AS Alien String Remix) (Cut From Vale Set)-enTc.mp3\nTempo Giusto &amp; Jace Headland - Coral Bay (Original Mix) (Cut From Tempo Set)-enTc.mp3\nTempo Giusto - Chemical Agent (Original Mix) (Cut From Tempo Set)-enTc.mp3\nTempo Giusto feat. Justin Cameo - Embrace The Life (Original Mix) (Cut From Tempo Set)-enTc.mp3\nTiesto &amp; DJ Punish - Shocker (Iwaro 'Lethal Industry' Melody Resample) (Cut From D-Mad Set)-enTc.mp3\nTiesto, Alvaro &amp; Quintino - United (Revero Remix) (Cut From Faruk Set)-enTc.mp3\nTimur Shafiev - Mainstream (Original Mix) (Cut From Sied Set)-enTc.mp3\nTom8 - Lotus (Cut From Stowers Set)-enTc.mp3\nTuneflux - Brink Of Time (Original Mix) (Cut From Vale Set)-enTc.mp3\nVeselin Tasev pres. Noise Force - Infinity Land (Uplifting Remix) (Set Rip)-enTc.mp3\nVladimir An - Another Way (Novaline Remix) (Cut From Space Gadren Set)-enTc.mp3\nXB &amp; Le Saux - Overture of Angels (Angels Mix) (Cut From Stowers Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:333d9081a6a75ed75e7688ca56962e259f197fe6","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+August+20th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"333d9081a6a75ed75e7688ca56962e259f197fe6","infoHashBuffer":{"type":"Buffer","data":[51,61,144,129,166,167,94,215,94,118,136,202,86,150,46,37,159,25,127,230]},"announce":[],"urlList":[]}}