{"title":"Star Wars Battlefront 1 and Star Wars Battlefront 2 (Full Rips)","uid":5843755,"size":627039010,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:344d6c8cbb75ac208c4c607de6d75373ac3e2e16&amp;dn=Star+Wars+Battlefront+1+and+Star+Wars+Battlefront+2+%28Full+Rips%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"FuCtUpPuNk","files":30,"time":1285027675,"description":"INSTALLATION:\nStar Wars Battlefront 1:\nrun &quot;Star-Game.bat&quot;\nlet it install\nrun &quot;Battlefront.exe&quot; to play\n\n\nStar wars Battlefront 2:\nrun &quot;install.bat&quot;\nlet it install\nrun &quot;BattlefrontII.exe&quot; to play\n\nNOTE: on both games, install them having the folder on desktop or C:\\Games\nafter installation there will be a sub folder called &quot;GameData&quot; or similar to that.\nthe .exe files to run the games are located in these folders\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\n\nSTAR WARS BATTLE FRONT 1:\nGameplay:\nStar Wars: Battlefront encompasses battles between four main factions from both the original and prequel trilogies: the Galactic Republic and the Confederacy of Independent Systems (CIS) of the prequel era, and the Rebel Alliance and Galactic Empire of the classic trilogy. However, factions can only play their historical adversary; there cannot be any Rebels vs. Separatists or Clones vs. Empire fights. In each faction, five different classes of characters become available. Four of the classes are similar for each faction: a basic infantry soldier (a Super battle droid for the CIS), heavy weapons soldier, pilot and sniper. Both factions have a set amount of reinforcements. When the reinforcements have been depleted, the faction loses. Scattered around the battlefields are command posts. AI units and players use these command posts to spawn from after being killed. If a faction controls all command posts, they win the battle unless capture of one of these points is disrupted. Each faction has special units such as the Droideka for the Separatists, and a Jetpack-wielding darktrooper for the Empire. Several ground and air vehicles are also available to the player on the battlefield. Ranging from the hulking AT-AT, to the fast speeder bike, there are more than 25 vehicles at the player's disposal.\n\nIn Star Wars: Battlefront, Jedi heroes are featured: Mace Windu battles for the Galactic Republic, Count Dooku for the Separatists, Luke Skywalker battles with the Rebel Alliance and Darth Vader the Galactic Empire. Unlike its successors, jedi characters are not playable.\n\nGalactic Conquest Mode\nIn this mode, the player uses strategy to take control of planets and dominate an area of the galaxy. First the player chooses a map configuration based on conflicts from both eras of Star Wars history. Some maps start both sides evenly and some favor one faction. Next the player chooses what faction to play as. The game is played in turns, with the player starting first. The player is able to select an enemy controlled or neutral planet to attack, (the enemy planets have two maps to conquer, while neutral only have one). After selecting what planet to attack, the player is able to activate a bonus from one of his already owned planets (if any).\n\nEach planet provides its own unique bonus, but must be captured first before the player can use that bonus. Bonuses help the player in battle by impeding the enemy or assisting the players team.\n\nIf one side manages to win four battles (not necessarily in a row), they gain access to their faction's Secret Base bonus. The Secret Base bonuses are very powerful and change the course of a game. They can be used on any enemy planet, except for the enemy's Secret Base. The game is completed when one faction controls all of the planets on the map.\n\nInstant Action\nThis mode allows the players to jump right into a battle of their choice. The players can also customize a list of battles that will then be played through in the order they have chosen, or in a random order.\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n\nSTAR WARS BATTLEFRONT 2:\nGameplay\nBattlefront II is fundamentally similar to its predecessor, albeit with the addition of new gameplay mechanics. The general objective in most missions is to eliminate the enemy faction. Like Star Wars Battlefront, the game is split into two eras, the Galactic Civil War and the Clone Wars. Players have the ability to choose between six classes during gameplay. Four class types are common to all factions; infantry, heavy weaponry, sniper and engineer. In addition to the four standard classes, each faction has two unique classes which unlock by scoring a predetermined number of points. Battlefront II also features heroes; a special class that allows the player to control iconic characters from the Star Wars universe. Heroes serve as a bonus to players, and unlock by meeting certain criteria, such as earning a certain number of points.\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:344d6c8cbb75ac208c4c607de6d75373ac3e2e16","amp;dn":"Star+Wars+Battlefront+1+and+Star+Wars+Battlefront+2+%28Full+Rips%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"344d6c8cbb75ac208c4c607de6d75373ac3e2e16","infoHashBuffer":{"type":"Buffer","data":[52,77,108,140,187,117,172,32,140,76,96,125,230,215,83,115,172,62,46,22]},"announce":[],"urlList":[]}}