{"title":"POtHS - Creation - 47 - The Heavens Declare - Science Confirms t","uid":7869735,"size":4143976926,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3482f8113cf2e42cb288818d1bd0887745440a8d&amp;dn=POtHS+-+Creation+-+47+-+The+Heavens+Declare+-+Science+Confirms+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":86,"time":1354167012,"description":"POtHS - Creation 47\n\n\nThe Heavens Declare\nScience Confirms the Bible\n\n\n\n\nPOtHS Comments on This one......... There is truth here for all ages and beliefs. If Darwin was wrong...........then the Schools have been intentionally lying to our Children. If the schools teach Darwinism which says there is NO CHRIST. Then they are of The Anti-Christ. Public Schools teaching books CHANGE EVERY YEAR. The Bible never changes. So where is truth??? In Evolution Theories??? If you believe in Evolution you are denying The Father, The Son and The Holy Spirit of the Praise They are entitled too for making everything you understand and can see and more than that, everything you don't understand and can't see. If you have never thanked the CREATOR for his Creation now is your chance to thank Him.\n\nDescription\nThe Heavens Declare - Chris Ashcraft:\nThe Heavens Declare by Chris W. Ashcraft, MS., M.Ed. Seattle Creation Conference, \n15 Reasons you should reject evolution 05-13-12:\nEvolution is a monumental lie and excursion into fantasy land.  Learn more about what they don't want you to know.\n\n\nCreation Science Confirms the Bible Is True: &lt;a href=&quot;\nhttp://answersingenesis.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://answersingenesis.org&lt;/a&gt; In 1859, Charles Darwin published his infamous work On the Origin of Species. In this new video, Creation: Science Confirms the Bible is True, astrophysicist Dr. Jason Lisle (Ph.D. from the University of Colorado at Boulder) systematically \n\nThe Ultimate Proof of Creation Dr Jason Lisle:\nOn Friday, April 10th, 2009 Rocky Mountain Creation Fellowship ( http://YoungEarth.Org ) welcomed Dr. Jason Lisle from Answers in Genesis (http://AnswersInGenesis.org) . Jason has been a long time member of RMCF and has spoken here while he was pursuing his Ph.D. at CU in Boulder.\n\nMost practicing astronomers and astrophysicists believe in the big bang, a billions-of-years-old universe and other evolutionary ideas. But based on Scripture and the best interpretation of the scientific evidence, they are simply wrong, according to Dr. Jason Lisle. He is an astrophysicist with a Ph.D. from the University of Colorado at Boulder,\n\nDr. Gerald Schroeder Genesis &amp; The Big Bang Theory:\nToday, we look at time going backward. We see 15 billion years. Looking forward from when the universe is very small - billions of times smaller - the Torah says six days. In truth, they both may be correct. What's exciting about the last few years in cosmology is we now have quantified the data to know the relationship of the &quot;view of time&quot; from the beginning, \n           \n     \n:thankyou:    :thankyou:     Thank You JESUS  \n\n\n \n","torrent":{"xt":"urn:btih:3482f8113cf2e42cb288818d1bd0887745440a8d","amp;dn":"POtHS+-+Creation+-+47+-+The+Heavens+Declare+-+Science+Confirms+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3482f8113cf2e42cb288818d1bd0887745440a8d","infoHashBuffer":{"type":"Buffer","data":[52,130,248,17,60,242,228,44,178,136,129,141,27,208,136,119,69,68,10,141]},"announce":[],"urlList":[]}}