{"title":"Mascara (1983)","uid":12143402,"size":1187617204,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:39aeb25855f7276097f82c04401857fa45edce41&amp;dn=Mascara+%281983%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GreatKey","files":1,"time":1437405117,"description":"cover &lt;a href=&quot;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=956&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=956&lt;/a&gt;\npreview &lt;a href=&quot;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=957&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=957&lt;/a&gt;\n\n\nTitle: Mascara\nYear: 1983\nCountry: USA\nDirector: Henri Pachard\nStarring: Lisa Cintrice (as Cintrice), Ginger Jay (as Jinger Jaye), Lee Caroll, Lisa De Leeuw (as Lisa DeLeeuw), Mistress Candice, Tiffany Clark, Bobbie Burns (as Bobbi Burns), Ashley Moore, Bobby Astyr, George Payne, Jamie St. James (as Jessie Stewart), Ken Yontz (as Ken Nichols), R. Bolla, Ron Jeremy, Sean Elliot (as Sean Elliott), Lee Allen Richardson\nTime: 01:22:37\nSize: 1.07 GiB\nResolution: 576x432\nType of file: AVI\nAbout: A sexual drama of uncommon depth, 'Mascara' is one of the best sex films of director Henri Pachard's career. Shot in 1983, the film stars Lisa DeLeeuw in one of her best roles ever, playing a lonely young woman who spends her days in the secretarial pool and her nights looking for lust in all the wrong places. After a particularly disappointing one night stand, Lisa decides to see how the other half lives. She finds a mentor in high-priced call girl Lee Carroll, and starts spending her night engaged in some pay-for-play passion of her own. Lisa indulges her every erotic appetite, whether it's taking on two guys at once or experiencing lesbian lust in the arms of a sultry siren. Things quickly get a bit heady for Lisa and she starts to wonder whether a life devoted purely to sensual pleasure is such a great thing after all. In it, Lee plays a lady of the evening, a trashy-looking prostitute who makes office visits in the afternoon and hosts johns in her crummy apartment. Following one particularly raunchy rendezvous with office manager Robert Kerman, she is recruited by mousy secretary Lisa de Leeuw, who is having some sexual hang-ups of her own. Lee warns Lisa, &quot;Look, honey, I don't know what you've heard, but I am not a hooker with a heart of gold.&quot; Through a series of trysts wherein Lisa is coaxed out of her shell, the two do begin to bond, and Lee contributes a show-stopping monologue, very heart-felt, telling Lisa how being a prostitute can be the scariest profession in the world","torrent":{"xt":"urn:btih:39aeb25855f7276097f82c04401857fa45edce41","amp;dn":"Mascara+%281983%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39aeb25855f7276097f82c04401857fa45edce41","infoHashBuffer":{"type":"Buffer","data":[57,174,178,88,85,247,39,96,151,248,44,4,64,24,87,250,69,237,206,65]},"announce":[],"urlList":[]}}