{"title":"The Crimson Nun #1-4 (1997)","uid":7790889,"size":58461912,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3a9b75ec178361ff9b6994d6403ed3271026459e&amp;dn=The+Crimson+Nun+%231-4+%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":4,"time":1352023170,"description":"English | CBR | 4 Issues\n\nThe Crimson Nun #1-4 (1997)\nPublisher:  Antarctic Press\nPublication Date:  May - November 1997\n\nStory by Brian Farrens\nIllustrated by Bobby Diaz and Kelsey Shannon\n\nA native of California, she was the Warrior Nun Areala active during World War II. There she was known as the Crimson Nun, famous to this day as the arch-foe of Nazi super-villains. Her career began prior to her birth when her father, a World War I American soldier or Doughboy, was reportedly killed in the Battle of Belleau Wood. This led to Sister Alicia with a sincere hatred of all things German and negatively impacted her family life with her mother being unable to cope. Alicia then raised herself and proved to be a stubborn, unyielding girl who went around picking fights with boys. She was also a fan of the Lone Ranger radio series hearing it throughout the Great Depression; she would eagerly play out the roles with toys and shout &quot;Hiyo Silver, away!&quot; After her mother's death, she grew up at various Catholic orphanages where her martial prowess came to be noted by the nuns who raised her.\n\nShe was soon inducted into the Warrior Nun order and ultimately brought before Pope Pius XI who, rightly so, saw the world filled with Fascists and Communists that would plunge the world into war. Knowing that he would have to take the fight to a new level, he commissioned her as the Crimson Nun, a woman with a license to kill. Restricted to killing monsters, most Warrior Nuns and other members of the Corps are forbidden from killing human beings even in defense of their own lives; thus due to the controversial nature of her missions, they were mostly conducted in secret. However, while she was indeed willing and able to use lethal force against Nazis, agents of Imperial Japan, Chinese warlords living up to the Fu Manchu stereotype, and the Catholic killing Spanish Republicans during the Spanish Civil War, she took no pleasure in it and would remorsefully ask God's forgiveness, going to confession for penance after each mission.\n\nThese are her adventures...","torrent":{"xt":"urn:btih:3a9b75ec178361ff9b6994d6403ed3271026459e","amp;dn":"The+Crimson+Nun+%231-4+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a9b75ec178361ff9b6994d6403ed3271026459e","infoHashBuffer":{"type":"Buffer","data":[58,155,117,236,23,131,97,255,155,105,148,214,64,62,211,39,16,38,69,158]},"announce":[],"urlList":[]}}