{"title":"RailWorks - Canadian National","uid":6563628,"size":28556122,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3bf2dab38ee6dc537a0f5143590b136748936469&amp;dn=RailWorks+-+Canadian+National&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MSFLIGHT","files":-1,"time":1311582676,"description":"The Canadian National Locomotive pack includes three Career System scenarios to test your skill as a driver, as well as two CN-liveried locomotives.\n\nCanadian National (CN) is the largest railroad in Canada, in terms of both revenue and the physical size of its rail network, and is currently Canadas only transcontinental railway company, spanning from the Atlantic to the Pacific. Following the purchase of Illinois Central and a number of smaller US railways it also has an extensive network in the central United States along the Mississippi River valley from the Great Lakes to the Gulf of Mexico. Today Canadian National owns approximately 20,400 route miles of track in 8 provinces, as well as a 70 mile stretch into the Northwest Territories to Hay River on the southern shore of the Great Slave Lake it is the northernmost rail line anywhere within the North American Rail Network, going as far north as Anchorage, Alaska.\n\nProduced between 1972 and 1986, General Motors Electro Motive Diesel (EMD) produced the 3,000 horsepower SD40-2 as an upgrade from the SD40. The SD40-2 features modular electronic control systems, making it significantly more reliable and economical than its competitors, and with almost 4,000 units built for 29 railroad companies, the SD40-2 is one of the best selling locomotives of all time.\n\nBuilt by General Electrics Transportation Systems division in response to the introduction of tighter emission policies that came into effect in 2005, the ES44 locomotives replaced the 4400CW series. The upgrades resulted in more power and less emissions from the smaller GEVO 12-cylinder engine than its 16-cylinder predecessor. Consisting of a twin six axle wheel arrangement, more than 2000 ES44s have been ordered by nearly all the major US and Canadian railroad companies.","torrent":{"xt":"urn:btih:3bf2dab38ee6dc537a0f5143590b136748936469","amp;dn":"RailWorks+-+Canadian+National","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bf2dab38ee6dc537a0f5143590b136748936469","infoHashBuffer":{"type":"Buffer","data":[59,242,218,179,142,230,220,83,122,15,81,67,89,11,19,103,72,147,100,105]},"announce":[],"urlList":[]}}