{"title":"Junior Kimbrough - Discography FLAC","uid":11374379,"size":2207081277,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3c2b21aea13fa5b4156554c901d633ad344a72fc&amp;dn=Junior+Kimbrough+-+Discography+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1415129590,"description":"Junior Kimbrough - Discography\n\nCited as a prime early influence by rockabilly pioneer Charlie Feathers, Mississippi Delta bluesman Junior Kimbrough's modal, hypnotic blues vision remained a regional sensation for most of his career. He finally transcended the confines of his region in the early '90s, when he appeared in the 1991 movie Deep Blues and on its Anxious/Atlantic soundtrack, leading to his own debut for Fat Possum Records, All Night Long.\nJunior Kimbrough was born and raised in Hudsonville, Mississippi, where he learned how to play guitar by listening to records by Delta bluesmen. In 1968, he cut his first single, &quot;Tramp,&quot; for the local Philwood label. For the next two decades, Kimbrough didn't have the opportunity to record frequently -- he recorded a single, &quot;Keep Your Hands Off Her,&quot; for High Water and his &quot;All Night Long&quot; was available on the various artists compilation National Downhome Festival, Vol. 2 released on Southland Records.\nDuring the '70s and '80s, Kimbrough played juke joints throughout Mississippi, which is where music journalist Robert Palmer discovered him in the late '80s. Palmer featured Kimbrough in his documentary film Deep Blues. The exposure in the movie led to a national record contract for Kimbrough -- he signed with Fat Possum and released his first full-length album, All Night Long, in 1992. The record was critically acclaimed by both blues and mainstream publications, as was Deep Blues and its accompanying soundtrack. All of the media attention led to performances outside of the Delta, including a few shows in England. After the flurry of activity in 1992, Junior Kimbrough returned to playing juke joints in the Delta, recording occasionally -- he released his second album, Sad Days, Lonely Nights, in 1993. Most Things Haven't Worked Out followed in 1997, and a year later Kimbrough returned with God Knows I Tried. He died of a heart attack on January 17, 1998. (AllMusic)\n\nAlbum list:\n1995 - All Night Long\n1997 - Do the Rump\n1997 - Most Things Haven't Worked Out\n1997 - Sad Days, Lonely Nights\n1998 - God Knows I Tried\n1999 - Meet Me In The City\n2002 - You Better Run. The Essential Junior Kimbrough\n2009 - First Recordings\n\nEnjoy and share!","torrent":{"xt":"urn:btih:3c2b21aea13fa5b4156554c901d633ad344a72fc","amp;dn":"Junior+Kimbrough+-+Discography+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c2b21aea13fa5b4156554c901d633ad344a72fc","infoHashBuffer":{"type":"Buffer","data":[60,43,33,174,161,63,165,180,21,101,84,201,1,214,51,173,52,74,114,252]},"announce":[],"urlList":[]}}