{"title":"The Historic Kentucky Kitchen(ePUB,Retail){32Skulls}","uid":11102511,"size":4853563,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c8101463881058c37fa4f32d6bcd310de8d32c7&amp;dn=The+Historic+Kentucky+Kitchen%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"32Skulls","files":-1,"time":1411690079,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\nKitchens serve as more than a place to prepare food; they are cornerstones of the home and family. Just as memories are passed down through stories shared around the stove, recipes preserve traditions and customs for future generations. The rich, diverse heritage of Kentucky's culinary traditions offers a unique way to better understand and appreciate the history of the commonwealth.\n\nThe Historic Kentucky Kitchen assembles more than one hundred dishes from nineteenth and twentieth-century Kentucky cooks. Deirdre A. Scaggs and Andrew W. McGraw collected recipes from handwritten books, diaries, scrapbook clippings, and out-of-print cookbooks from the University of Kentucky Libraries Special Collections to bring together a variety of classic dishes, complete with descriptions of each recipe's origin and helpful tips for the modern chef. The authors, who carefully tested each dish, provide recipe modifications and substitutions for rare and hard-to-find ingredients.\n\nThis entertaining cookbook also serves up famous Kentuckians' favorite dishes, such as John Sherman Cooper's preferred comfort food (eggs somerset) and Lucy Hayes Breckinridge's &quot;excellent&quot; fried oysters. The recipes are flavored with humorous details such as &quot;[for] those who thought they could not eat parsnips&quot; and &quot;Granny used to beat 'em [biscuits] with a musket.&quot; Accented with historic photographs and featuring traditional meals ranging from skillet cakes to spaghetti with celery and ham, The Historic Kentucky Kitchen presents a novel and tasty way to experience the history of the Bluegrass State.\n\n\nBy Deirdre A. Scaggs, Andrew W. McGraw\nPublished by The University Press of Kentucky in 2013\nEPUB, Retail, 184 pages, English ","torrent":{"xt":"urn:btih:3c8101463881058c37fa4f32d6bcd310de8d32c7","amp;dn":"The+Historic+Kentucky+Kitchen%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c8101463881058c37fa4f32d6bcd310de8d32c7","infoHashBuffer":{"type":"Buffer","data":[60,129,1,70,56,129,5,140,55,250,79,50,214,188,211,16,222,141,50,199]},"announce":[],"urlList":[]}}