{"title":"OData Programming Cookbook for .NET Developers {BBS}","uid":7562028,"size":12405759,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d7c1f0bc3e0209c6a7ef8172c3628fc7b51e9e3&amp;dn=OData+Programming+Cookbook+for+.NET+Developers+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1345764446,"description":"Odata (Open Data Protocol) is a Web protocol for querying and updating data that provides a way to unlock your data and free it from silos that exist in applications today. OData enables data access among a variety of applications, services, and stores by adopting existing Web technologies such as HTTP, XML, and JSON. This book deals with common OData programming cases over the Microsoft .NET Framework platform and eases the learning curve for a .NET developer to start incorporating OData in data service development.\n\nThis book provides a collection of recipes that help .NET developers to get familiar with OData programming in a quick and efficient manner. The recipes cover most OData features from the former ADO.NET Data Service to the current WCF Data Service platform. In addition, all the sample cases here are based on real-world scenarios and issues that .NET developers might come across when programming with OData in application development.\n\nThis book will be your handy guide with basic to advanced walkthroughs of common OData programming cases for the Microsoft .NET Framework platform. You will learn quick solutions to necessary tasks to integrate the power of OData at both server-side and client-side.\n\nThis book will help you master the use of OData with .NET Framework by taking you through hands-on and practical recipes. It starts by talking about the common means for building OData services and consuming OData services in client applications. Then, some more specific topics like hosting, configuration and security are discussed. The book also covers many popular and interesting topics such as integrating OData in web applications, and developing data-driven mobile applications with OData. Moreover, you can also find quite a few recipes discussing real-world OData producers and new features in latest and future versions.\n\nWithin &quot;OData Programming Cookbook for .NET Developers&quot;, all the recipes are selected based on real-world scenarios that you will commonly come across. Each recipe covers a specific topic, going from the description of the problem, through a conceptual solution, to a solution containing sample code. By following these recipes, you can acquire how to program with OData in a simple, effective, and easy manner.\n\n\n\n# Paperback: 376 pages\n# Publisher: Packt Publishing (July 25, 2012)\n# Language: English\n# ISBN-10: 1849685924\n# ISBN-13: 978-1849685924","torrent":{"xt":"urn:btih:3d7c1f0bc3e0209c6a7ef8172c3628fc7b51e9e3","amp;dn":"OData+Programming+Cookbook+for+.NET+Developers+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d7c1f0bc3e0209c6a7ef8172c3628fc7b51e9e3","infoHashBuffer":{"type":"Buffer","data":[61,124,31,11,195,224,32,156,106,126,248,23,44,54,40,252,123,81,233,227]},"announce":[],"urlList":[]}}