{"title":"Winborg 7 SP1 Ultimate x64","uid":9464360,"size":4697470976,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3dd64f168d3578957a08b1030a952594f4e753b1&amp;dn=Winborg+7+SP1+Ultimate+x64&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zdevilinside","files":1,"time":1389424452,"description":"\n______________________________\n\n\nWinBorg 7 x64 December 2013\nby soporific\n______________________________\n\n\nIndex:\n\n\n* Welcome\n* What is WinBorg 7\n* Instructions\n* Customize Instructions\n* What's New\n* FAQ\n* Change log\n* One more thing\n\n\n_________________________\n\n\n** Welcome **\n_________________________\n\n\nHi there! Welcome to the first edition of WinBorg 7 x64 ... once you've confirmed it works as advertised, please spread it around as far and wide as you can. This README text file contains all the answers to questions you may have, so please read it if you encounter problems. You can also post questions and report problems to the homepage at http://sharethefiles.com/forum/ (do a search for it using &quot;Winborg 7&quot; as the search criteria)\n\n\n_________________________\n\n\n** What is Winborg 7 **\n_________________________\n\n\nIf you boot with this project and start the setup routine it will clean install Windows 7 SP1 Ultimate updated to the month of release. The aim is for you to be able to stick this DVD in (or create a USB drive install to use), quickly get setup running, and then when setup finally stops your computer is ready to use. There are no steps in between, you don't need to do a thing, you get a fully unattended installation of everything. This means all your device drivers installed and no critical updates need installing. You just sit back and enjoy the ride.\n\n\nThe 'WinBorg' series of unattended installation discs were originally created by BartOfBorg.\n\n\nFurther development since August 2006 by me, soporific.\n\n\nThis version of Winborg 7 used tech from LastOS.org and also WinToolKit. Thanks to all involved with those projects!\n\n\n______________________________\n\n\n** Instructions **\n______________________________\n\n\n* It's a good idea to customize this project for your own needs, see the section below for more info\n* Please note: if you do not have your original motherboard DVD that contains all of your system drivers\n- you will want to add them to this project before using it. Please see the next section for instructions.\n- visit http://driverpacks.net/driverpacks/latest to get the latest driverpacks\n\n* Burn the image to DVD at slow speed or verify the data after burning, then boot with it. Or...\n* To make a USB install, start the DVD menu (see below) and choose the 'Make a USB Version' option.\n\n\n* To start the DVD menu, look in the root folder of the DVD and run &quot;autorun.exe&quot;\n* Make sure the BIOS of your PC is set to boot from your DVD or USB drive, or just use the boot menu.\n\n\n* Your computer will boot into a PE, which is a stripped down version of Windows 7, where you can use a variety of tools to check your hardware or fix problems.\n* Once you are ready to start installing Winborg 7, double-click the icon on the desktop.\n\n\n* Some USB devices interfere with setup so if you experience problems, try unplugging all USB devices and then trying again.\n* Not all the available driverpacks have been included in Winborg 7, but you can easily add the latest packs yourself, see the next section for instructions.\n\n______________________________\n\n\n** Customize Instructions **\n______________________________\n\n* First copy all the DVD image contents to a new folder on your PC.\n* Things you can customize:\n- location to add or delete driverpacks: &lt;your folder&gt;sources$OEM$$1DSAD3NT6x64\n- file that controls the apps library installation: &lt;your folder&gt;WPIUserFilesconfig.js\n- location to add or delete apps from the apps library: &lt;your folder&gt;Apps\n- location to add or delete registry tweaks or 3rd party apps: &lt;your folder&gt;WinborgFirstLogon\n- location to add or delete 3rd party apps installed when desktop loads: &lt;your folder&gt;WinborgFirstDesktop\n- location to add or delete files that are added to the windows folder: &lt;your folder&gt;WinborgOverlay\n\n* When you are ready to re-make the DVD image, look inside the &quot;&lt;your folder&gt;MakeDVD&quot; folder and run &quot;Make-Winborg7-DVD-Image.exe&quot;\n- this is a small utility that will ask you where you want the new image to go, and what file name for the image.\n- it will take a few minutes to make the new image.\n\n\n* Driverpacks included in this release:\n\n\nDP_CardReaders_wnt6-x64_11041\nDP_Chipset_wnt6-x64_1212\nDP_LAN_wnt6-x64_1208\nDP_MassStorage_wnt6-x64_12121\nDP_Misc_wnt6-x64_1202\nDP_Monitors_wnt6-x64_911\nDP_USB3_wnt6-x64_1210\nDP_Webcam_wnt6-x64_1103\nDP_WLAN_wnt6-x64_1203\n\n\n\n\n______________________________\n\n\n** New in this version **\n______________________________\n\n\n* everything is new, this is the 1st version of Winborg 7!\n\n\n______________________________\n\n\n** FAQ **\n______________________________\n\n\nQ: What is this DVD?\nA: It's an unattended Boot and Installation DVD for Windows 7 SP1 Ultimate Edition\n\n\nQ: Do i have to worry about 'validating' this copy of Windows?\nA: No worries mate! If you want to use Windows Update, you can. If the website asks you to validate, go ahead as you will pass their nasty but ineffective test. So have no fear! There is no need to fear submitting to be authenticated at any time.\n\n\nQ: When i reboot the PC, it is asking for a username and password ... what are they?\nA: This happens if you install some of the tweaks available from the apps menu. The username you should use is &quot;Administrator&quot; (without quotes), and the password is blank (ie leave the password field empty). You should create a new profile as soon as possible, because it is not a good idea to use the Administrator account for general use - unless you are an advanced user which means you know what you're doing!\n\n\nQ: So, all these programs that are also available, what do i have to do to use them?\nA: Just choose to install them. Every program in the post-install applications menu has been cracked or was free in the first place. Each title installs silently or unattendedly. No user interaction should be required!\n\n\nQ: Sometimes when i use the Apps Menu, some of the programs seem to hang and the rest of the apps are not installed.\nA: Sorry about this, but sometimes the automation is not entirely right - in very rare situations you may have to abort the current list of apps (use the abort button), reboot, and try again. Its a good idea not to include the problematic app that was hanging until everything else is installed. Then try again. Also, some Anti-Virus programs consider the keygens and patches that are contained on this DVD to be 'Trojans' - the worst culprits are AVG and AVAST. This means they will interfere with the automatic installation routines that require these keygens and patches to be briefly run. If you suspect this may be happening, just de-activate the anti-virus scanners until all apps are installed. You'll just have to trust me that these AREN'T actually trojans!! If you don't believe me, choose ANY OTHER anti-virus program (like NOD32 or Kaspersky) and see if the same things happen. I'll save you some time --- both those apps don't report the same files as AVG does as being bad files.\n\n\n\n\n______________________________\n\n\n** Change log **\n______________________________\n\n\n* This is the first version so nothing to report yet.\n\n\n______________________________\n\n\n** One more thing **\n______________________________\n\n\nCapitalism is a system of exploitation and oppression, so join the revolution already! Seriously, the system is killing us and we can do so much better!!!","torrent":{"xt":"urn:btih:3dd64f168d3578957a08b1030a952594f4e753b1","amp;dn":"Winborg+7+SP1+Ultimate+x64","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dd64f168d3578957a08b1030a952594f4e753b1","infoHashBuffer":{"type":"Buffer","data":[61,214,79,22,141,53,120,149,122,8,177,3,10,149,37,148,244,231,83,177]},"announce":[],"urlList":[]}}