{"title":"(PSX-PSP) Quake II converted properly [ResourceRG Games]","uid":4919082,"size":230438219,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:3dd755a20a93b7d78447e9174d9ae2638178ab27&amp;dn=%28PSX-PSP%29+Quake+II+converted+properly+%5BResourceRG+Games%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"toxicjuggalo","files":2,"time":1243569090,"description":"QUAKE II:\n\nTake on the role of a Special Operations Space Marine as you try to take down the Strogg and save our planet's population. The Strogg are a bunch of vicious cyber-warriors, a processed form of humans and machines. Based on the best-selling PC series of the same name, QUAKE II sends you blasting through 19 levels and six worlds, as you try to make it out of each military base intact. There will be numerous environmental hazards including traps, slime, lava, and radiation but your mission will always be clear, due to the ocular implant you've received. The 10 different weapons you'll use along your adventure range from the regular Blaster to the slightly less regular Chain Guns and Rocket Launchers. Also, keep your eyes peeled for the 14 different items groups floating around out there from health kits to silencers to all sorts of power-ups. The game features a Multiplayer mode, as well as single-player modes like Deathmatch, Frag Team, Flag Wars, and Death Tag, in which you win the game by carrying the flag the longest. With unlimited options, groundbreaking graphics, and an unbeatable storyline, it's no wonder this one's already a classic.\n\n\nTested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS...KloWn","torrent":{"xt":"urn:btih:3dd755a20a93b7d78447e9174d9ae2638178ab27","amp;dn":"%28PSX-PSP%29+Quake+II+converted+properly+%5BResourceRG+Games%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dd755a20a93b7d78447e9174d9ae2638178ab27","infoHashBuffer":{"type":"Buffer","data":[61,215,85,162,10,147,183,215,132,71,233,23,77,154,226,99,129,120,171,39]},"announce":[],"urlList":[]}}