{"title":"Max Mix 1 - Version MegaMix -  [mur3.com].mp3","uid":7009577,"size":15450426,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3e6d2ffc47daaad9b052738d5fb0cdd2cd4fb523&amp;dn=Max+Mix+1+-+Version+MegaMix+-++%5Bmur3.com%5D.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MuR3","files":1,"time":1328398422,"description":"El Max Mix fue innovador en todos los sentidos, ya que ademÃƒÂ¡s de mezclar las canciones entre sÃƒÂ­, se aÃƒÂ±adÃƒÂ­an efectos a las mismas, sin perder la musicalidad. El proceso de grabaciÃƒÂ³n estaba hecho totalmente a mano, es decir, los efectos se hacÃƒÂ­an cortando y empalmando cinta, con lo que la elaboraciÃƒÂ³n era totalmente artesanal. El disco fue todo un ÃƒÂ©xito de ventas, y 6 meses despuÃƒÂ©s saliÃƒÂ³ al mercado su segundo volumen, el Max Mix 2 (El Segundo Megamix EspaÃƒÂ±ol). Este disco entro en el libro Guinness de los RÃƒÂ©cords, ya que tan sÃƒÂ³lo dos semanas despuÃƒÂ©s de ponerse a la venta, habÃƒÂ­a vendido mÃƒÂ¡s de 100.000 copias. Este nuevo volumen superaba con creces a su antecesor, tanto tÃƒÂ©cnica como artÃƒÂ­sticamente, ya que como su autor comentÃƒÂ³ hace poco en una entrevista, tuvo mÃƒÂ¡s libertad creativa que con el primero. En este volumen ya podemos apreciar cortes y efectos mucho mÃƒÂ¡s elaborados. El master original constaba de mÃƒÂ¡s de 620 cortes, y en la actualidad es considerado uno de los mejores megamixes de la historia. DespuÃƒÂ©s de elaborar el Max Mix 2, Mike Platinas y Javier UssÃƒÂ­a marcharon de Max Music, por discrepancias con la direcciÃƒÂ³n. El testigo fue recogido por Toni Peret, JosÃƒÂ© MÃ‚Âª Castells y Andreu Ugas, que permanecerÃƒÂ­an en la compaÃƒÂ±ÃƒÂ­a discogrÃƒÂ¡fica hasta 1997, momento en el cual empezarÃƒÂ­an a trabajar para la reciÃƒÂ©n fundada Vale Music, junto con algunos directivos de Max y antiguos trabajadores de esta).","torrent":{"xt":"urn:btih:3e6d2ffc47daaad9b052738d5fb0cdd2cd4fb523","amp;dn":"Max+Mix+1+-+Version+MegaMix+-++%5Bmur3.com%5D.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e6d2ffc47daaad9b052738d5fb0cdd2cd4fb523","infoHashBuffer":{"type":"Buffer","data":[62,109,47,252,71,218,170,217,176,82,115,141,95,176,205,210,205,79,181,35]},"announce":[],"urlList":[]}}