{"title":"Book History - Selected Articles","uid":8216109,"size":14577962,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e8b5b9b044e3cd913dc5e419e56426e132e83df&amp;dn=Book+History+-+Selected+Articles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1362343641,"description":"This is a selection of articles that appeared in BOOK HISTORY, an academic journal and the official publication of the Society for the History of Authorship, Reading and Publishing. The journal was established in 1998 and is published annually by the Johns Hopkins University Press.\n\nBOOK HISTORY is devoted to every aspect of the history of the book, which is broadly defined as the history of the creation, dissemination, and reception of script and print. It publishes research on the social, economic, and cultural history of authorship, editing, printing, the book arts, publishing, the book trade, periodicals, newspapers, ephemera, copyright, censorship, literary agents, libraries, literary criticism, canon formation, literacy, literary education, reading habits, and reader response.\n\nIn December 1999, the Council of Editors of Learned Journals selected BOOK HISTORY as &quot;Best New Journal&quot; of the year. The awards committee praised its &quot;impressive range&quot; and &quot;sustained engagement with the subject,&quot; and predicted &quot;real staying power on the academic landscape.&quot; In the years since, the journal has fulfilled this early promise and become a well-established and influential leader in its field.\n\nPlease help to seed and enjoy!\n","torrent":{"xt":"urn:btih:3e8b5b9b044e3cd913dc5e419e56426e132e83df","amp;dn":"Book+History+-+Selected+Articles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e8b5b9b044e3cd913dc5e419e56426e132e83df","infoHashBuffer":{"type":"Buffer","data":[62,139,91,155,4,78,60,217,19,220,94,65,158,86,66,110,19,46,131,223]},"announce":[],"urlList":[]}}