{"title":"iPod &amp; iTunes For Dummies (6th edition)","uid":9738542,"size":13810251,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3eb810fb6bee31e8373e3f6f835cc8b1fc6fe0a4&amp;dn=iPod+%26amp%3B+iTunes+For+Dummies+%286th+edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xXGalaxyXx","files":1,"time":1394472790,"description":"Published: 2008-09-29 | ISBN: 047039062X | PDF | 408 pages | 13 MB\n\nHave music, movies, podcasts, contacts, and photos right in your pocket!\nThe iPod and iTunes have revolutionized how we enjoy music, and this bestselling guide has kept up with every twist and turn. Here's how to use the newest iPods, set up iTunes on your Mac or PC, purchase music and movies, rip CDs, organize your media library, make the most of digital sound, keep your calendar and contacts, and so much more!\nLoad it and go - set up iTunes and load your iPod with music, podcasts, audiobooks, movies, even TV shows and photos\nFind your stuff - keep your library organized so you can search, browse, and sort to quickly find what you want \niTunes for everything - use iTunes to synchronize your iPod, iPhone, Apple TV, calendar, and contacts\nFine-tune your tunes - balance the bass or tweak the treble and create your own presets for the way you like to listen\niPod on the move - integrate an iPod with your car stereo or connect your iPod to a portable speaker system for a go-anywhere stereo\nVisit the companion Web site at bonus chapters about earlier iPod models and connections, creating multiple iTunes libraries, using your iPod as a hard drive, and much more!\nOpen the book and find:\nHow to acquire content and set up playlists\nAdvice on adjusting and limiting the volume on your iPod\nSecrets for surfing the Web from your iPod touch\nHow to charge and maintain your battery\nSteps for buying and downloading content from the iTunes Store\nTips for backing up an iTunes library\nHow to play content on your home stereo, TV, or car stereo\nTroubleshooting tips","torrent":{"xt":"urn:btih:3eb810fb6bee31e8373e3f6f835cc8b1fc6fe0a4","amp;dn":"iPod+%26amp%3B+iTunes+For+Dummies+%286th+edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eb810fb6bee31e8373e3f6f835cc8b1fc6fe0a4","infoHashBuffer":{"type":"Buffer","data":[62,184,16,251,107,238,49,232,55,62,63,111,131,92,200,177,252,111,224,164]},"announce":[],"urlList":[]}}