{"title":"The Maid (2005) DVD","uid":6599724,"size":3574431744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3ecea40339b072f38d2a3ba20beceece9c0f2c7d&amp;dn=The+Maid+%282005%29+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"qwerta369","files":-1,"time":1313154996,"description":"&quot;Every year, for thirty days during the lunar seventh month, the Chinese believe that the gates of hell are thrown open. Vengeful spirits or hungry ghosts wander among the living, seeking revenge and justice before the gates of hell are closed again for another year.\\\\\\&quot; The eighteen years old Rosa Dimaano arrives in Singapore from Philippines to give support to her family working as a maid in the house of the artists of a Chinese opera troupe Mr. and Mrs. Teo on the first day of the seventh month of the lunar calendar. She is welcomed by the family and introduced to their friends and their retarded son Ah-Soon. Later, Mrs. Teo advises her about their beliefs and how the dead should be respected and honored along the seventh month. However, Rosa sweeps their offer on the sidewalk breaking a basic rule and offending the spirits, and she is haunted by ghosts everywhere. When Ah-Soon calls her Esther Santos and she finds some belongings of the unknown Esther in the house, she discloses a dark and scary secret about the past of her masters.\n\nRetail DVD.  Single layer.","torrent":{"xt":"urn:btih:3ecea40339b072f38d2a3ba20beceece9c0f2c7d","amp;dn":"The+Maid+%282005%29+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ecea40339b072f38d2a3ba20beceece9c0f2c7d","infoHashBuffer":{"type":"Buffer","data":[62,206,164,3,57,176,114,243,141,42,59,162,11,236,238,206,156,15,44,125]},"announce":[],"urlList":[]}}