{"title":"VFP-07012814 John Cage - Henri Pousseur - Milton Babbitt","uid":3605549,"size":257995518,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3f094a1e0c8a7cd3ac2fed6f354af2689fdc724e&amp;dn=VFP-07012814+John+Cage+-+Henri+Pousseur+-+Milton+Babbitt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"lddtaz","files":8,"time":1170015600,"description":"Vinyl Flac Project VFP-07012802\n\nJOHN CAGE: VARIATIONS II \nMILTON BABBITT: ENSEMBLES FOR SYNTHESIZER\nHENRI POUSSEUR: Trois visages de liege\nProduced by David Behrman\n\n\n\n\nThe Vinyl Flac Project (VFP) is inspired by the Avant Garde Project (AGP) but with the idea of being open to everybody.  Everybody is encouraged to create VFP torrents and start sharing rare vinyl records. \n\nThe twentieth century saw a vast body of music released on vinyl, which was never re-released in a digital format, especially works within the art music genres (classical, avant-garde, experimental, electronic, contemporary, jazz, blues, folk, world, ethnic, marginal progressive rock, early recordings, 78s, wax cylinders and other rarities.)  These records are in danger of being extinct, along with their historical and educational values.  \n\nThe amount of work required to digitize all music is enormous and only an internetwide collaborative effort can save these rarities from extinction.  So start contributing today.  Digitize your rare records before they go bad.  \n\nThe guidelines for VFP are pretty simple:\n1. Each torrent should include a full record (or several), don?t make compilations.\n2. Include a scan of the record cover (front and back) and preferably an OCR scan of the sleeve notes (jpg, txt, pdf, or any other standard format)\n3. Save the files in flac (free lossless audio codec)\n4. files should be tagged \n5. Track name format: track ? artist ? title.flac\n6. Include this text file\n7. In order to maintain a unique designation for each album, assign each VFP release a number in the following manner: YYMMDDHH (Year, Month, Day, Hour with two digits for each, use the 24 hour clock for the hour), for example VFP-07012205 would be the nnumber for a release that was uploaded on 22 Jan 2007 between 5am and 6am (don&amp;#039;t worry aobut time zones)\n8. Include the words ?Vinyl Flac Project&quot; and the release number (VFP 07012205)? in the torrent comments to make searches easy.  Also include some information about the album - the more the better (track list, performers, and this text)\n\n\nThanks for saving the music\n","torrent":{"xt":"urn:btih:3f094a1e0c8a7cd3ac2fed6f354af2689fdc724e","amp;dn":"VFP-07012814+John+Cage+-+Henri+Pousseur+-+Milton+Babbitt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f094a1e0c8a7cd3ac2fed6f354af2689fdc724e","infoHashBuffer":{"type":"Buffer","data":[63,9,74,30,12,138,124,211,172,47,237,111,53,74,242,104,159,220,114,78]},"announce":[],"urlList":[]}}