{"title":"Itty-Bitty Nursery: Sweet Adorable Knits for Baby and beyond","uid":9383983,"size":132383272,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:407700f436b356a6e228319e072a3aeb578619c7&amp;dn=Itty-Bitty+Nursery%3A+Sweet+Adorable+Knits+for+Baby+and+beyond&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KnitLady","files":-1,"time":1387768288,"description":"A feast of gorgeous projects, shown on gorgeous kids in gorgeous photos. At sleep, at play, in the nursery, and on the go, adorable babies need adorable knits. And here are 40 gloriously unique projects that manage to be utterly charming, fabulous, and usable all at the same time. Baby sets and toys; stroller blankets, jackets, and mittens; and a pure and sweet layette are just the tip of the knitting frenzy that is Itty-Bitty Nursery. Picture cute garden mice on an amazing mobile and a knitted clothesline of miniature knitwear adorning the nursery. Coo at the baby sporting a striped hat called &quot;Frenchie&quot; or Mom with her Fruit Loops felted bag. Marvel at the amazing Cupcake Tea Set and the Three Pigs and a Wolf finger puppets, both perfect for the toddler at play. All of the projects are fresh, lively, and fun. With precisely illustrated instructions, there's something here for every level of knitter, from the greenest beginner to the most experienced craftsperson.","torrent":{"xt":"urn:btih:407700f436b356a6e228319e072a3aeb578619c7","amp;dn":"Itty-Bitty+Nursery%3A+Sweet+Adorable+Knits+for+Baby+and+beyond","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"407700f436b356a6e228319e072a3aeb578619c7","infoHashBuffer":{"type":"Buffer","data":[64,119,0,244,54,179,86,166,226,40,49,158,7,42,58,235,87,134,25,199]},"announce":[],"urlList":[]}}