{"title":"Edvard Radzinsky - Stalin (664pgs).pdf","uid":4759079,"size":4587400,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:413eb0a39e1249fa34e8f76f22e9f703eb1edb7f&amp;dn=Edvard+Radzinsky+-+Stalin+%28664pgs%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Djofullinn","files":1,"time":1236623200,"description":"Stalin \nThe First In-Depth Biography Based on Explosive New Documents from Russia's Secret Archives \nBy Edvard Radzinsky \nTranslated by H.T. Willetts\nChapter One\n\n&quot;Look at the map. You will see that the Caucasus is the center of the world. &quot; -- An English traveler\n\nSoso's town \nIt is 1878. The little Georgian town of Gori, birthplace of Joseph (Iosif) Dzhugashvili, slumbers against a background of distant mountains.\n\nSoso, his mother called him, Georgian fashion.\n\nMaxim Gorky, who was to be Stalin's favorite writer, wandering around the Caucasus at the end of the nineteenth century, described Gori as follows:\n\nGori, a town at the mouth of the river Kura, quite small, no bigger than a fair-sized village. There is a high hill in the middle of it. On the hill stands a fortress. The whole place has a picturesque wildness all its own. The sultry sky over the town, the noisy, turbulent waters of the Kura, mountains in the near distance, with their &quot;City of Caves,&quot; and farther away the Caucasus range, with its sprinkling of snow that never melts.\n\nThis sets the scene in which our hero's life begins. An ominous note is introduced into this idyllic landscape by the grim ruins looking down on the town from a steep cliff--the ruins of the castle from which Georgian feudal princes once ruled that region and waged bloody war on the Georgian kings.\n\nWe cross the bridge over the Kura into the little town. Gori wakes at sunrise, before the burning heat sets in. Herdsmen go from yard to yard to collect the cows. Sleepy people sit on little balconies. Church doors are unlocked and old women in black hurry to the morning service. Rafts speed down the boisterous Kura. Listless water carriers follow the movements of the daring raftsmen as they fill the leather bottles which they will then carry from house to house on the backs of their skinny nags. ...\n &lt;a href=&quot;\nhttp://www.washingtonpost.com/wp-srv/style/longterm/books/chap1/stalin.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.washingtonpost.com/wp-srv/style/longterm/books/chap1/stalin.htm&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:413eb0a39e1249fa34e8f76f22e9f703eb1edb7f","amp;dn":"Edvard+Radzinsky+-+Stalin+%28664pgs%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"413eb0a39e1249fa34e8f76f22e9f703eb1edb7f","infoHashBuffer":{"type":"Buffer","data":[65,62,176,163,158,18,73,250,52,232,247,111,34,233,247,3,235,30,219,127]},"announce":[],"urlList":[]}}