{"title":"Kyell Gold - The Prisoner's Release and Other Stories [Gay Adul","uid":6319911,"size":10743703,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:414bbe3b8afae368155658d925ccef99ddf2638a&amp;dn=Kyell+Gold+-+The+Prisoner%5C%27s+Release+and+Other+Stories+%5BGay+Adul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smexyfox","files":1,"time":1302916623,"description":"This collection brings together the two-part short story which originally appeared in Heat #1 and Heat #2 -- &quot;The Prisoner's Release&quot; -- with three entirely new tales set in the world of Argaea.\n\n* &quot;Inside the Cage&quot; takes place at the Jackal's Staff where a young cougar seeks to escape his life of prostitution.\n\n* &quot;The Prisoner's Release&quot; previously appeared in Heat #1 and Heat #2 and tells the story of how Volle met Streak. \n\n* &quot;Home Again&quot; picks up just after &quot;The Prisoner's Release&quot; when Volle and Streak have returned Ferrenis and fills in some details leading up to their ill-fated return to Tephos in &quot;Pendant of Fortune.&quot;\n\n* Finally we return to the Jackal's Staff in &quot;For Love or Family&quot;, this time through the eyes of a patron trying to balance the way he feels against the duties of his station.\n\nKyell Gold's Argaea stories lie at the intersection of medieval adventure and gay romance. Though long billed as a writer of furry erotica (and fans thereof will not be disappointed), Gold's stories are also much more; as the characters try to make their way in the world, they frequently grapple with issues of identity, duty, and the meaning of love. \n\n&quot;The Prisoner's Release and Other Stories&quot; picks up loosely where &quot;Volle&quot; left off, but it is more of a companion piece than a true sequel (that's reserved for &quot;Pendant of Fortune&quot;), and it can stand on its own. Somewhat over half the book is devoted to characters from the Jackal's Staff brothel, and explores the line between sex and love that is highlighted by prostitution. &quot;Inside The Cage&quot; is the longest story, and it is devoted primarily to the hardships of a cougar who has never known a different life. &quot;For Love or Family&quot; tells the converse of that story, from the perspective of a naive patron who soon finds himself too deeply involved. \nThe other two stories follow Volle the vulpine spy, and &quot;The Prisoner's Release&quot; in particular is a must-read. The extreme circumstances under which Volle and Streak meet lend a very visceral effect to the story, and by the end one is genuinely elated at Volle's escape. &quot;Home Again&quot; is much calmer, but still quite sexy and leads into &quot;Pendant of Fortune&quot; well. \n\nThe Prisoner's Release is a romance novel intended for an adult audience only and contains some explicit sexual scenes of a primarily Male/Male nature. It is not for persons under the age of 18.\n\nPublisher: Sofawolf Press \nLanguage: English\nISBN 0-9769212-7-8","torrent":{"xt":"urn:btih:414bbe3b8afae368155658d925ccef99ddf2638a","amp;dn":"Kyell+Gold+-+The+Prisoner%5C%27s+Release+and+Other+Stories+%5BGay+Adul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"414bbe3b8afae368155658d925ccef99ddf2638a","infoHashBuffer":{"type":"Buffer","data":[65,75,190,59,138,250,227,104,21,86,88,217,37,204,239,153,221,242,99,138]},"announce":[],"urlList":[]}}