{"title":"Responsive Web Design by Example","uid":8854061,"size":4572013,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4195faa13437241dbc92a8a823f71aa317d04bd2&amp;dn=Responsive+Web+Design+by+Example&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sigor10","files":-1,"time":1377604497,"description":"Responsive Web Design by Example By Thoriq Firdaus\n\n2013 | 338 Pages | ISBN: 1849695423\n\nResponsive web design is an explosive area of growth in modern web development due to the huge volume of different device sizes and resolutions that are now commercially available. You can now create your very own responsive website quickly and efficiently, allowing you to showcase your content in a format that will work on any device with an Internet browser.\n\nBy following our detailed step-by-step instructions in this structured reference guide, you will learn how you can build engaging responsive websites. With coverage of Bootstrap, Skeleton, and Zurb Foundation you'll learn about three of the most powerful responsive frameworks available today.\n\nLeading you through by practical example, you'll find that this essential reference develops your understanding by actually helping you create beautiful websites step by step in front of your very eyes. After going over the basics, you'll be able to choose between creating your own responsive portfolio page with Skeleton, building a stunning product page with Bootstrap, or setting up your own professional business website with Zurb Foundation. Ultimately you'll learn how to decide which framework is right for you, and how you can deploy and customize it to your exact specifications!\n","torrent":{"xt":"urn:btih:4195faa13437241dbc92a8a823f71aa317d04bd2","amp;dn":"Responsive+Web+Design+by+Example","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4195faa13437241dbc92a8a823f71aa317d04bd2","infoHashBuffer":{"type":"Buffer","data":[65,149,250,161,52,55,36,29,188,146,168,168,35,247,26,163,23,208,75,210]},"announce":[],"urlList":[]}}