{"title":"Walker Percy - The Message in the Bottle (pdf)","uid":8564778,"size":2667650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41fcb463ede56869529bcb64261a952f63e95941&amp;dn=Walker+Percy+-+The+Message+in+the+Bottle+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"pharmakate","files":-1,"time":1370975687,"description":"Walker Percy - The Message in the Bottle: How Queer Man Is, How Queer Language Is, and What One Has to Do with the Other (Farrar, Straus and Giroux, 1975). 335 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nWalker Percy is best known for his novels, but this is a collection of philosophical essays. I've always thought Percy's ideas about the nature of language completely destroy any possibility that computers will ever be able to think as humans do: the singularity is not near.\n\ndescription:\n\nIn The Message in the Bottle, Walker Percy asks a hard question: Why is it that modern people - so educated, so prosperous - are so unhappy and ill at ease in the world? To answer it, he turns to such various yet interconnected subjects as symbolic reasoning, the origins of mankind, the nature of tourism, and the incredible Delta Factor, in which he explains how language is at the heart of human personality. Confronting philosophical quandaries with a novelist's eye, Percy rewards us again and again with insights into the way that language possesses us all.","torrent":{"xt":"urn:btih:41fcb463ede56869529bcb64261a952f63e95941","amp;dn":"Walker+Percy+-+The+Message+in+the+Bottle+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41fcb463ede56869529bcb64261a952f63e95941","infoHashBuffer":{"type":"Buffer","data":[65,252,180,99,237,229,104,105,82,155,203,100,38,26,149,47,99,233,89,65]},"announce":[],"urlList":[]}}