{"title":"[BKD-43] Mother And Son Mating XXX 480p Misato Aoki","uid":9949743,"size":1238207052,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:42dca78f38a69d036a31c004fbe8f49a05acb101&amp;dn=%5BBKD-43%5D+Mother+And+Son+Mating+XXX+480p+Misato+Aoki&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"makintos13","files":2,"time":1397379381,"description":"\nMisato plays a mother who has an affair with her son during a weekend retreat.\n\nScene 1: While in the car on the way to the retreat, Misato and son begin kissing. She pulls down his pants and gives him oral pleasuring including some rimming action. She continues to suck and jerk him off until he cums in her mouth.\n\nScene 2: Now at the retreat, she exposes her breasts for him to fondle and suck. He then performs cunnilingus and she returns the favor with a blowjob. This ends up in a 69 where Misato also shows her rimming skills once again. They then fuck in a number of positions until he cums on her stomach.\n\nScene 3: They are taking a bath when kissing leads to blowjob action along with some hand work. She then washes his hair and body and he returns the favor by soaping her up a bit. They both head to the shower to rinse off where the kissing and handjob action continues.\n\nScene 4: They are now relaxing and Misato is cleaning his ears. She then makes a phone call (to her husband) while the son licks and fondles her breasts. She hands the phone to him and while he talks she gets him excited by playing with his nipples. After she hangs up she pushes her son down and begins kissing and licking him. He then does the same. Soon she is sitting on his face while her performs cunnilingus. She then licks his legs and feet and he soon plays with her breasts with his foot. Misato then jerks him off while rimming him. A 69 follows which leads to intercourse. They fuck in a few positions until she is creampied.\n\nScreens:\n &lt;a href=&quot;\nhttp://imgfun.biz/img-534a33aca4935.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfun.biz/img-534a33aca4935.html&lt;/a&gt;","torrent":{"xt":"urn:btih:42dca78f38a69d036a31c004fbe8f49a05acb101","amp;dn":"%5BBKD-43%5D+Mother+And+Son+Mating+XXX+480p+Misato+Aoki","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42dca78f38a69d036a31c004fbe8f49a05acb101","infoHashBuffer":{"type":"Buffer","data":[66,220,167,143,56,166,157,3,106,49,192,4,251,232,244,154,5,172,177,1]},"announce":[],"urlList":[]}}