{"title":"Age Of Wind 2 Android","uid":6740271,"size":23689504,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:4349d2b4058111d49f20436ee132de9a3f3f9327&amp;dn=Age+Of+Wind+2+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":-1,"time":1318477368,"description":"Age Of Wind 2 2.8 (v2.8) Android Apk Game | 22.59 MB\nRequirements: Android OS 2.2 - 2.3\nOverview: Get ready for exciting adventures on the sea full of dangers and opportunities!\n\n\nGet ready for captivating adventures in the sea full of dangers and possibilities. Become a sailing-ship captain! Discover new islands, win nautical battles, trade exotic goods without forgetting about searching for the main treasure.\n\nNotes: \nA large fleet cannot be conquered just with powerful weapons - it's very important to actively maneuver, evading enemy shots. \nIn order to make an exact shot you have to turn with your side to the opponent and press anywhere on the screen. At the same time it's important to help the opponent to shoot your ship.\n\nDuring the battle the ship almost always gets damaged. This is the tough truth of life. The damages do not impact the nautical qualities of the ship, but they can lead to the ship's wreakage. Therefore, you have to watch to make sure the ship is always well-repaired. You can repair the ship in any closest post, not for free, of course.\n\nA good ship costs a lot. You can make enough for it using two means: \n\nYou can rob caravans. You can sell the robbed goods at the closest island. \n\nYou can engage in peaceful trade. The price for the goods on different islands is quite a lot different. That is why most of the time peaceful trading is quite a lot more profitable than robberies.\n\nYou start the game on the easiest ship. The ship has few cannons and a small hold - it is bad for either trade or for war. Fortunately, there is a vast choice of more advanced ships on the island. You can buy them all, if you have a high enough level and enough money for it. When buying a ship pay attention to the ship's speed, the number of cannons and the hold size.\n\nBesides, you don't have to buy a new ship, but you can improve the existing ship. There are three options for the improvement: \n\nCannons - increases the shooting range and the speed of recharge\nArmor - decreases the opponent's chances to damage the ship's frame. \nSails - increases the speed and agility of the ship\n\nControl: \n- To turn the ship - tilt iphone in the right direction. \n- To shoot - tap anywhere on the screen. \n- To see a map - tap on the compass.\n\nFeatures include: \n- 17 unique ships; \n- 21 unique islands; \n- 100 unique battles; \n- a world full of dangers and adventures;\n","torrent":{"xt":"urn:btih:4349d2b4058111d49f20436ee132de9a3f3f9327","amp;dn":"Age+Of+Wind+2+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4349d2b4058111d49f20436ee132de9a3f3f9327","infoHashBuffer":{"type":"Buffer","data":[67,73,210,180,5,129,17,212,159,32,67,110,225,50,222,154,63,63,147,39]},"announce":[],"urlList":[]}}