{"title":"Gunter Otto - Josefine Mutzenbacher (Wie Sie Wirklich War","uid":12530478,"size":733655040,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:43e1a9de4c334d6118415b36d6772e24330b0380&amp;dn=Gunter+Otto+-+Josefine+Mutzenbacher+%28Wie+Sie+Wirklich+War&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"feeldabyte","files":3,"time":1444244296,"description":"Gunter Otto - Josefine Mutzenbacher (Wie Sie Wirklich War Teil 2) XXX DVDRip [.avi]\r\n\r\n\r\nScreens &amp; Info :\r\n\r\n----------------------------------\r\n \nhttp://imgkiss.com/image/fWok9 \nhttp://imgkiss.com/image/fW2P8\r\n\r\n----------------------------------\r\n\r\nPerformers: Jane Iwanoff, Karine Gambier, Leila Vigso, Marion Brandmeier, Sylvia Engelmann\r\n\r\nIn 1906 the first Josephine Mutzenbacher book was published and immediately banned, ensuring a huge, under the counter distribution in all German speaking countries. The book was believed to have been written by Felix Salten a renown theatre critic.\r\nPart two was originally written in 1917 and still ranks with the highest selling erotic art/literature and has legendary status. That's a long time to be popular! Imagine how much sperm has been spilled over the decades in her name.\r\nProstitute Josephine Muntzenbacher, played by a beautiful, tall, young girl, cheerfully narrates her great sexual adventure.\r\nDiving straight into the business of the day, Josephine recounts her non-stop sexual experiences. We follow from her wonderment at the discovery of 'man-milk' to her realisation that her pussy is worth gold. Every man who crosses her path feels her seductive hand.\r\nThe numerous sex scenes include: an excessively overweight barmaid is laid back and exposed, whereupon a skinny little man is lifted into penetration position and lifted up and down until he cums! In another, an incredible under-table orgy is followed by a truly outrageous table top group tumble.\r\nWhen her boyfriend finds her and a girl friend enjoying the fresh meat of the butcher boy, he throws her out and Josefine's life as a whore takes off in ernest.\r\nUnfortunately she falls into the hands of a pimp, but is rescued by a handsome Hungarian cavalryman with whom she falls in love. The officer accepts a challenge to ride 3 miles, fuck 3 women and drink 3 quarts of vodka in 3 hours. To complete the crazy tasks on time, having sex in his horse's saddle is necessary. Needless to say the after party is an extremely debaucherous affair.\r\nThe enterprising Ms Mutzenbacher returns to Vienna and opens her own opulent brothel, where she has her choice of the men.\r\nIf you want something quite different – a change from hard anal, endless gonzo and are charmed by a really good yarn, buy this classic show.\r\n\r\nSail to another one :\r\n \nhttps://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:43e1a9de4c334d6118415b36d6772e24330b0380","amp;dn":"Gunter+Otto+-+Josefine+Mutzenbacher+%28Wie+Sie+Wirklich+War","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43e1a9de4c334d6118415b36d6772e24330b0380","infoHashBuffer":{"type":"Buffer","data":[67,225,169,222,76,51,77,97,24,65,91,54,214,119,46,36,51,11,3,128]},"announce":[],"urlList":[]}}