{"title":"UltraSexyHeroines Siterip by Tidosho - July 2010","uid":6056749,"size":1005905243,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:461b81efade7471b585f3807fe38249133b46b09&amp;dn=UltraSexyHeroines+Siterip+by+Tidosho+-+July+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Tidosho","files":-1,"time":1292940271,"description":"This is the FIXED version of my UltraSexyHeroines July 2010 torrent. This is the one you SHOULD download!! :) I had to delete the other, sorry to those downloading it :(\n\n--------------------------------------------------------------------------------\n\nThis is the latest UltraSexyHeroines.com site rip torrent available. I did this in July 2010. It contains 3 videos, and 144 photosets, all of sexy (when they've not got fake tits and Tango suntan on!) glamour models in tight spandex superheroine outfits, such as Supergirl, Wonder Woman, Scorpion, Dark Star, stripping off going topless. \n\nI decided to share my latest site rip because I'm sick of Jon, the guy who now owns UltraSexyHeroines.com as well as SuperSexyHeroines.com. He ignores comments and complaint emails, deleting comments from his blog, making promises he cannot deliver because he has a full time job as well as doing SuperSexyHeroines, and trying to take over sites that are competition to his. USH used to be separate, run by a friend of his, apparently, which he then coincidentally took over. It is now the sister site to SuperSexyHeroines, where it is all non-nude.\n\nUpdates on USH are very sparse, poor quality, and has a lot of &quot;glamour model&quot; women so insecure they have fake tits and fake tan, which is offputting to me once they take the outfit past their chests taking them off, fake tits is a huge turn off personally. There are a lot of real cute women in here though, far outsurpassing the fakey ones. And on SuperSexyHeroines Jon is more obsessed with making comic strips with amateur fake effects, than the actual photoshoots that his users keep telling him they prefer. \n\nSo, save your money, and download this rip. I got sick of paying Ã‚Â£15 a month to both sites for the little they were putting out, and decided to help save fellow superheroine fans some wonga! When he gets Lucy Pinder and Michelle Marsh in, then I'll start paying again!! They are real ladies with real big breasts.\n\nSome of the girls are natural-breasted, and really hot in the outfits, I wish I could have them in my bedroom at night. If you're revolted by fake tits as I am, just ignore the sets with fakies in, I put them in for fake lovers.\n\nTorrent Type: Pictures/Video\n\nNo. Of Sets: 144\n\nNo Of Videos: 3\n\nTorrent Size: 988MB\n\nContent: Glamour, Spandex/Latex/PVC Superheroine outfits, toplessness\n\nWARNING: Contains TOPLESS imagery. If you are OFFENDED by topless women, DO NOT download, or report it and spoil it for the people who do.\n\nWARNING 2: You'll need WinRAR to open the photoset zip files. You can also use Universal Extractor and TUGZip, two FREE alternatives.\n\nFull Size Preview Image: \n  &lt;a href=&quot;\nhttp://bayimg.com/IAbLAAadi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/IAbLAAadi&lt;/a&gt;","torrent":{"xt":"urn:btih:461b81efade7471b585f3807fe38249133b46b09","amp;dn":"UltraSexyHeroines+Siterip+by+Tidosho+-+July+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"461b81efade7471b585f3807fe38249133b46b09","infoHashBuffer":{"type":"Buffer","data":[70,27,129,239,173,231,71,27,88,95,56,7,254,56,36,145,51,180,107,9]},"announce":[],"urlList":[]}}