{"title":"Call of Duty 4 - Modern Warefare - Unlocked PDF","uid":4247343,"size":51767817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48549e1cac35132710b1faf799ed47a1729ac5a7&amp;dn=Call+of+Duty+4+-+Modern+Warefare+-+Unlocked+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ViciousOne","files":1,"time":1213843388,"description":"This is COD4 - Modern Warefare.  The PDF is unlocked so you can PRINT!!!  :)\n\nIntroduction\n\nGet ready for one of the most exciting game experiences of your life! Call of Duty 4: Modern Warfare immerses the player in a contemporary war zone with non-stop action, insane scenarios, and realistic enemies. It's the near future and a group of Russian soldiers is staging a full-scale coup to gain control of the country's nuclear arsenal. Meanwhile, in the Middle East, a leader by the name of Al- Asad has emerged. He is staging a coup to obtain control of his homeland and, with it, an entire army.\n\nU.S., British, and Russian forces must once again answer the Call of Duty when the two groups link up to pose a threat that could result in full-scale nuclear war.\nIn Call of Duty 4: Modern Warfare, you play as a newly recruited member of the British Spec Ops and a U.S. Forces Sergeant working on different fronts to stop these groups before they can impose their will on the world.\n\nThis strategy guide illustrates how to get through the most difficult parts of the Single Player campaign and provides a ton of tips, tactics, maps and stats for the Multiplayer game. If this is your first Call of Duty game, you should start off with the game basics chapter Gearing Up for the Call before diving into the walkthrough. A lot has changed since Call of Duty 3; in fact, sixty years of military warfare! Even if you have played previous Call of Duty games, you may want to freshen up on what's new.\n","torrent":{"xt":"urn:btih:48549e1cac35132710b1faf799ed47a1729ac5a7","amp;dn":"Call+of+Duty+4+-+Modern+Warefare+-+Unlocked+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48549e1cac35132710b1faf799ed47a1729ac5a7","infoHashBuffer":{"type":"Buffer","data":[72,84,158,28,172,53,19,39,16,177,250,247,153,237,71,161,114,154,197,167]},"announce":[],"urlList":[]}}