{"title":"Handbook of Optofluidics","uid":8078121,"size":13080981,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4892738db345fe265454a91e3b3e294a26211a33&amp;dn=Handbook+of+Optofluidics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1359429986,"description":"Aaron R. Hawkins, Holger Schmidt, &quot;Handbook of Optofluidics&quot;\n2010 | ISBN: 1420093541 | 664 pages | PDF | 12,4 MB\n\nOptofluidics is an emerging field that involves the use of fluids to modify optical properties and the use of optical devices to detect flowing media. Ultimately, its value is highly dependent on the successful integration of photonic integrated circuits with microfluidic or nanofluidic systems. Handbook of Optofluidics provides a snapshot of the state of the field, captures current trends, and gives insight into the technology of tomorrow, which will enable researchers to tackle challenges and opportunities that it can uniquely answer.\n\nDivided into three sections, this comprehensive resource begins by introducing the scientific foundations that contribute to optofluidics. It details the connections to related research areas and reveals the scientific influences currently shaping the design and function of optofluidic systems. It provides brief reviews of those established fields from which optofluidics has evolved, putting special emphasis on how they currently intersect.","torrent":{"xt":"urn:btih:4892738db345fe265454a91e3b3e294a26211a33","amp;dn":"Handbook+of+Optofluidics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4892738db345fe265454a91e3b3e294a26211a33","infoHashBuffer":{"type":"Buffer","data":[72,146,115,141,179,69,254,38,84,84,169,30,59,62,41,74,38,33,26,51]},"announce":[],"urlList":[]}}