{"title":"Hidden Secrets - Part 49 - Revelation - Chuck Smith","uid":12242985,"size":12010913470,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a667aa4c37b034bfaf32a29d7f395f7b3f7658c&amp;dn=+Hidden+Secrets+-+Part+49+-+Revelation+-+Chuck+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":116,"time":1439828535,"description":"  Hidden Secrets - Part 49 - Revelation - Chuck Smith\n\n\nCharles Ward &quot;Chuck&quot; Smith (June 25, 1927 - October 3, 2013) was an American pastor who founded the Calvary Chapel movement. Beginning with the 25-person Costa Mesa congregation in 1965, Smith's influence now extends to thousands of congregations worldwide, some of which are among the largest churches in the United States. He has been called &quot;one of the most influential figures in modern American Christianity.&quot;\n\nSmith graduated from LIFE Bible College and was ordained as a pastor for the International Church of the Foursquare Gospel. In the late 1950s, Smith was the campaign manager and worship director for healing evangelist Paul Cain. After being a pastor for a different denomination, he left his denomination to pastor a non-denominational church plant in Corona, California, and eventually moved to a small pre-existing church called Calvary Chapel in Costa Mesa, California in December 1965.\n\nChuck Smith is the author and co-author of several books; titles of his books include Answers for Today; Calvary Chapel Distinctives; Calvinism, Arminianism &amp; The Word of God; Charisma vs. Charismania; Comfort for Those Who Mourn; Effective Prayer Life; Harvest; Living Water; The Claims of Christ; The Gospel According to Grace; The Philosophy of Ministry of Calvary Chapel; Why Grace Changes Everything; Love: The More Excellent Way; The Final Act; and others","torrent":{"xt":"urn:btih:4a667aa4c37b034bfaf32a29d7f395f7b3f7658c","amp;dn":"+Hidden+Secrets+-+Part+49+-+Revelation+-+Chuck+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a667aa4c37b034bfaf32a29d7f395f7b3f7658c","infoHashBuffer":{"type":"Buffer","data":[74,102,122,164,195,123,3,75,250,243,42,41,215,243,149,247,179,247,101,140]},"announce":[],"urlList":[]}}