{"title":"The Stooges - Fun House [SHM-CD Japan, 2009] FLAC","uid":8595502,"size":381666507,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4b8743228df5d3b81d073d2f451645e5632cbdb3&amp;dn=The+Stooges+-+Fun+House+%5BSHM-CD+Japan%2C+2009%5D+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":14,"time":1371750440,"description":"The Stooges - Fun House (1970) [SHM-CD]\nXLD | FLAC-IMG+CUE+LOG &gt;  MB | Scans | \n2009 / 36:40 mins / Japanese Mini-LP Remastered SHM-CD # WPCR-13730\n\nFun House is the second album by the American rock band The Stooges. It was recorded in May 1970 and released in July of the same year. Like its predecessor, The Stooges (1969), Fun House did not sell well. In subsequent years, however, it has been cited as very influential on later musicians, notably in punk rock. In 2007, the album was voted Loudest Album Ever by Q Magazine.\n\n\nThe Stooges' first album was produced by a classically trained composer; their second was supervised by the former keyboard player with the Kingsmen, and if that didn't make all the difference, it at least indicates why Fun House was a step in the right direction. Producer Don Gallucci took the approach that the Stooges were a powerhouse live band, and their best bet was to recreate the band's live set with as little fuss as possible. As a result, the production on Fun House bears some resemblance to the Kingsmen's version of &quot;Louie Louie&quot; -- the sound is smeary and bleeds all over the place, but it packs the low-tech wallop of a concert pumped through a big PA, bursting with energy and immediacy. The Stooges were also a much stronger band this time out; Ron Asheton's blazing minimalist guitar gained little in the way of technique since The Stooges, but his confidence had grown by a quantum leap as he summoned forth the sounds that would make him the hero of proto-punk guitarists everywhere, and the brutal pound of drummer Scott Asheton and bassist Dave Alexander had grown to heavyweight champion status. And Fun House is where Iggy Pop's mad genius first reached its full flower; what was a sneer on the band's debut had grown into the roar of a caged animal desperate for release, and his rants were far more passionate and compelling than what he had served up before. The Stooges may have had more &quot;hits,&quot; but Fun House has stronger songs, including the garage raver to end all garage ravers in &quot;Loose,&quot; the primal scream of &quot;1970,&quot; and the apocalyptic anarchy of &quot;L.A. Blues.&quot; Fun House is the ideal document of the Stooges at their raw, sweaty, howling peak.\n\n-- Review by Mark Deming, allmusic com\n\n\nTracklist:\n\n01. Down On The Street\n02. Loose\n03. T.V. Eye\n04. Dirt\n05. 1970\n06. Fun House\n07. L.A. Blues\n\nOriginally Produced by Don Gallucci.\n\n- Iggy Pop - vocals\n- Dave Alexander - bass\n- Ron Asheton - guitar\n- Scott Asheton - drums\n+ Steve Mackay - saxophone\n+ Don Gallucci - organ overdubs.\n\nCardboard sleeve reissue from Iggy Pop &amp; The Stooges featuring the high-fidelity SHM-CD format and the 2005 remastering. Part of a two-album Iggy Pop &amp; The Stooges SHM-CD cardboard sleeve reissue series featuring albums &quot;The Stooges&quot; and &quot;Fun House.&quot;\n\nJapanese Cardboard Sleeve SHM-CD Limited Reissue.\nPressed in 2009 by Warner Music Japan.\nAll thanks goes to the original ripper!","torrent":{"xt":"urn:btih:4b8743228df5d3b81d073d2f451645e5632cbdb3","amp;dn":"The+Stooges+-+Fun+House+%5BSHM-CD+Japan%2C+2009%5D+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b8743228df5d3b81d073d2f451645e5632cbdb3","infoHashBuffer":{"type":"Buffer","data":[75,135,67,34,141,245,211,184,29,7,61,47,69,22,69,229,99,44,189,179]},"announce":[],"urlList":[]}}