{"title":"Stargate Universe /2010/DVD 2/DD 5.1/NL Subs","uid":5382703,"size":4470970368,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4ce8677c128ccae920d25d014727ab61787c4d9e&amp;dn=Stargate+Universe+%2F2010%2FDVD+2%2FDD+5.1%2FNL+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NLUPPER","files":22,"time":1266790605,"description":"Stargate Universe DVD 1\n\nPLOT\n\nSyfy Stargate Universe's newest series follows a group of sailors, scientists and citizens who must defend against an attack when their secret base is detected.\nThey are forced to evacuren through the Star Gate. The survivors are desperate to board an old vessel that follows a preset rate and the survivors can not return to Earth.\nFaced with the shortage of the most basic needs like food, water and air, the group of the secrets of the Stargate to explore ship to survive.\nThe danger, the adventure and the hope that they find on board the Destiny, will reveal who the heroes and who the enemies are.\nWhat begins as a simple reconnaissance mission turns into a mission without end,\nwhen the Universe crew discovers the ship no longer can return to Earth and that they will have to maintain themselves aboard the Destiny.\nThe crew will be the farthest corners of the universe travel and connect to previously installed Star Gates that centuries before the launch of the destiny placed,\nand the crew has no control over the navigation scheme of the ship, if anyone is left behind,\nthere is no way back for them, there are new species discovered, they encounter new enemies and experience new adventures.\n\nVerhaal\n\nSyfy's nieuwste serie Stargate Universe volgt een groep mariniers, burgers en wetenschappers die zich moeten verdedigen tegen een aanval wanneer hun geheime basis ontdekt wordt.\nZe zijn gedwongen zich te evacuren via de Stargate. De wanhopige overlevenden komen aan boord van een oud schip dat een vooraf ingestelde koers volgt en de overlevenden kunnen niet terugkeren naar de Aarde.\nGeconfronteerd met het tekort van de meest basisbehoeften zoals voedsel, water en lucht, moet de groep de geheimen van Stargate van het schip ontdekken om te overleven.\nHet gevaar, het avontuur en de hoop die zij aan boord van de Destiny vinden, zal onthullen wie de helden en wie de vijanden zijn.\nWat begint als een simpele verkenningsmissie verandert in een missie zonder einde,\nwanneer de Universe bemanning ontdekt dat het schip niet meer naar de Aarde kan terugkeren en dat ze zichzelf zullen moeten handhaven aan boord van de Destiny.\nDe bemanning zal naar de verste uithoeken van het universum reizen en verbinding zoeken met eerder geÃƒÂ¯nstalleerde Stargates die eeuwen voor de lancering van de destiny geplaatst zijn,\nen de bemanning heeft geen controle over het navigatieschema van het schip, als er iemand wordt achtergelaten,\nis er geen weg terug voor hen, er worden nieuwe rassen ontdekt, ze ontmoeten nieuwe vijanden en beleven nieuwe avonturen.\n\nDVD1\nafleveringen\n101.  Air 1\n102.  Air 2\n103.  Air 3\n104.  Darkness\n\n\nDVD2\nafleveringen\n105 Light \n106 Water\n107 Earth\n108 Time\n\n\n\n\n- Categorie : Beeld\n- Formaat : DVD5\n- Bron : TV\n- Audio : Dolby Digital 5.1\n- Ondertitels : Nederlands\n\nWEBLINK:   &lt;a href=&quot; http://stargate.mgm.com/view/series/3/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://stargate.mgm.com/view/series/3/index.html&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:4ce8677c128ccae920d25d014727ab61787c4d9e","amp;dn":"Stargate+Universe+%2F2010%2FDVD+2%2FDD+5.1%2FNL+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ce8677c128ccae920d25d014727ab61787c4d9e","infoHashBuffer":{"type":"Buffer","data":[76,232,103,124,18,140,202,233,32,210,93,1,71,39,171,97,120,124,77,158]},"announce":[],"urlList":[]}}