{"title":"America's Founding Food - 1st Edition (2004).pdf Gooner","uid":12916263,"size":3748018,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4dce4723aa49d958960e28ffd1ae30b72dd02235&amp;dn=America%27s+Founding+Food+-+1st+Edition+%282004%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1449349528,"description":"America's Founding Food - The Story of New England Cooking - 1st Edition (2004).pdf Gooner\r\n\r\nPublisher: The University of North Carolina Press; 1st edition (November 1, 2004)\r\nLanguage: English\r\nISBN-10: 0807828947\r\nISBN-13: 978-0807828946\r\n\r\nFrom baked beans to apple cider, from clam chowder to pumpkin pie, Keith Stavely and Kathleen Fitzgerald's culinary history reveals the complex and colorful origins of New England foods and cookery. Featuring hosts of stories and recipes derived from generations of New Englanders of diverse backgrounds, America's Founding Food chronicles the region's cuisine, from the English settlers' first encounter with Indian corn in the early seventeenth century to the nostalgic marketing of New England dishes in the first half of the twentieth century.\r\n\r\nFocusing on the traditional foods of the region--including beans, pumpkins, seafood, meats, baked goods, and beverages such as cider and rum--the authors show how New Englanders procured, preserved, and prepared their sustaining dishes. Placing the New England culinary experience in the broader context of British and American history and culture, Stavely and Fitzgerald demonstrate the importance of New England's foods to the formation of American identity, while dispelling some of the myths arising from patriotic sentiment. \r\n\r\nAt once a sharp assessment and a savory recollection, America's Founding Food sets out the rich story of the American dinner table and provides a new way to appreciate American history","torrent":{"xt":"urn:btih:4dce4723aa49d958960e28ffd1ae30b72dd02235","amp;dn":"America%27s+Founding+Food+-+1st+Edition+%282004%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dce4723aa49d958960e28ffd1ae30b72dd02235","infoHashBuffer":{"type":"Buffer","data":[77,206,71,35,170,73,217,88,150,14,40,255,209,174,48,183,45,208,34,53]},"announce":[],"urlList":[]}}