{"title":"Thai Testicle Massage - English Subtitled! [.mp4]","uid":12198960,"size":1440263620,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4e75314daef43f926bd5b3ecc024d3c677a8927b&amp;dn=Thai+Testicle+Massage+-+English+Subtitled%21+%5B.mp4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pornboy89","files":8,"time":1438795387,"description":".......:::Screenshots:::.......\n &lt;a href=&quot;\nhttp://imgnemo.com/?g=174503&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?g=174503&lt;/a&gt;\n\nDescription:\n\nAlthough Thailand may nowadays have a synonymous association with being a land of cheap thrills and one night stands with nameless dark-haired beauties (with some having extra equipment down south for further pleasure) for the exchange of hard-earned bhats, it also is known for a land that has perfected the art of the massage. Thai massage is unique in that rather than focusing on heavy oiled rubbing motions such as its more western counterparts, it involves a heavy group stretching element that leaves both the masseuse and the client in a full-body state of rejuvenation after the session's conclusion. Of course, on top of the more standard Thai massage, other types of less-known massages are offered and some although traditional, are still somewhat sexual in nature.\n\nToday, the cute pale-skinned and curvy Japanese AV porn star in training Yui Asahina is going to be introduced to the arts of &quot;Japkasai&quot;--or more colloquially known as a Thai testicle massage. Generally, this massage implies an extended massage technique featuring some stern rubbing motions on and around the testicles to improve blood flow, kidney function, and all around general health of its receiver. The penis is usually not touched...usually. However, a massage solely focusing on the testicles without any release would leave a lot of the potential Japanese male clientele rather built up and antsy and ending the session with a raging hardon would be anything but a comfortable experience.\n\nKeeping up with the strange and bizarre Japanese take on common worldwide trends and giving them a deviantly sexual make-over, we are shown Yui Asahina as she is first instructed on how to give the traditional Thai testicle massage followed by her trying it out on a few of the pilot clients looking to try something new and unique. Nearly naked for the entire production, unabashed Yui is shown kneeling in her birthday suit with ample tits and hard nipples and a hint of bush on display as a real Thai masseuse fluent in Japanese explains to her the proper technique for giving a testicle massage on a real live naked model who can't help but stroking himself as his balls are thoroughly given the runaround.\n\nAs the instructions continue, the effect of this beautiful Thai lady rubbing and tugging on this lucky man's testicles all the while a cute and totally naked Japanese porn star watches on in glee leaves this man little choice but to orgasm with gusto all over his midsection and the Thai masseuse's soft hands. Yui is surprised at the huge amount of jizz that came out of him. In fact, she remarks that it is way more than average and if there is one thing that this ball massage can do above all else, it's the ability to create immensely powerful male orgasms.\n\nWe later see Yui Asahina still naked (or mostly naked in some scenes but this doesn't last for long fortunately) practicing her newly-learned techniques on customers who are open to the new experience of having their balls be the center of attention. Of course, most massages end short as Yui ends up stripped out of her uniform and finds herself resting above horny and naked customers with her dripping slit and gaping backdoor asshole inches from their open mouths as she tries to focus on continuing the Thai testicle massage. This position though, with her most private regions equally as accessible as her client's, leads to a less-than-traditional testicle massage and rather, to a more than normal occurrence of two horny bodies engaging in some good old-fashioned Japanese lovemaking","torrent":{"xt":"urn:btih:4e75314daef43f926bd5b3ecc024d3c677a8927b","amp;dn":"Thai+Testicle+Massage+-+English+Subtitled%21+%5B.mp4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e75314daef43f926bd5b3ecc024d3c677a8927b","infoHashBuffer":{"type":"Buffer","data":[78,117,49,77,174,244,63,146,107,213,179,236,192,36,211,198,119,168,146,123]},"announce":[],"urlList":[]}}