{"title":"One Foot in the Grave (BBC - The Complete Edition)","uid":5781039,"size":15962378698,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4e93492459454dfff982cba186616ef3747f5b1b&amp;dn=One+Foot+in+the+Grave+%28BBC+-+The+Complete+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"TehDoktor","files":45,"time":1282404499,"description":"TV : Comedy : DVD quality : English\nOne Foot in the Grave is a BBC television situation comedy series written by David Renwick. The show ran for six series, including seven Christmas specials, two Comic Relief specials, over an eleven year period, from early 1990 to late 2000. The latter Comic Relief special was shown after the series officially ended in Spring 2001.\n\nThe series features the exploits of Victor Meldrew, played by Richard Wilson, and his long-suffering wife, Margaret, played by Annette Crosbie, in their battle against the trials of modern life. After being forced to take involuntary early retirement, the series followed the protagonist's various efforts to keep himself busy, whilst encountering various misfortunes and misunderstandings. The series was set in a typical suburban household in a suburb of London based on Luton (although was largely filmed on location in Dorset). However, despite its traditional production, the series subverts its domestic sitcom setting with elements of black humour and surrealism.\n\nThe series was occasionally the subject of controversy for some of its darker story elements, but was nevertheless the recipient of a number of awards, including the 1992 BAFTA for Best Comedy. In 2004, the series came tenth in a 2004 BBC poll to find &quot;Britain's Best Sitcom&quot;. The programme also came 80th in the British Film Institute's 100 Greatest British Television Programmes.\n\nThe series, originally shown on BBC1, is now available on DVD and is regularly repeated in the United Kingdom. Four episodes were remade for BBC Radio 2 and the series also inspired a novel.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:4e93492459454dfff982cba186616ef3747f5b1b","amp;dn":"One+Foot+in+the+Grave+%28BBC+-+The+Complete+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e93492459454dfff982cba186616ef3747f5b1b","infoHashBuffer":{"type":"Buffer","data":[78,147,73,36,89,69,77,255,249,130,203,161,134,97,110,243,116,127,91,27]},"announce":[],"urlList":[]}}