{"title":"Gangnam Style soundtrack What Makes Christian Beautiful.avi","uid":7904298,"size":94371840,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4fb191599f03c73029168698c726df24e195da80&amp;dn=Gangnam+Style+soundtrack+What+Makes+Christian+Beautiful.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"abebatam","files":1,"time":1355011238,"description":"I feel so sorry for Christians who still finding their identity through research and geological artifact only to \nfind the truth of inside bible they read. Bible was written hundreds of years after crucifixion. It was a story \ntelling ORALLY - from mouth to mouth - handed over through generations by various kind of \nmouths that full of human characteristics such as forgetful,ignorant, personal interrst, politics, scandal,\netc... etc... \n\nThen it's written by someone who really care about the story and then no body interested \nin it only to become pieces of obsolete paper. \n\nThe legend continues when some priests found the ultimate formula to preach people to christianity. The formula is dramatization \nof the story of crucifixion for salvation. It was easily ate all by european people before the medieval era where they[ were still in \nthe darkness of barbaric period. No matter they did, they will always forgiven as long as they believe in \ncrucifixion.\n\nSaved by who? By someone that his identity is not very clear. Is he married? No one of his follower confinced if he was married or not\n  \nAs their brain growing bigger and bigger, they tried to find the proof of their religion \nscientifically. Piece by piece they collected from earth, to make the puzzle matches their \nimagination. When the reality is contrary to their imagination -like the old papyrus which \nmentioned Jesus got Married- simply they discard it. \n\nIn the meantime the scientists tried to figure out the real face of Jesus hoping that the fact will meet their description of the heavenly face of Jesus. When the fact showed opposite, no single Christian on earth replaced the Oscar winner, good looking and heart touching image of Jesus in their houses and churches to the face of looser-alike Jews face.\n\nThen the search continued in order to redeem the fantasy. This time the mission is finding \nthe lost treasure of bible back to the date of before crucifixion. Let see what other denial they will make when they have found it.                              \nAs my appreciation to their endless endeavor, I presented this video \nIn case you are reluctant to put your cursor over the url, I let you know the title is &quot;How Jesus Escaped The Cross&quot; \nHappy Watching.","torrent":{"xt":"urn:btih:4fb191599f03c73029168698c726df24e195da80","amp;dn":"Gangnam+Style+soundtrack+What+Makes+Christian+Beautiful.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fb191599f03c73029168698c726df24e195da80","infoHashBuffer":{"type":"Buffer","data":[79,177,145,89,159,3,199,48,41,22,134,152,199,38,223,36,225,149,218,128]},"announce":[],"urlList":[]}}