{"title":"Sometimes I Feel Like A Nut - Jill Kargman","uid":12121134,"size":410032,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50aa3587b4afb4de7ae4282307464502f2717eb4&amp;dn=Sometimes+I+Feel+Like+A+Nut+-+Jill+Kargman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1436824285,"description":"Demonstrating Woody Allen's magical math equation, comedy = tragedy + time, a sensational collection of witty essays about life, love, hate, kids, work, school, and more from the author of The Ex-Mrs. Hedgefund and Arm Candy\n\nJill Kargman is a mother, wife, and writer living the life in New York City . . . a life that includes camping out in a one-bedroom apartment with some unfortunate (and furry) roommates, battling the Momzillas of Manhattan, and coming to terms with her desire for gay men. In this entertaining collection of observations, Kargman offers her unique, wickedly funny perspective as she zips around Manhattan with three kids in tow.\n\nKargman tackles issues big and small with sharp wit and laugh-out-loud humor: her love of the smell of gasoline, her new names for nail polishes, her adventures in New York City real estate, and her fear of mimes, clowns, and other haunting things. Whether it's surviving a family road trip or why she can't stand Cirque du So Lame, living with a mommy vagina the size of the Holland Tunnel or surviving the hell that was her first job out of college, Kargman's nutty self triumphs, thanks to a wonderfully wise outlook and sense of fun that makes the best of everything that gets thrown her way. And if that's not enough, Kargman illustrates her reflections with doodles that capture her refreshing voice","torrent":{"xt":"urn:btih:50aa3587b4afb4de7ae4282307464502f2717eb4","amp;dn":"Sometimes+I+Feel+Like+A+Nut+-+Jill+Kargman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50aa3587b4afb4de7ae4282307464502f2717eb4","infoHashBuffer":{"type":"Buffer","data":[80,170,53,135,180,175,180,222,122,228,40,35,7,70,69,2,242,113,126,180]},"announce":[],"urlList":[]}}