{"title":"Kondratov-Riddles-of-Three-Oceans","uid":7598639,"size":22121972,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:515ccdd0412898f853b2b92a3af71718e65ca616&amp;dn=Kondratov-Riddles-of-Three-Oceans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"damitr","files":1,"time":1346758179,"description":" The Riddles of Three Oceans by Alexander Kondratov. \n\n    In this book Alexander Kondratov takes a look at some of the blank spaces in man's knowledge that can be filled in by further evidence obtained from underwater archeology. In the Pacific Ocean these include such riddles as the culture of Easter Island, the origin of the American Indians, the original homeland of the Polynesians and the peopling of Australia. In the Indian Ocean one of the mysteries is how the ancient Dravidian civilisation spread. Among the secrets of the Atlantic are the warm and cold legendary islands of St. Brendan, Antilia and Thule, the extinct tribes of the Canary Islands, and Atlantis, a fascinating mystery that has given rise to a voluminous body of literature.\n\n    The author sets forth the main hypotheses that have been advanced to solve these riddles and analyses them from the standpoints of ethnography, linguistics, geology and other sciences. But he does not try to impose any of the hypotheses on the reader. The conclusions he draws are extremely cautious, and in cases where there is insufficient data the question is left open.\n\n    This highly interesting book is intended for the general reader. Indeed, no educated person can fail to take an interest in problems that have a direct bearing on the human race.\n\nThe book was translated from the Russian by Leonard Stoklitsky and designed by Victor Korolkov. The book was first published by Progress Publishers in 1974.\n\nPDF | OCR | Bookmarked | Paginated | 21.1 MB | 290 pp | 600 dpi\n\nReleased on TBP by mirtitles.org\n\nCONTENTS\n\nFOREWORD-5\n\nPROLOGUE-7\n\nPart One.\nTHE PACIFIC OCEAN-23\n\nDiscovery. - The Mystery of Easter Island. - Remains of the\nPacific Continent. - When Did This Happen?Professor Zubov's\nTheory. - Pacific Floor Theories. - The Darwin Rise. - Sunken\nIslands of the Pacific. - Bering Land.-Andes Land and the Secret\nof Tiahuanaco. - From the Andes to Easter Island. - Kainga Nuinui,\nor &quot;Enormous Land&quot;. - A Polynesian Continent? - A Hawaiian\nContinent? - Guyot Land? Micronesia Land? - The Sinking Coast\nof the Pacific, - Australia and Tasmania Land. - Melanesia Land\nPart Two.\nTHE INDIAN OCEAN-119\nRiddles of the Equatorial Race. - Gondwanaland and Lemurla. The\nCradle of Homo Sapiens. - Tamalaham, Nawalam and South\nMadura. - The Sumerians and the Ubaids. - Mesopotamla - Bahrein -\nIndia. -The Land Known as Elam. - The Dravidian\nProblem. - Ships from the Land of Melukha. - Search for the\n&quot;Sumerian Paradise&quot;. - Egypt: Riddles That Outdate the\nSphinx. - Turkmenistan-Sumer-Lemuria. - Islands in the Indian\nOcean. - The Least Studied Ocean. - The Fall of Mohenjo-Daro. Deities\nof the Proto-Indians. - The Secrets of Tantra. - From the\nBuryat Area to Australia.-Pages from &quot;Chronicles on Rock&quot;. Did\nAntarctica Drift Away?\nPart Three.\nTHE ATLANTIC OCEAN 201\nLegendary Islands. - The Bed of the Atlantic. - Thule, Dunejar\nBuss and Mayda. - In the Southern Part of the North Sea. -\nThe Cassiterides or &quot;Tin Islands&quot;. Gadir and Tartessos. Island\nGroups. - Atlantophlles and Atlantophobes. - The\nMediterranean. and Tyrrhenia. - Tl'itonia? Aegean Continent?\nBosphoria? - From Pontus to the Antilles.\n\nEPILOGUE","torrent":{"xt":"urn:btih:515ccdd0412898f853b2b92a3af71718e65ca616","amp;dn":"Kondratov-Riddles-of-Three-Oceans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"515ccdd0412898f853b2b92a3af71718e65ca616","infoHashBuffer":{"type":"Buffer","data":[81,92,205,208,65,40,152,248,83,178,185,42,58,247,23,24,230,92,166,22]},"announce":[],"urlList":[]}}