{"title":"The Naked Communist","uid":6625835,"size":5204999,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52227988fd35a4cdc20fb66a8e2c3ffdaf259e8d&amp;dn=The+Naked+Communist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"greybeard1250","files":7,"time":1314168955,"description":"Book Description\nPublication Date: May 2003\nThe Naked Communist was a best seller in the early 1960s, selling more than 1.5 million copies. It found its way into the libraries of the CIA, the FBI, the White House, and homes all across America and overseas in Spanish and excerpted in other languages. \n\nIn this hard-hitting book an urgent need is finally fulfilled. In one exciting, readable volume, the incredible story of Communism is graphically told. We believe this to be the most vivid and comprehensive book on the subject ever published. It contains a distillation of more than a hundred books and treatises on Communism, many written by Marxist authors. We see the Communist the way he sees himself---stripped of propaganda and pretense. Hence the title, \\&quot;The Naked Communist.\\&quot; Here is explained Communism\\'s amazing appeal, its history, and its basic and unchanging concepts---even its secret time-table of conquest! Vital questions are clearly answered---Who gave Russia the A-bomb? How did the FBI fight the battle of the underground? Why did the West lose 600 million allies after World War II? What really happened in Korea? What is Communism\\'s great secret weapon? Is there an answer to Communism? What lies ahead? ","torrent":{"xt":"urn:btih:52227988fd35a4cdc20fb66a8e2c3ffdaf259e8d","amp;dn":"The+Naked+Communist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52227988fd35a4cdc20fb66a8e2c3ffdaf259e8d","infoHashBuffer":{"type":"Buffer","data":[82,34,121,136,253,53,164,205,194,15,182,106,142,44,63,253,175,37,158,141]},"announce":[],"urlList":[]}}