{"title":"Sparta USA","uid":7230505,"size":132780525,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:52cef292114192d2ded23c82a28b3fa81eb36e1f&amp;dn=Sparta+USA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SmokeBogey","files":7,"time":1335820528,"description":"According to writer David Lapham, Sparta may love their country, but their idea of the land of the free and the home of the brave seems to have a slightly different meaning than it does to the rest of the US population. &quot;In Sparta the people love America,&quot; Lapham told CBR News. &quot;They love, mom, apple pie and football. They believe in the American Dream and pursue it through subterfuge, blackmail and assassination - just like they were taught in Mrs. Sanborn's fifth grade covert operations class. The only crime in Sparta is to be unseemly in public, but if you can, say, eliminate your boss in his sleep and take his job...that's how you get ahead in life, right? \n\nThere was no greater hero in Sparta than Godfrey McLaine, quarterback of the Mighty Spartans, though beloved Godfrey himself has survived dozens of assassination attempts by his backups. But three years ago, Godfrey disappeared into the Yeti-filled mountains that surround Sparta and keep it isolated. Now Godfrey has returned, bigger, redder and more magical than when he left, to take on the mysterious Maestro who runs Sparta and has been keeping some secrets from its citizens.&quot;","torrent":{"xt":"urn:btih:52cef292114192d2ded23c82a28b3fa81eb36e1f","amp;dn":"Sparta+USA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52cef292114192d2ded23c82a28b3fa81eb36e1f","infoHashBuffer":{"type":"Buffer","data":[82,206,242,146,17,65,146,210,222,210,60,130,162,139,63,168,30,179,110,31]},"announce":[],"urlList":[]}}