{"title":"Avid DS v11.1.1","uid":10166064,"size":707828960,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:531b67ac1ef7489350f75a7330c40dcd4561be32&amp;dn=Avid+DS+v11.1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"yousef86","files":-1,"time":1400345125,"description":"Avid DS v11.1.1 | 675MB\n=======================\n\nAvid DS is a full-featured editing graphics creation color correction and compositing solution and is the absolute best conforming tool for Media Composer and Symphony to create and deliver high-end content. Save time and money by keeping all editing and finishing in house. Choose the low cost software-only version to use with your existing hardware or the complete Avid DS System-a hardware/software bundle that comes with everything you need to capture edit monitor create and conform high-end content.\n\nNew features\n------------\nGet Media Composer 6 included with Avid DS (full and upgrades) and edit and color video with speed and ease (software bundle not included)\n\nGain hands-on precision and speed up color correction grading editing and navigation with support for Artist Color and Artist Transport control surfaces\n\nGet resolution independence with the canvas enabling you to customize the size for source generators and visual effects\n\nApply blending operations directly on the timeline to single or multiple clips or containers\n\nConform high-resolution sequences to Avid DS from Media Composer 6 or Symphony 6 (except stereoscopic 3D)\n\nConnect to and play Long-GOP MXF essence (such as from XDCAM) when conforming from Media Composer or Symphony eliminating transcoding time\n\nEdit high-resolution media-in master quality-using the Avid DNxHD 444 codec\n\nUse HDR imagery in your projects with support for the Open EXR/TIFF DCDM format\n\nCapture and output up to 16 channels of audio (up from 8) to create bigger richer audio mixes\n\nWork with RED EPIC and SCARLET footage with the new RED SDK\n\nIntegrate KONA 3G hardware into your Avid DS workflow","torrent":{"xt":"urn:btih:531b67ac1ef7489350f75a7330c40dcd4561be32","amp;dn":"Avid+DS+v11.1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"531b67ac1ef7489350f75a7330c40dcd4561be32","infoHashBuffer":{"type":"Buffer","data":[83,27,103,172,30,247,72,147,80,247,90,115,48,196,13,205,69,97,190,50]},"announce":[],"urlList":[]}}