{"title":"Steve Goodman - Affordable Art [1983][EAC,log,cue. FLAC]","uid":8916015,"size":239528027,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5353e18d6b7a75d23170fd4db339b9822de254ac&amp;dn=Steve+Goodman+-+Affordable+Art+%5B1983%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1379141171,"description":"Artist:Steve Goodman\nRelease:Affordable Art\nReleased: 1983\nLabel: Red Pajamas Records\nCatalog#: RPJ-002CD\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:country,americana\n\n\n1\t If Jethro Were Here\t2:27\t\n2\t Vegematic\t3:00\t\n3\t Old Smoothies\t4:15\t\n4\t Talk Backwards\t2:34\t\n5\t How Much Tequila (Did I Drink Last Night?)\t2:29\t\n6\t When My Rowboat Comes In\t3:38\t\n7\t Souvenirs\t3:34\t\n8\t Take Me Out To The Ballgame\t2:34\t\n9\t A Dying Cub Fan's Last Request\t6:03\t\n10\t California Promises\t2:45\t\n11\t Watchin' Joey Glow\t2:43\t\n12\t Grand Canyon Song\t3:38\t\n\n\n\nSteve Goodman launched his own record label, Red Pajamas Records, with the release of Artistic Hair, a live album, in March 1983. Of course, a record label needs more than one record, and Goodman followed ten months later with the second Red Pajamas release, Affordable Art. Unlike its predecessor, which consisted largely of vintage material, Affordable Art introduced new Goodman songs, although it also mixed in older tunes. &quot;Talk Backwards&quot; was a novelty repeated from Goodman's final major label outing, 1980s Hot Spot. &quot;Souvenirs&quot; found Goodman in duet with his pal John Prine on one of Prine's old songs. And &quot;Take Me Out to the Ball Game&quot; was, of course, the ageless sports anthem, which served as a set-up for &quot;The Dying Cub Fan's Last Request,&quot; Goodman's humorous rewrite of &quot;St. James Infirmary&quot; as the funeral plans of an adherent of one of the most hapless teams in baseball history. Complicating the comedy of the song, one of four on the disc recorded live, was Goodman's own status, not only as a Cubs fan, but also as a cancer patient whose recent career had been complicated by medical treatments; indeed, Affordable Art would be his last album released during his lifetime. It was typical of the singer/songwriter, however, that he would offer such gallows humor, which could also describe &quot;Watchin' Joey Glow,&quot; a post-apocalypse tale. &quot;Vegematic,&quot; the nightmare story of a man who falls asleep in front of the TV one night and wakes up to find he has ordered every one of those special offers that turn up on late-night commercials with 800 numbers, wasn't quite so morbid, but it was no less funny for that. And typically, Goodman also found time for a tasty instrumental (&quot;If Jethro Was Here&quot;) and for a sentimental ballad concerning family, in this case, his grandparents (&quot;Old Smoothies&quot;). His last album, therefore, was a characteristic one, amusing and moving by turns.","torrent":{"xt":"urn:btih:5353e18d6b7a75d23170fd4db339b9822de254ac","amp;dn":"Steve+Goodman+-+Affordable+Art+%5B1983%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5353e18d6b7a75d23170fd4db339b9822de254ac","infoHashBuffer":{"type":"Buffer","data":[83,83,225,141,107,122,117,210,49,112,253,77,179,57,185,130,45,226,84,172]},"announce":[],"urlList":[]}}