{"title":"Thundercats","uid":5155880,"size":997490469,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:536dcf8cd761d7bd0227c38f135b5b52f037c0fd&amp;dn=Thundercats&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1257847502,"description":"Collection of comic books based on the Thundercats animated television series that was produced by Rankin/Bass Productions.\n\nThundercats follows the adventures of a group of cat-like humanoid aliens from the planet of Thundera.  The people of Thundera flee their dying planet, but during their escape their ship is damaged when they are attacked by the evil mutants of Plun-Darr. The eldest aboard, Jaga, sacrifieces himself to ensure that the ship lands safely on the Thundercats new home, Third Earth.  Meanwhile, the mutants have found a powerful new leader in Mumm-Ra, the Ever-Living who is hellbent on spreading the dark influence of the Ancient Spirits of Evil throughout Third Earth.  The remaining Thundercats lead by Lion-O continue to fight the evil mutants with the goal of saving themselves and restoring peace to Third Earth.\n\nIn 1985, a Thundercats series was published by Marvel Comics through its Star imprint. It ended with issue #24 in 1988. \n\nIn 2002, DC Comics acquired the rights for the franchise and published a number of mini-series and one-shots under its Wildstorm imprint.\nThe original mini-series, Reclaiming Thundera (written by Ford Gilmore with various artists contributing), published in 2003, formed a series of loosely connected &quot;episodes&quot; that saw Lion-O continue his struggle against Mumm-Ra and The Mutants.  This was followed by The Return (written by Gilmore, and illustrated by Benes, Pimental, and Lea) and The Dogs of War, (written by John Lyman, illustrated by Brett Booth, Joe Prado, Al Vey and Eric Nguyen).  \nThe remaining mini-series, Hammerhand's Revenge (written by Fiona Avery, illustrayed by D'Anda) and Enemy's Pride, (written by Layman and illustrated by Virens, Hellig and Campus) were all set during the events of the animated series. \nSeveral one-shots were also published. These one-shots consisted of two crossovers with Battle of the Planets, one crossover with Superman and two &quot;Origins&quot; issues that established more of the back-stories.\n\nThe Marvel UK series is currently not been scanned.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:536dcf8cd761d7bd0227c38f135b5b52f037c0fd","amp;dn":"Thundercats","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"536dcf8cd761d7bd0227c38f135b5b52f037c0fd","infoHashBuffer":{"type":"Buffer","data":[83,109,207,140,215,97,215,189,2,39,195,143,19,91,91,82,240,55,192,253]},"announce":[],"urlList":[]}}