{"title":"Faust - Vildsint 2005","uid":6838311,"size":363986763,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:53c06be605eee3d0ffc3443a31a3db209efafd56&amp;dn=Faust+-+Vildsint+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"barber9","files":-1,"time":1322080955,"description":"Faust is a band of three Swedish folk musicians who celebrated their 10th anniversary with the release of a new album, Vildsint. Alban Faust on Swedish and Dalsland pipes, keyed fiddle and low whistle is joined by Christer Adin on mandolas, accordion and jaw harp, and Anders Adin on hurdygurdy, guitar and vocals. Producer Ulf Gruvberg joins on jaw harp and vocals for track 7.\n\nThe CD begins with an amazing traditional Swedish song, Ack, Ack (Oh Dear), accompanied by keyed fiddle, hurdygurdy and mandola. The sound of these ancient instruments together with the strange pronunciation of the Swedish words takes the listener instantly to the wide Scandinavian landscape.\n\nMost of the tracks on the album are traditional tunes, but you can also find some modern compositions among the songs. The tunes include different rhythms from the polka, Scottish and waltz traditions, and the only tune that doesn't come from the north of Europe is Launlaude/La grande bete, a melancholic composition by the French composers J.C. and B. Blanc/G. Chabenat.\n\nFaust composed the hauntingly beautiful hymn Alla Herrans mojligheter, for guitar and keyed fiddle, which is followed by my favourite track, the mesmerizing Norwegian ballad Lillebror och Storebror (Little &amp; Big Brother). Another highlight is the rather exciting lullaby Skatan (Magpie).\n\nThe CD is a wonderful collection of original folk music from the North and a small booklet provides interesting information about the songs in Swedish and English. (rambles.net)\n\n- - -\n\nFaust - Vildsint 2005\n(GÃƒÂ¶teborg Faust)\n\n 1. Ack ack, Ethno Anders\n 2. SÃƒÂ¤ngfÃƒÂ¶saren\n 3. Aktenskapspolskan\n 4. Launlaude, La grand bete\n 5. Vildsint\n 6. Alla Herrans mÃƒÂ¶jligheter\n 7. Lillebror och storebror, Isdalen\n 8. Eba Brahe, Bretanska mardrÃƒÂ¶mmar\n 9. TÃƒÂ¶ftedalspolskan\n10. Skatan\n11. SteklÃƒÂ¥ten\n12. Tomta Anders, Petter Dufva\n","torrent":{"xt":"urn:btih:53c06be605eee3d0ffc3443a31a3db209efafd56","amp;dn":"Faust+-+Vildsint+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53c06be605eee3d0ffc3443a31a3db209efafd56","infoHashBuffer":{"type":"Buffer","data":[83,192,107,230,5,238,227,208,255,195,68,58,49,163,219,32,158,250,253,86]},"announce":[],"urlList":[]}}