{"title":"Mad Men Season 1, 2, 3, 4, 5, 6 + Extras BDRip TSV","uid":9300270,"size":54623600721,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5528d842ad164e4d6b35e26739df756bb7a60fc1&amp;dn=Mad+Men+Season+1%2C+2%2C+3%2C+4%2C+5%2C+6+%2B+Extras+BDRip+TSV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"TSV","files":-1,"time":1386229106,"description":"All 6 seasons +extras BDRip 550MB 720X406 h264.\n\n\nMad Men is an American television period drama series created and produced by Matthew Weiner. The series premiered on July 19, 2007 on the American cable network AMC and is produced by Lionsgate Television. The seventh and final season will have 14 episodes that will be split into two seven-episode parts, airing in early 2014 and 2015.\n\nMad Men is set in the 1960s, initially at the fictional Sterling Cooper advertising agency on Madison Avenue in New York City, and later at the newly created firm, Sterling Cooper Draper Pryce (later Sterling Cooper &amp; Partners), located nearby in the Time-Life Building, at 1271 Avenue of the Americas. According to the show's pilot, the phrase &quot;mad men&quot; was a slang term coined in the 1950s by advertisers working on Madison Avenue to refer to themselves. The focal point of the series is Don Draper (Jon Hamm), creative director at Sterling Cooper and a founding partner at Sterling Cooper Draper Pryce, and the people in his life, both in and out of the office. The plot focuses on the business of the agencies as well as the personal lives of the characters, regularly depicting the changing moods and social mores of the United States in the 1960s.\n\nMad Men has received widespread critical acclaim, particularly for its historical authenticity, visual style, costume design, acting, writing, and directing, and has won many awards, including fifteen Emmys and four Golden Globes. It is the first basic cable series to win the Emmy Award for Outstanding Drama Series, winning it in each of its first four seasons. In 2013, TV Guide ranked it sixth in its list of the sixty greatest dramas of all time, and it was ranked seventh in a list of the 101 best-written TV series of all time by the Writers Guild of America.\n\n\nPlease seed at a decent speed.\n\n\nEnjoy,\n \n\nTSV.","torrent":{"xt":"urn:btih:5528d842ad164e4d6b35e26739df756bb7a60fc1","amp;dn":"Mad+Men+Season+1%2C+2%2C+3%2C+4%2C+5%2C+6+%2B+Extras+BDRip+TSV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5528d842ad164e4d6b35e26739df756bb7a60fc1","infoHashBuffer":{"type":"Buffer","data":[85,40,216,66,173,22,78,77,107,53,226,103,57,223,117,107,183,166,15,193]},"announce":[],"urlList":[]}}