{"title":"The Anglo-Saxon Chronicle","uid":11541551,"size":1280568,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5532c211954d4f60037f617145e09624e5ba0695&amp;dn=The+Anglo-Saxon+Chronicle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1416673695,"description":"The Anglo-Saxon Chronicle Compiled on the orders of King Alfred the Great The History of the Anglo-Saxons Translation by Rev. James Ingram and Dr. J.A. Giles The Anglo-Saxon Chronicle is a collection of annals in Old English chronicling the history of the Anglo-Saxons. The original manuscript of the Chronicle was created late in the 9th century, probably in Wessex, during the reign of Alfred the Great. Multiple copies were made of that original which were distributed to monasteries across England, where they were independently updated. In one case, the Chronicle was still being actively updated in 1154. Nine manuscripts survive in whole or in part, though not all are of equal historical value and none of them is the original version. The oldest seems to have been started towards the end of Alfred's reign, while the most recent was written at Peterborough Abbey after a fire at that monastery in 1116. Almost all of the material in the Chronicle is in the form of annals, by year; the earliest are dated at 60 BC (the annals' date for Caesar's invasions of Britain), and historical material follows up to the year in which the chronicle was written, at which point contemporary records begin. These manuscripts collectively are known as the Anglo-Saxon Chronicle","torrent":{"xt":"urn:btih:5532c211954d4f60037f617145e09624e5ba0695","amp;dn":"The+Anglo-Saxon+Chronicle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5532c211954d4f60037f617145e09624e5ba0695","infoHashBuffer":{"type":"Buffer","data":[85,50,194,17,149,77,79,96,3,127,97,113,69,224,150,36,229,186,6,149]},"announce":[],"urlList":[]}}