{"title":"eBook - Educational - Murach's HTML, XHTML, and CSS","uid":6976045,"size":87529243,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55e02b07191bec6987f5b33aadee540b8a05ccb5&amp;dn=eBook+-+Educational+-+Murach%5C%27s+HTML%2C+XHTML%2C+and+CSS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"R0tten","files":2,"time":1327254350,"description":"TITLE: &quot;Murach's HTML, XHTML, and CSS&quot;\n\n\nAUTHOR: Anne Boehm\n\n\nTARGET FOR: Web Designers and Web Developers.\n\n\nDESCRIPTION: \n- &quot;You'll be using HTML/XHTML and CSS (Cascading Style Sheets) in tandem: HTML/XHTML to provide and identify the various elements of content on the web page (headings, paragraphs, images, etc.) and CSS to format and lay out the elements. You'll be amazed at the sophisticated pages you'll be producing, including those that require the use of the CSS box model, floating, and positioning.\n\nYou'll see how to refine your web pages with the features that users expect today. That includes:\n\n--&gt; Adding Flash, audio, and video to your pages\n--&gt; Formatting your web content for easy printing\n--&gt; Adapting your pages to display on mobile devices\n--&gt; Using tested JavaScript code to add features like image rollovers, image swaps, and slide shows (a great first step in learning JavaScript)\n\nIn the last section, you'll learn how to design an entire web site using today's best practices. You'll also learn how to deploy your web site, and how to get it into the major search engines and directories. When you're done, you'll have all the perspective and skills you need to develop professional web pages.&quot;\n\n\nZIP CONTENT:\nThere are three versions of &quot;Murach's HTML, XHTML, and CSS&quot; book:\n--&gt; The original PDF file.\n--&gt; An OCRed version, saved as a PDF file again.\n--&gt; An RTF text version. (Best viewed in Word Pad - NOT Microsoft Word)\n\nYou have all three versions because, even though the OCR program used was beautiful when it was using its character re-imaging, OCR software is never 100%. So, when viewing the converted versions, if you come across splicing and scrambling, you have the original PDF to revert back to. :)\n\n\nREQUEST: Please seed, sweeties! I refuse to allow LockLizard to cheat me out of my money, and I refuse to be an honest customer to a company who embraces LockLizard's methods as it treats their customers like damn criminals. :)","torrent":{"xt":"urn:btih:55e02b07191bec6987f5b33aadee540b8a05ccb5","amp;dn":"eBook+-+Educational+-+Murach%5C%27s+HTML%2C+XHTML%2C+and+CSS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55e02b07191bec6987f5b33aadee540b8a05ccb5","infoHashBuffer":{"type":"Buffer","data":[85,224,43,7,25,27,236,105,135,245,179,58,173,238,84,11,138,5,204,181]},"announce":[],"urlList":[]}}