{"title":"1942: The Year That Tried Men's Souls by Winston Groom ","uid":10409257,"size":5964269,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:561aa881abe084353d50e6586cbe6e7071237db8&amp;dn=1942%3A+The+Year+That+Tried+Men%27s+Souls+by+Winston+Groom+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1403505581,"description":"\nFrom the author of Forrest Gump and A Storm in Flanders comes a riveting chronicle of America's most critical hour. On December 6, 1941, an unexpected attack on American territory pulled an unprepared country into a terrifying new brand of warfare. Novelist and popular historian Winston Groom vividly re-creates the story of America's first year in World War II. \n\nTo the generation of Americans who lived through it, the Second World War was the defining event of the twentieth century, and the defining events of that war were played out in the year 1942.\n\nThis account covers the Allies' relentless defeats as the Axis overran most of Europe, North Africa, and the Far East. But midyear the tide began to turn. America finally went on the offensive in the Pacific, and in the west the British defeated Rommel's panzer divisions at El Alamein while the U.S. Army began to push the Germans out of North Africa. \n\nBy the year's end, the smell of victory was in the air. 1942, told with Groom's accomplished storyteller's eye, allows us into the admirals' strategy rooms, onto the battle fronts, and into the heart of a nation at war.\n\nGenre: History, Non-Fiction, World War 2","torrent":{"xt":"urn:btih:561aa881abe084353d50e6586cbe6e7071237db8","amp;dn":"1942%3A+The+Year+That+Tried+Men%27s+Souls+by+Winston+Groom+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"561aa881abe084353d50e6586cbe6e7071237db8","infoHashBuffer":{"type":"Buffer","data":[86,26,168,129,171,224,132,53,61,80,230,88,108,190,110,112,113,35,125,184]},"announce":[],"urlList":[]}}