{"title":"Sam Samudio - Sam Hard And Heavy (1971) MP3@256kbps","uid":9623339,"size":71129278,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:563f2a390f38183b21697769915379cd6860ffba&amp;dn=Sam+Samudio+-+Sam+Hard+And+Heavy+%281971%29+MP3%40256kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AaronVincent","files":11,"time":1392508857,"description":"After the late-'60s collapse of Sam the Sham &amp; the Pharaohs, the band's front man and lead singer Domingo &quot;Sam&quot; Samudio signed a solo deal with Atlantic and recorded this 1971 slice of collector nirvana. Why nirvana? Well, aside from Sam's estimable vocal and songwriting contributions, the album boasted contributions from, oh, about a half-dozen different flat-out legends, including producers Tom Dowd and Jerry Wexler and sidemen the Dixie Flyers (led by Jim Dickinson), the Memphis Horns, the Sweet Inspirations, and some session guitarist named Duane Allman! Sam's born-to-be-wild pose on the front cover tips you off to the sound; this album updated the Pharoahs' frat-boy garage raunch with a nod towards hard rock (&quot;Relativity&quot; and &quot;Don't Put Me On&quot;), while also harkening back to his Tex-Mex (&quot;Don't Put Me On&quot;) and blues (&quot;Key to the Highway&quot;) roots. Little wonder, then, that vinyl copies of this record which makes its CD debut here fetch a pretty penny when and if you can find it. The album also won a Grammy for Sam's hilarious, stream-of-consciousness liner notes (&quot;Thank the monkey&quot;), which we've reproduced here along with new notes by Richie Unterberger. We've also added a bonus single side, Sam's version of &quot;Me and Bobby McGee&quot; featuring Duane Allman on dobro!","torrent":{"xt":"urn:btih:563f2a390f38183b21697769915379cd6860ffba","amp;dn":"Sam+Samudio+-+Sam+Hard+And+Heavy+%281971%29+MP3%40256kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"563f2a390f38183b21697769915379cd6860ffba","infoHashBuffer":{"type":"Buffer","data":[86,63,42,57,15,56,24,59,33,105,119,105,145,83,121,205,104,96,255,186]},"announce":[],"urlList":[]}}