{"title":"FFSJ: The Fastest File Splitter and Joiner [V 3.3]","uid":6663983,"size":404992,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:56826d24ecf6524bb64d715f742e141a8c59db87&amp;dn=FFSJ%3A+The+Fastest+File+Splitter+and+Joiner+%5BV+3.3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hbshuvo","files":-1,"time":1315616449,"description":"Features\n\nFFSJ is...\n\nVery fast: FFSJ can optimize disk-cache and memory usage, this makes FFSJ 3-5 times faster than HJ-Split, WinSplit, MasterSplitter in both splitting and joining tasks. Of course, it is much faster than any compression program.\n\nSimple: FFSJ works well on all Windows platforms. FFSJ-Lite doesn\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t need any requirement of installations or complicated DLLs. FFSJ-Standard has only one simple installation package for integrating FFSJ into shell context menu.\n\nSmall: Both FFSJ-Lite and FFSJ-Standard editions are small enough to fit on a floppy disk.\n\nEasy to use: FFSJ has a friendly user-interface, it can be used to split any file. FFSJ-standard can also create its shell context menus in order to perform splitting and joining tasks directly from Windows Explorer.\n\nEasy to be integrated: Since v3.0, FFSJ published its command-line interface. End-users can split/join multiple files using a .BAT file. Developers can write their own interface (in any language) to perform splitting/joining tasks from their applications.\n\nSecure: FFSJ uses an advanced encryption algorithm to make your data much more secure from unauthorized access. Since v2.9, MD5 checksum algorithm has also been integrated to verify data integrity.\n\nCompatible: FFSJ can join parts produced by HJ-Split.\n\nFree and Safe: FFSJ-Lite and FFSJ-Standard are free and clean, both editions do not contain any form of adwares, spywares, viruses, trojans and backdoors.","torrent":{"xt":"urn:btih:56826d24ecf6524bb64d715f742e141a8c59db87","amp;dn":"FFSJ%3A+The+Fastest+File+Splitter+and+Joiner+%5BV+3.3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56826d24ecf6524bb64d715f742e141a8c59db87","infoHashBuffer":{"type":"Buffer","data":[86,130,109,36,236,246,82,75,182,77,113,95,116,46,20,26,140,89,219,135]},"announce":[],"urlList":[]}}