{"title":"Earth Moments - Voice Of India","uid":15945771,"size":558053412,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5692e64f1e1f3e026d522f712d09241667404104&amp;dn=+Earth+Moments+-+Voice+Of+India&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Horisarte","files":423,"time":1475507212,"description":"* 24 Bit Quality\r\n• 531MB\r\n• 400+ Indian Vocal WAV Samples\r\n\r\n'Voice of India' from EarthMoments is the premium Indian vocal sample pack, containing 531MB of WAV files to ready to spice up your music and add an authentic world vibe to your next production. Recorded using the finest equipment, this pack features top Indian vocalists in 400 individual samples.\r\n\r\nThe essential vocals package has been optimised with the closest attention to detail, staying true to the sound with authentic Royalty-Free samples. The vocals samples were recorded using tube Pre-Amps and Mics on 96kHz in studios across India.\r\n\r\nThis unique sample pack has been created and maximised to the highest standards, exclusively delivered by top Indian vocalists in the Indian music scene today, and can be used to create a variety of styles with Indian vocals signatures.\r\n\r\nThe 'Voice of India' collection contains 400 samples of a range of Indian vocals styles: Bollywood, Mantras, Qawalli, Rajasthani, Konnakol, Baul, Carnatic, and Hindustani classical.\r\n\r\nAll samples were recorded at 96kHz using Class A preamps and Tube mics at Clementine studios in Chennai.\r\n\r\nAbout EarthMoments:\r\n\r\nEarthMoments was created to offer music producers unique collections of high quality samples and a space to explore unique sounds and signatures that sets the creative spirit free to cross borders, explore, and discover unique instruments and sounds of the world.\r\n\r\nOur team includes producers and engineers with over twenty years' experience, and our musicians are internationally acclaimed and top industry professionals. Our in-house studios carrying state-of-the-art analog and digital equipment combined with our passion for quality brings us to produce the best quality samples.\r\n\r\nEarthMoments is a division of EarthSync, a world music record label, and producer of award-winning audio and visual productions that brings together traditional and contemporary music in unique, high quality productions.\r\n \nhttps://www.producerloops.com/Download-Earth-Moments-Voice-of-India.html","torrent":{"xt":"urn:btih:5692e64f1e1f3e026d522f712d09241667404104","amp;dn":"+Earth+Moments+-+Voice+Of+India","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5692e64f1e1f3e026d522f712d09241667404104","infoHashBuffer":{"type":"Buffer","data":[86,146,230,79,30,31,62,2,109,82,47,113,45,9,36,22,103,64,65,4]},"announce":[],"urlList":[]}}