{"title":"Robert Jordan - Het Rad des Tijds 10 - Viersprong van de schemer","uid":6464556,"size":963593818,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:56a972596f97ee27456d4f0ddbba4c7f356c87d0&amp;dn=Robert+Jordan+-+Het+Rad+des+Tijds+10+-+Viersprong+van+de+schemer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Vlinder2","files":-1,"time":1307915682,"description":"Audioboek - Robert Jordan - Het Rad des Tijds Boek 10 - VIERSPRONG VAN DE SCHEMER\n\n\n\nBeschrijving\n Onze helden staan voor moeilijke keuzes, terwijl de Schemer aanbreekt en de macht van de Duistere toeneemt. \nOp de vlucht met de Dochter van de Negen Manen, zijn voorspelde bruid, ontdekt Mart dat zowel de Schaduw als de Seanchanen hen op de hielen zitten. \nPerijn probeert zijn gevangen vrouw Faile te bevrijden. Is een verbond met de vijand zijn enige kans? Kan hij trouw blijven aan zijn vriend Rhand en zichzelf? \nEgwenes rebelerende Aes Sedai belegeren Tar Valon, maar ze moeten snel winnen, met zo min mogelijk bloedvergieten, want alleen herenigd kunnen de Aes Sedai de Duistere weerstaan. \nIn Andor vecht Elayne voor de Leeuwentroon, maar ze wordt omringd door vijanden. Als zij faalt, zal Andor onder de Schaduw vallen en zal ook de Herrezen Draak falen. \nRhand heeft de smet van saidin verwijderd en alle geleiders gered. En toch is er niets veranderd, want hij wordt nog steeds gehaat en gevreesd...\n \n\nRecensie(s)\nNBD|Biblion recensie\n Tiende deel in het groots opgezette, immens populaire fantasy-epos \\'Het rad des tijds\\'. Zoals de titel al aangeeft, moeten er belangrijke keuzes met vergaande gevolgen gemaakt worden. Verder zit er volgens de kenners weinig actie en niet veel schot in dit deel, maar eenmaal tot deel tien gekomen, lees je toch wel door... Mart Cauthon en zijn bruid, de Dochter van de Negen Manen, worden nog steeds achtervolgd door de Seanchen en de Schaduw zelf. Perrijn is nog bezig om zijn vrouw Faile te bevrijden en overweegt een verbond met de vijand. De stad Tar Valon wordt nog belegerd en Elayne strijdt verder om de Leeuwentroon... Het is onmogelijk om de steeds ingewikkelder wordende intrige van deze fantasy-cyclus met zijn vele verhaallijnen en talloze verwikkelingen en personages samen te vatten. Zelf lezen dus, waarbij kennis van de voorafgaande negen delen noodzakelijk is. Jordan is een van de groten in dit genre en dit is dan ook een boeiend en kleurrijk fantasy-epos waarin een voortdurende strijd tussen goed en kwaad in een semi-middeleeuwse, magische wereld wordt uitgevochten. Er volgen nog twee delen. Met kaart en uitgebreid register. Zie www.enee.umd.edu/~dilli/WOT/WOTindex/ voor meer informatie.\n\n\nTBS","torrent":{"xt":"urn:btih:56a972596f97ee27456d4f0ddbba4c7f356c87d0","amp;dn":"Robert+Jordan+-+Het+Rad+des+Tijds+10+-+Viersprong+van+de+schemer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56a972596f97ee27456d4f0ddbba4c7f356c87d0","infoHashBuffer":{"type":"Buffer","data":[86,169,114,89,111,151,238,39,69,109,79,13,219,186,76,127,53,108,135,208]},"announce":[],"urlList":[]}}