{"title":"The Unofficial Guide to Having a Baby-Mantesh","uid":6415659,"size":8941310,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:56c1eee4c58a43e9355c546e58c396aa6e3869ef&amp;dn=The+Unofficial+Guide+to+Having+a+Baby-Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MANTESH","files":3,"time":1306111156,"description":"[img]http://i1130.photobucket.com/albums/m521/cikachuno/pic/1-19.jpg[/img]\n\n\n\n\n\n\n\n[b][quote][color=Green]\n\n\n\nThe Unofficial Guide to Having a Baby \n\n\nWiley \nAnn Douglas ,John R. Sussman \n2004 \nEnglish\nISBN: 076454148X \n864 Pages \nPDF \n8.45 MB\n\n\n\nLike a good obstetrician, The Unofficial Guide to Having a Baby respects the intelligence of the mother-to-be. This mammoth tome is probably the best reference book on the market, giving nonjudgmental and fairly exhaustive information on such hot-button topics as whether to drink coffee during pregnancy and the relative safety of birth centers. The book lays out as much information as possible and leaves the decision-making to the parents--a surprisingly rare gambit in the bossy world of pregnancy books, which all too often insult the mom-to-be with sweeping dicta unsupported by hard science. Also like a good doctor, the book knows its limits, referring to other sources well and often.\n\nThe book's tone can be impersonal, which seems natural considering that it was put together by two authors, a team of editors, and a panel of birth experts including a doctor, a nurse, and a nutritionist. For color commentary, 150 new parents were consulted, but their voices are not the book's strong point, offering such pallid advice as, &quot;A good-quality stroller will see you through all your children, whereas a cheapie will cost you again and again.&quot; The book's &quot;Unofficial&quot; moniker seems to refer more to the guide's commitment to laying out all the alternatives than to an irreverent stance. (Those looking for in-the-trenches attitude and tried-and-true advice might turn instead to Vicki Iovine's superb The Girlfriends' Guide to Pregnancy or Ariel Gore's The Hip Mama Survival Guide.) While the book's hesitance to pronounce on emotional topics is largely laudable, in some cases it backfires. In 818 pages, the authors devote just a few paragraphs to single-mother and lesbian pregnancies--though, to be fair, a resource directory is offered. Overall, though, this guide fills a much-needed information gap in the pregnancy book market.\n\n\n[/color][/quote][/b]","torrent":{"xt":"urn:btih:56c1eee4c58a43e9355c546e58c396aa6e3869ef","amp;dn":"The+Unofficial+Guide+to+Having+a+Baby-Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56c1eee4c58a43e9355c546e58c396aa6e3869ef","infoHashBuffer":{"type":"Buffer","data":[86,193,238,228,197,138,67,233,53,92,84,110,88,195,150,170,110,56,105,239]},"announce":[],"urlList":[]}}