{"title":"Family Buisness Season 1","uid":3321898,"size":2468079620,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:57c0b569cd5a4fd2817da3fe6e65ad89aabe793f&amp;dn=Family+Buisness+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"viceman","files":10,"time":1114536842,"description":"\n\nFAMILY BUSINESS is a new late night reality series from SHOWTIME about an average guy trying to make a living in the porn industry. A hilarious blend of real-life absurd situations and eccentric characters, FAMILY BUSINESS focuses on the charismatic Adam Glasser and his alter ego, &amp;quot;Seymore Butts,&amp;quot; who has created over 70 popular adult films. This show is for adult audiences only. The show uncovers the naked truth of a family whose business just happens to be adult entertainment. FAMILY BUSINESS centers around Adam, a proud single dad who runs the family business with his sometimes meddling, but well meaning mom, Lila, and cantankerous cousin, Stevie. The series follows Adam as he faces the same problems that many people encounter - running his own company, juggling a hectic schedule and looking for the love of his life. Adam's life is like anyone else's... almost. As an adult film producer, director and actor, his everyday challenges may be a little more unique than yours or mine. But you wouldn't believe the hard work that goes into auditioning hot new talent and shooting the perfect scene.","torrent":{"xt":"urn:btih:57c0b569cd5a4fd2817da3fe6e65ad89aabe793f","amp;dn":"Family+Buisness+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57c0b569cd5a4fd2817da3fe6e65ad89aabe793f","infoHashBuffer":{"type":"Buffer","data":[87,192,181,105,205,90,79,210,129,125,163,254,110,101,173,137,170,190,121,63]},"announce":[],"urlList":[]}}