{"title":"Encyclopedia of Historic Places - 3-Volume Set (2007) Pdf Gooner","uid":12023339,"size":118531798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57f55085b6f958a6aa859ad2631fb3d03c6283dc&amp;dn=Encyclopedia+of+Historic+Places+-+3-Volume+Set+%282007%29+Pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1434481431,"description":"Pages: 1644 \nPublisher: Facts on File; Revised edition (July 1, 2007)\nLanguage: English\nISBN-10: 0816053448\nISBN-13: 978-0816053445\n\nThe three-volume &quot;Encyclopedia of Historic Places, Revised Edition&quot; identifies and provides fascinating background information on cities, towns, districts, territories, and nations around the world. With more than 9,000 A-to-Z entries and a full-color insert in each volume, this revised set is much more comprehensive and colorful than the previous edition. In addition to current place names, cities, and states, this encyclopedia also has a substantial listing of ancient and classical places that are no longer in existence. There have been many changes in the geography of the world over the past 25 years, including the fall of the Berlin Wall, the collapse of the Soviet Union, and the birth of the European Union, to name a few. All of these changes, and many more, have been updated in this new edition to make the information as current as possible. The revision also includes new entries from every region of the world, with an added emphasis on how industry and technology have changed the geography of the modern world. The entries include: The Alamo; Berlin; Congo; Dakar; Erie Canal; Fort Knox; Hawaii; Ionian Islands; Java; Kabul; London; Mecca; New Orleans; Omaha Beach; Paris; Rome; Salzburg; Tibet; Tokyo; Vicksburg; and Windhoek","torrent":{"xt":"urn:btih:57f55085b6f958a6aa859ad2631fb3d03c6283dc","amp;dn":"Encyclopedia+of+Historic+Places+-+3-Volume+Set+%282007%29+Pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57f55085b6f958a6aa859ad2631fb3d03c6283dc","infoHashBuffer":{"type":"Buffer","data":[87,245,80,133,182,249,88,166,170,133,154,210,99,31,179,208,60,98,131,220]},"announce":[],"urlList":[]}}