{"title":"ICEBREAKER Who Started the Second World War - Viktor Suvorov [EN","uid":12547375,"size":3073573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5953cefd08b0def8b9a26540ac88bdf3db3d2d11&amp;dn=ICEBREAKER+Who+Started+the+Second+World+War+-+Viktor+Suvorov+%5BEN&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"perfect_stan","files":1,"time":1444495140,"description":"ICEBREAKER\r\nWho Started the\r\nSecond World War?\r\n\r\nby Viktor Suvorov\r\nTranslated by Thomas B. Beattie\r\n\r\n\r\nWho started the Second World War? There is no single answer to this question. The Soviet government, for\r\nexample, has repeatedly changed its official line on the issue.\r\nOn 18 September 1939, they stated in an official note that the government of Poland was the instigator of\r\nthe war. On 3o November 1939, however, Stalin named other culprits in the newspaper, Pravda: 'France and\r\nBritain . . . attacked Germany, thereby taking upon themselves the responsibility for the present war,' he\r\nwrote. By 5 May 1941, the story had changed again : in a secret speech to graduates of military academies,\r\nStalin laid the responsibility on Germany.\r\nAfter the war had ended, this circle of 'culprits' grew. Stalin announced that the most blood-stained war in\r\nthe history of humanity had been started by all the capitalist countries in the world – in other words, all the\r\nsovereign states in the world including Sweden and Switzerland, but excluding the Soviet Union.\r\nStalin's view has long been established in communist mythology. During the times of Khrushchev and\r\nBrezhnev, and as recently as Andropov and Chernenko, these accusations against the rest of the world were\r\nfrequently repeated. Under Gorbachev, much is changing in the Soviet Union, but Stalin's view about who\r\nstarted the war remains unchallenged. Lieutenant-General P. A. Zhilin, chief historian of the Soviet Army,\r\nrepeated during the Gorbachev era that 'the perpetrators of the war were not only the imperialists of\r\nGermany, but of the whole world'. (Red Star, 24 September 1985)............\r\n\r\nStalin understood that a powerful, aggressive army does not start a war by itself. A mad, fanatical leader is\r\nalso needed. Stalin did a great deal to see that just such a leader should appear at the head of the German\r\nnation. Once the fascists had come to power, Stalin persistently and doggedly pushed towards war. The high\r\npoint of these efforts was the Molotov–Ribbentrop pact. In this pact, Stalin guaranteed Hitler freedom of action\r\nin Europe and, in effect, opened the floodgates of the Second World War.\r\nEven before the Nazis came to power, the Soviet leaders had given Hitler the unofficial name of 'Icebreaker\r\nfor the Revolution'. The name is both apt and fitting. The communists understood that Europe would be\r\nvulnerable only in the event of war and that the Icebreaker for the Revolution could make it vulnerable.\r\nUnaware of this, Adolf Hitler cleared the way for world communism by his actions. With his Blitzkrieg wars,\r\nHitler crushed the Western democracies, scattering and dispersing his forces from Norway to Libya. This\r\nsuited Stalin admirably. The Icebreaker committed the greatest crimes against the world and humanity, and,\r\nin doing so, placed in Stalin's hands the moral right to declare himself the liberator of Europe at any time he \r\n\r\nchose – while changingthe concentration camps from brown to red.\r\nStalin understood better than Hitler that a war is won by the side which enters it last and not by the one\r\nwhich goes into it first. Stalin granted Hitler the doubtful honour of being the first, while he himself prepared\r\nfor his unavoidable entry into the war after 'all the capitalists (will) have fought amongst themselves'. (Stalin,\r\nVol. 6, p. 158)\r\n\r\nMuch has been done to uncover the crimes of Nazism and find the butchers who perpetrated atrocities in its\r\nname. This work must be continued and stepped up. But while unmasking fascists, one must also expose the\r\nSoviet communists who encouraged the Nazis to commit their crimes, so that they could avail themselves of\r\nthe results of these crimes.\r\nThe communists weeded their archives thoroughly a long time ago, but what still remains preserved there is\r\nalmost inaccessible to researchers. I was fortunate enough to work briefly in the archives of the Soviet\r\nMinistry of Defence, but quite intentionally I am making little use of secret archival material. Overt Soviet\r\npublications are my main source. Even these are quite sufficient to place Soviet communists in the dock with\r\nNazis.\r\nMy chief witnesses are Marx, Engels, Lenin, Trotsky, Stalin, and all the Soviet wartime marshals and many\r\nleading generals. The Soviet communists admit that they used Hitler to unleash a war in Europe, and\r\nprepared a sudden blow at Hitler himself in order to seize a Europe which had been destroyed by him. The\r\nvalue of my sources lies in the fact that it is the criminals themselves who speak of their own crimes.\r\nI know that on the communist side there are many apologists. I took the communists at their word, so let us\r\nallow them to defend themselves independently.\r\n\r\n--Viktor Suvorov--\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:5953cefd08b0def8b9a26540ac88bdf3db3d2d11","amp;dn":"ICEBREAKER+Who+Started+the+Second+World+War+-+Viktor+Suvorov+%5BEN","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5953cefd08b0def8b9a26540ac88bdf3db3d2d11","infoHashBuffer":{"type":"Buffer","data":[89,83,206,253,8,176,222,248,185,162,101,64,172,136,189,243,219,61,45,17]},"announce":[],"urlList":[]}}