{"title":"DOOM.2016.Closed.Multiplayer.Alpha","uid":13563947,"size":5686422519,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:59ab5e87e6b9110733745c3dc96f0aa4472b4d74&amp;dn=DOOM.2016.Closed.Multiplayer.Alpha&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":29,"time":1455603466,"description":"Install instructions:\r\nNote: Do not use your legit Steam account - you have been warned!\r\n- Make a throwaway Steam account (free) and login with it (have the Steam client running)\r\n- Run &quot;PlayDOOM.bat&quot; to play, server browser should work fine and list any active servers\r\n- To host a private match to make your server show up in the browser for other people, also make sure to disable dedicated server in match settings!\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\nCredits: Thanks to Dalles, Fantast1k and ayy64!\r\n\r\nTitle: DOOM\r\nGenre: Action\r\nDeveloper: id Software \r\nPublisher: Bethesda Softworks\t\r\nRelease Date: May 13, 2016\r\nStore page: http://store.steampowered.com/app/379720\r\n\r\nAbout This Game\r\nDeveloped by id software, the studio that pioneered the first-person shooter genre and created multiplayer Deathmatch, DOOM returns as a brutally fun and challenging modern-day shooter experience. \r\nRelentless demons, impossibly destructive guns, and fast, fluid movement provide the foundation for intense, first-person combat – whether you’re obliterating demon hordes through the depths of Hell in the single-player campaign, or competing against your friends in numerous multiplayer modes. \r\nExpand your gameplay experience using DOOM SnapMap game editor to easily create, play, and share your content with the world. \r\n\r\nSTORY: \r\nYou’ve come here for a reason. The Union Aerospace Corporation’s massive research facility on Mars is overwhelmed by fierce and powerful demons, and only one person stands between their world and ours. \r\nAs the lone DOOM Marine, you’ve been activated to do one thing – kill them all.\r\n\r\nKEY FEATURES:\r\nA Relentless Campaign \r\nThere is no taking cover or stopping to regenerate health as you beat back Hell’s raging demon hordes. Combine your arsenal of futuristic and iconic guns, upgrades, movement and an advanced melee system to knock-down, slash, stomp, crush, and blow apart demons in creative and violent ways. \r\n\r\nReturn of id Multiplayer \r\nDominate your opponents in DOOM’s signature, fast-paced arena-style combat. In both classic and all-new game modes, annihilate your enemies utilizing your personal blend of skill, powerful weapons, vertical movement, and unique power-ups that allow you to play as a demon. \r\n\r\nEndless Possibilities \r\nDOOM SnapMap – a powerful, but easy-to-use game and level editor – allows for limitless gameplay experiences on every platform. Without any previous experience or special expertise, any player can quickly and easily snap together and visually customize maps, add pre-defined or completely custom gameplay, and even edit game logic to create new modes. Instantly play your creation, share it with a friend, or make it available to players around the world – all in-game with the push of a button","torrent":{"xt":"urn:btih:59ab5e87e6b9110733745c3dc96f0aa4472b4d74","amp;dn":"DOOM.2016.Closed.Multiplayer.Alpha","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59ab5e87e6b9110733745c3dc96f0aa4472b4d74","infoHashBuffer":{"type":"Buffer","data":[89,171,94,135,230,185,17,7,51,116,92,61,201,111,10,164,71,43,77,116]},"announce":[],"urlList":[]}}