{"title":"James Braha - ebook - Living Reality - My Extraordinary Summer w","uid":9677612,"size":19936017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a0487465b9d7f55ad34bf8e6f1a96c791e7433c&amp;dn=James+Braha+-+ebook+-+Living+Reality+-+My+Extraordinary+Summer+w&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kipaloki","files":1,"time":1393593661,"description":"Living Reality: My Extraordinary Summer With &quot;Sailor&quot; Bob Adamson\n\n\nAfter thirty years of seeking liberation, James Braha had nearly given up on finding fulfilment. His mind began to change, however, when he encountered the Hindu/Vedic philosophy of non-duality. Upon reading &quot;Sailor&quot; Bob Adamson's book, &quot;What's Wrong with Right Now Unless You Think About It?&quot;, James immediately invited Bob to come from Australia to share his knowledge with Americans. \n\nFor five glorious weeks in the summer of 2004, Bob and his wife stayed with the Braha family at their home in Florida. Spiritual talk with arguably the greatest non-duality teacher alive continued from morning till night, as James' dearest friends and spiritualists from around the country joined the investigations into the truth of reality versus the illusion of appearance. \n\nThis is a story of liberation, friendship, humour, and love, as Sailor Bob takes spiritual aspirants beyond the need for help, just as Nisargadatta Maharaj did for him thirty years ago. It is one of the warmest, most heartfelt treatises on non-duality ever written.","torrent":{"xt":"urn:btih:5a0487465b9d7f55ad34bf8e6f1a96c791e7433c","amp;dn":"James+Braha+-+ebook+-+Living+Reality+-+My+Extraordinary+Summer+w","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a0487465b9d7f55ad34bf8e6f1a96c791e7433c","infoHashBuffer":{"type":"Buffer","data":[90,4,135,70,91,157,127,85,173,52,191,142,111,26,150,199,145,231,67,60]},"announce":[],"urlList":[]}}