{"title":"Frommer's Portable Cayman Islands","uid":5155116,"size":3733729,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a0b8ebec2089b81c82fe3612aaaa751a7717a31&amp;dn=Frommer%5C%27s+Portable+Cayman+Islands&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VasiaZozulia","files":-1,"time":1257799210,"description":"Frommer's portable Cayman Islands---See the very best of the Cayman Islands---On the beach at a fine resort or in the ocean petting a stingray, our expert authors guide you to your best Cayman Islands experience.\n\nDetailed maps throughout\n\n*\n\nExact prices, directions, opening hours,and other practical information\n*\n\nCandid reviews of hotels and restaurants,plus sights, shopping, and nightlife\n*\n\nInsider tips from local expert authors\n\n\n\n\nSummary: Author doesn't know what he's talking about IMO\nRating: 1\n\nWith the recent news about travel book writers copying from others and not really knowing the places they write about, this is one in my opinion. Example, based on the recommendation saying Rum Point was one of the best snorkeling spots with rainbow hued fish, my wife and I took a day from our time on 7 Mile Beach and drove there (long drive on the island). The beach itself was fine, no better than the beach we left, but the snorkeling was awful. I gave up trying to find the good spot myself and went to Red Sail Sports who operate boat tours (and snorkel trips) from there and said I'd heard this was a good snorkeling place. They responded &quot;only if you like sand, there isn't any good snorkeling here&quot;. Then they said guide books tout this place all the time and no one knows why, there is no good snorkeling. So is this another case, like I've recently read about in the news, where a travel writer doesn't experience the site itself and just copies from other books? Also one of the best things you can do here is Sting Ray City - covered in the book yes, but also not highly recommended by the authors - they are afraid of the string rays apparently.","torrent":{"xt":"urn:btih:5a0b8ebec2089b81c82fe3612aaaa751a7717a31","amp;dn":"Frommer%5C%27s+Portable+Cayman+Islands","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a0b8ebec2089b81c82fe3612aaaa751a7717a31","infoHashBuffer":{"type":"Buffer","data":[90,11,142,190,194,8,155,129,200,47,227,97,42,170,167,81,167,113,122,49]},"announce":[],"urlList":[]}}