{"title":"[E-book-Ita-poliziesco]Il cane di terracotta","uid":4560432,"size":726706,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a35ad98623b789d7a57558f8ce0340a1e0ea967&amp;dn=%5BE-book-Ita-poliziesco%5DIl+cane+di+terracotta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mitimex","files":1,"time":1228660529,"description":"Il romanzo si avvia su una tipica indagine per la repressione di un traffico d&amp;#039;armi d&amp;#039;origine mafiosa ma l&amp;#039;argomento principale diventa poi un episodio di amore e morte di un tempo ormai passato. Come la caverna che nasconde le armi cela un altro nascondiglio dove giacciono i due amanti assassinati, cosÃƒÂ¬ il racconto contiene al suo interno un&amp;#039;altra storia del tutto diversa.\nTutto il romanzo ruota intorno a una misteriosa caverna che appare e che scompare e che una volta ritrovata rivelerÃƒÂ  di custodire un altro segreto. Montalbano mantiene una strana amicizia per un poliziotto: quella con GegÃƒÂ¨, protettore di prostitute, che gli ha fissato un appuntamento in un luogo che, sin dai tempi delle scuole elementari,conoscono soltanto loro due.\nGegÃƒÂ¨ gli riferisce che Tanu &quot;u grecu&quot;, pluriomicida latitante, vuole consegnarsi a Montalbano. Tanu ÃƒÂ¨ un mafioso da sempre ma ora si sente estraneo alla nuova mafia che non rispetta piÃƒÂ¹ regole e tradizioni, per cui preferisce morire in galera piuttosto che in un fosso. Si consegnerÃƒÂ  a Montalbano ma con un po&amp;#039; di triatro, una sceneggiata dell&amp;#039;arresto, per salvare la faccia.\nMa la mafia non si fa prendere in giro e in occasione di un trasferimento da un carcere ad un altro ritenuto piÃƒÂ¹ sicuro, due agenti di scorta vengono uccisi e Tanu ferito mortalmente. Ma la cosa piÃƒÂ¹ grave non ÃƒÂ¨ tanto la sconfitta della polizia quanto il fatto che l&amp;#039;accaduto conferma che ci sia una &quot;talpa&quot; al suo interno. Tanu in punto di morte, per vendicarsi confiderÃƒÂ  a Montalbano l&amp;#039;esistenza di un grosso traffico d&amp;#039;armi che vengono depositate in una caverna mimetizzata che la squadra del commissario farÃƒÂ  fatica a scoprire.\nIl preside Burgio, ormai in pensione e amico di Montalbano gli rivelerÃƒÂ  che la grotta ha una lunga storia che risale a tempi lontani. Questo racconto farÃƒÂ  tornare il commissario nella grotta e scoprire una parete posticcia che abbattuta rivela la presenza di due cadaveri sorvegliati da un cane di terracotta...\n","torrent":{"xt":"urn:btih:5a35ad98623b789d7a57558f8ce0340a1e0ea967","amp;dn":"%5BE-book-Ita-poliziesco%5DIl+cane+di+terracotta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a35ad98623b789d7a57558f8ce0340a1e0ea967","infoHashBuffer":{"type":"Buffer","data":[90,53,173,152,98,59,120,157,122,87,85,143,140,224,52,10,30,14,169,103]},"announce":[],"urlList":[]}}