{"title":"Mariah Carey feat. Nicki Minaj - Up Out My Face  (2nafish)","uid":5323056,"size":186900484,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5a4f00d06ceae86454606d03a6e02ba277c31cab&amp;dn=Mariah+Carey+feat.+Nicki+Minaj+-+Up+Out+My+Face++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1264932046,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Up Out My Face (Remix)&quot; is a song performed by American R&amp;B singer Mariah Carey, from her upcoming remix album Angels Advocate. The song is produced and written by Mariah Carey, The-Dream and Christopher &quot;Tricky&quot; Stewart. The song also features rapper/singer, Nicki Minaj.\n\nA music video was shot in December 2009, along with the video for &quot;Angels Cry (Remix)&quot; featuring Ne-Yo. Both videos were co-directed by Carey and her husband Nick Cannon. They premiered together on VEVO.com on January 27, 2010. Cannon makes a cameo in the video in a reference to his 2002 film, Drumline. In a review of the video, Chris Ryan of MTV News said, &quot;No offense to the imperfect angel or anything, but Nicki kinda steals the show here, dressed up like Nurse Barbie, referencing Trey Songz' &quot;LOL&quot; in a British accent, she basically pops balloons all over this thing.&quot;\n\nThe song officially impacted Rhythmic and Urban radio on January 26, 2010.\n\nThe original version of the song featured no guest vocals and was featured on Memoirs of an Imperfect Angel. The remix version clocks in at 4:37 due to additional verses from Nicki Minaj. The version used in the video also adds &quot;Up Out My Face (the Reprise)&quot; from Memoirs to the end of the song bringing the new song length to 5:29.\n\nAlison Stewart from the Washington Post gave the song a positive review, stating: &quot;Sometime in the past six months, Minaj became the go-to girl for artists who wanted to add some skank to their tracks without sullying themselves in the process. Here, she enlivens an otherwise polite track from Carey's upcoming remix disc&quot;.\n\nIn the chart week of January 28, 2010 the song debuted at 97 on the U.S. Hot R&amp;B/Hip Hop Songs chart. With the entry, Carey extends her lead as the female artist with the most consecutive yearly R&amp;B/Hip Hop Song chart debuts. &quot;Up Out My Face (remix)&quot; with Nicki Minaj (2010) brings her total of chart debuts to 21 since &quot;Vision of Love&quot; (1990).\n\nOnika Maraj (born December 8, 1984), better known by her stage name Nicki Minaj, is an American rapper and singer. In August 2009, Minaj signed to Young Money Entertainment with distributution from Universal Motown wherein she will release her debut studio album in 2010.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:5a4f00d06ceae86454606d03a6e02ba277c31cab","amp;dn":"Mariah+Carey+feat.+Nicki+Minaj+-+Up+Out+My+Face++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a4f00d06ceae86454606d03a6e02ba277c31cab","infoHashBuffer":{"type":"Buffer","data":[90,79,0,208,108,234,232,100,84,96,109,3,166,224,43,162,119,195,28,171]},"announce":[],"urlList":[]}}