{"title":"Chuck Season 1 (One) Every Episode in HDTV XviD! sSj","uid":4479277,"size":4738365738,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5a8f6c9fbefc2bcd386e3ea457478dcec068a552&amp;dn=Chuck+Season+1+%28One%29+Every+Episode+in+HDTV+XviD%21+sSj&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sharadjalota456","files":1,"time":1225486710,"description":"Chuck is an action-comedy television program from the United States created by Josh Schwartz and Chris Fedak. The series is about an &quot;average computer-whiz-next-door&quot; who receives an encoded e-mail from an old college friend now working in the CIA; the message embeds the only remaining copy of the world&amp;#039;s greatest spy secrets into Chuck&amp;#039;s brain.\n\nSeason 1, Episode 1: Pilot\n\nChuck is a computer geek who gets a computer full of information zapped into his brain...information that contains secrets that the federal government desperately needs to keep in Chuck&amp;#039;s head...and keep Chuck, himself, intact. In the opener Chuck meets a woman who agrees to go on a date with him, but she&amp;#039;s one of the government agents who&amp;#039;s interested more in his head than his body.\n\nSeason 1, Episode 2: Chuck Versus the Helicopter\n\nThe Government wants to verify the secrets are inside Chuck&amp;#039;s head. So they send a doctor who programmed the Intersect system to examine Chuck. When the doctor&amp;#039;s car explodes. There&amp;#039;s evidence one of the agencies was involved, leaving Chuck unsure whom to trust.\n\nSeason 1, Episode 3: Chuck Versus the Tango\n\nA stolen piece of art is the key for locating a weapon&amp;#039;s dealer. Chuck&amp;#039;s up for a promotion to assistant manager at work.\n\nSeason 1, Episode 4: Chuck Versus the Wookie\n\nA rival agent shows up, she needs assistance stealing a gem from a drug lord. Chuck&amp;#039;s agents are reluctant to help due to past dealings.\n\nSeason 1, Episode 5: Chuck Versus the Sizzling Shrimp\n\nChuck spots a Chinese spy in a restaurant. The agents want to find out why she&amp;#039;s here in the US. Chuck goes on his first stake out, which is also a special occasion for his family.\n\nSeason 1, Episode 6: Chuck Versus the Sandworm\n\nChuck spots a man wanted by the government. He finds out the man worked for the government, and just desired a new life. Soon he has Chuck doubting his handlers. Chuck has to interview for Assistant Manager.\n\nSeason 1, Episode 7: Chuck Versus the Alma Mater\n\nWhen Chuck&amp;#039;s former Stanford teacher, who kicked him out of school, is kidnapped, Chuck must face his past by returning to Standford, and recover a disc with information about his past.\n\nSeason 1, Episode 8: Chuck Versus the Truth\n\nChuck meets a pretty girl with an unusual name, which causes an internal conflict. At the same time, his sister falls prey to someone the government seeks to apprehend.\n\nSeason 1, Episode 9: Chuck Versus the Imported Hard Salami\n\nAfter breaking up with Sarah, Chuck starts dating Lou. When Chuck flashes on Lou&amp;#039;s ex-boyfriend. He&amp;#039;s conflicted between his current love interest and his duties. The agents intercept the shipment, and find something totally unexpected.\n\nSeason 1, Episode 10: Chuck Versus the Nemesis\n\nBryce is alive. When he&amp;#039;s revived the only person he wants to talk to is Chuck. He tells Chuck he wasn&amp;#039;t rogue, and the people he was working for are after the Intersect. It&amp;#039;s up to Team Chuck to bring Bryce in, and protect Bryce and Chuck.\n\nSeason 1, Episode 11: Chuck Versus the Crown Vic\n\nChuck flashes on a counterfeit bill on a philanthropists yacht. Team Chuck goes undercover to determine what he&amp;#039;s up to. Chuck&amp;#039;s inexperience causes problems. Morgan meets Anna&amp;#039;s parents. Casey receives major news that will affect the entire Team.\n\nSeason 1, Episode 12: Chuck Versus the Undercover Lover\n\nWhen an old flame from Casey&amp;#039;s life shows up, there&amp;#039;s big trouble ahead for the whole crew.\n\nSeason 1, Episode 13: Chuck Versus the Marlin\n\nChuck finds a bug in the Buy More, and gives it to Casey. Neither of his handlers planted that particular bug. Fearing Chuck&amp;#039;s cover has been exposed, the government prepares to bring him in. While the agents try to find the culprit, Chuck tries to find an engagement ring Devon asked him to hold until Devon can propose to Ellie.","torrent":{"xt":"urn:btih:5a8f6c9fbefc2bcd386e3ea457478dcec068a552","amp;dn":"Chuck+Season+1+%28One%29+Every+Episode+in+HDTV+XviD%21+sSj","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a8f6c9fbefc2bcd386e3ea457478dcec068a552","infoHashBuffer":{"type":"Buffer","data":[90,143,108,159,190,252,43,205,56,110,62,164,87,71,141,206,192,104,165,82]},"announce":[],"urlList":[]}}