{"title":"Yanks 1979(multi-Subs)(2Lions-Team)","uid":5520174,"size":4682015027,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5aeb81df13b2b41e762e6620e06406074014a748&amp;dn=Yanks+1979%28multi-Subs%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JUULTJE","files":-1,"time":1272574355,"description":"Yanks (1979)\n\nAlternatieve titel: De Bevrijders \n\nVerenigde Staten / West-Duitsland / Verenigd Koninkrijk\nDrama / Oorlog\n141 minuten\n\ngeregisseerd door John Schlesinger\nmet Vanessa Redgrave, Richard Gere en Lisa Eichhorn\n\nHet is nog voor de inval in Europa wanneer de in Engeland gestationeerde Amerikaanse soldaten vertier zoeken onder de voornamelijk vrouwelijke bevolking. De jonge vrouwen Helen, Mollie en Jean raken tot over hun oren verliefd op een drietal Amerikanen en ze trekken met elkaar op, totdat de oorlog de drie koppels ruw uit elkaar haalt.\n\n\nIt is 1943 and streams of American soldiers are stationed in England awaiting orders for the D-Day Invasion, the end of World War II. Three soldiers and their involvement with three English women of different social classes metaphorically represent the larger relationship between England and America. The main story is about American Sgt. Matt Dyson (Richard Gere), and British girl Jean Moreton (Lisa Eichhorn). Dyson is a cook whose ambition is to return to America and establish a chain of Motels, whereas Jean seems satisfied to wait for her childhood boyfriend Ken (Derek Thompson) to return so they can start a family and a life together. The second romance concerns Officer John (William Devane) and his extramarital affair with Helen (Vanessa Redgrave), a socialite with an absent husband and troubled young son in boarding school. The third couple featured is about Sgt. Danny Ruffelo (Chick Vennera) and Mollie (Wendy Morgan) and their romance. The Americans experience a certain prejudice from the English and this reaches a climax at a New Year's dance where some of the White English women dance with some of the Black American Soldiers resulting in a brawl that leaves the couples at odds with each other. The American attitude voiced by Danny seems to be stick with your own kind, whereas the British attitude voiced by Jean is no one should be an outcast because of skin color. Eventually word comes that the war has ended and the Americans leave behind mixed memories of their stay\n\nWeblink http://www.imdb.com/title/tt0080157/\nWeblink http://www.moviemeter.nl/film/12428\n\nVideo                 : DVD Rip\nAudio                 : Engels Duits Frans Italiaans Spaans\nSubs                  : Engels Frans Nederlands Zweeds Fins Portugees Pools\nID                    : 0xE0\nFormat                : MPEG Video\nFormat version        : Version 2\nBit rate mode         : Variable\nWidth                 : 720 pixels\nHeight                : 576 pixels\nDisplay aspect ratio  : 16:9\nFrame rate            : 25.000 fps\nStandard              : PAL\nCover                 : Yes\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n","torrent":{"xt":"urn:btih:5aeb81df13b2b41e762e6620e06406074014a748","amp;dn":"Yanks+1979%28multi-Subs%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aeb81df13b2b41e762e6620e06406074014a748","infoHashBuffer":{"type":"Buffer","data":[90,235,129,223,19,178,180,30,118,46,102,32,224,100,6,7,64,20,167,72]},"announce":[],"urlList":[]}}