{"title":"An Introduction to Medicinal Chemistry, 5E [PDF] [StormRG]","uid":10251816,"size":22567133,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5af5588f63721206ec55512e81e4542949c2e38e&amp;dn=An+Introduction+to+Medicinal+Chemistry%2C+5E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0xmovva","files":-1,"time":1401361672,"description":"Author: Graham L. Patrick \nPaperback: 848 pages\nPublisher: Oxford University Press; 5 edition (March 1, 2013)\nLanguage: English\nISBN-10: 0199697396\nISBN-13: 978-0199697397\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nAn Introduction to Medicinal Chemistry is the leading text for university courses on this subject. Renowned for being a textbook loved equally by both students and lecturers, it presents complete coverage in an accessible and engaging style. \n\nThe text begins with the essential biochemistry on which an understanding of medicinal chemistry is built, introducing the structure and function of important drug targets. It then explores how drugs interact with the body and the consequences of those reactions. There is a section on general principles and strategies involved in discovering and designing new drugs, and another on useful 'tools of the trade'. The text ends with a contemporary look at specific topics within medicinal chemistry, for example, antiviral and anticancer agents; cholinergics and anticholinesterases; and antiulcer agents.\n\nLearning features throughout An Introduction to Medicinal Chemistry help to unlock this fascinating subject. A glossary helps to familiarise the language of medicinal chemistry. Boxes present in-depth material and explore how concepts are applied in practice. Key points summarise sections within chapters, providing a basis for revision, and questions at the end of chapters and on the accompanying Online Resource Centre allow the reader to test their understanding and develop molecular modelling skills.","torrent":{"xt":"urn:btih:5af5588f63721206ec55512e81e4542949c2e38e","amp;dn":"An+Introduction+to+Medicinal+Chemistry%2C+5E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5af5588f63721206ec55512e81e4542949c2e38e","infoHashBuffer":{"type":"Buffer","data":[90,245,88,143,99,114,18,6,236,85,81,46,129,228,84,41,73,194,227,142]},"announce":[],"urlList":[]}}