{"title":"Stanley Turrentine - 1963 - A Chip Off The Old Block (2008) FLAC","uid":8518702,"size":340867182,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5b63323e6f678845d3c81481c7a104db45d2f802&amp;dn=Stanley+Turrentine+-+1963+-+A+Chip+Off+The+Old+Block+%282008%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1369843541,"description":"Stanley Turrentine - 1963 - A Chip Off The Old Block (2008)\n\nThe circumstances surrounding the recording of this album are as important as the music you will hear and enjoy. Inspired by the songbook of Count Basie, tenor saxophonist Stanley Turrentine and his wife of four years, organist Shirley Scott, planned on recording with a septet, and went into the studio with that band on October 12, 1963, but those sessions were scrapped. On October 14, two tracks were finished and included here, but October 21 saw the band pared down to a quintet, and the results were acceptable. Trumpeter Blue Mitchell's contributions were quite desirable, he was the second lead voice in the ensemble, and success was attained. Turrentine and Mitchell played together in the 1954 edition of the Earl Bostic ensemble, and happily renew their musical friendship. The Basie evergreen &quot;One O'Clock Jump&quot; leads off the date swinging with Turrentine and Mitchell trading melody lines before an outstanding solo from the trumpeter. A first take from the larger ensemble is described by Bob Blumenthal in the liner notes as ragged, but perhaps further attempts would have smoothed out the scruffy mood. The tenor man sounds as if he is feeding the melody line to trombonist Tom McIntosh and baritone saxophonist Charles Davis ad lib instead of reading charts, although it doesn't sound all that uninspired. Neal Hefti's &quot;Cherry Point&quot; with the quintet is an easy swinging, tenor/organ trade off, in a much slower tempo with the septet, two minutes longer, a bit sluggish, perhaps too rich, but soulfully coming together at the coda. Dedicated to Nashville DJ Hoss Allen, the classic road time shuffle &quot;Blues in Hoss' Flat&quot; chips off many familiar phrases in the main frame, while Hefti's simmering &quot;Midnight Blue&quot; (not Kenny Burrell's version that Turrentine also played on) gives Scott room to subtract one color and shade the unison melody with the tenor and trumpeter. The lone ballad &quot;Spring Can Really Hang You Up the Most&quot; emphasizes Turrentine's soul quotient with Mitchell offering a marvelous countermelody. The spare approach of Basie is hard to ignore, and though not essential in Turrentine's discography, it is an interesting item that showcases his lighter side positively. (AllMusic)\n\nTrack list:\n\n01 - One O'Clock Jump\n02 - Midnight Blue\n03 - Blues In Hoss' Flat\n04 - Spring Can Really Hang You Up The Most\n05 - Cherry Point\n06 - One O'Clock Jump (First Version)\n07 - Cherry Point (First Version)\n\nAl Harewood (Drums)\nBlue Mitchell (Trumpet)\nEarl May (Bass)\nStanley Turrentine (Sax (Tenor))\nTom McIntosh (Trombone)\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:5b63323e6f678845d3c81481c7a104db45d2f802","amp;dn":"Stanley+Turrentine+-+1963+-+A+Chip+Off+The+Old+Block+%282008%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b63323e6f678845d3c81481c7a104db45d2f802","infoHashBuffer":{"type":"Buffer","data":[91,99,50,62,111,103,136,69,211,200,20,129,199,161,4,219,69,210,248,2]},"announce":[],"urlList":[]}}