{"title":"The Divided Mind - The Epidemic of Mindbody Disorders","uid":9759786,"size":813314755,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5bfa8f468e163ff528c84252cc8acda7742fc9f7&amp;dn=The+Divided+Mind+-+The+Epidemic+of+Mindbody+Disorders&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":69,"time":1394795995,"description":"The Divided Mind - The Epidemic of Mindbody Disorders\n\nBiography\nJohn E. Sarno, M.D., is Professor of Clinical Rehabilitation Medicine, New York University School of Medicine, and attending physician at the Howard A. Rusk Institute of Rehabilitation Medicine, New York University Medical Center.\n\nThe book that will change the way we think about health and illness, The Divided Mind is the crowning achievement of Dr. John E. Sarno's distinguished career as a groundbreaking medical pioneer, going beyond pain to address the entire spectrum of psychosomatic (mindbody) disorders.\n\nThe interaction between the generally reasonable, rational, ethical, moral conscious mind and the repressed feelings of emotional pain, hurt, sadness, and anger characteristic of the unconscious mind appears to be the basis for mindbody disorders. The Divided Mind traces the history of psychosomatic medicine, including Freud's crucial role, and describes the psychology responsible for the broad range of psychosomatic illness. The failure of medicine's practitioners to recognize and appropriately treat mindbody disorders has produced public health and economic problems of major proportions in the United States.\n\nOne of the most important aspects of psychosomatic phenomena is that knowledge and awareness of the process clearly have healing powers. Thousands of people have become pain-free simply by reading Dr. Sarno's previous books. How and why this happens is a fascinating story, and is revealed in The Divided Mind.","torrent":{"xt":"urn:btih:5bfa8f468e163ff528c84252cc8acda7742fc9f7","amp;dn":"The+Divided+Mind+-+The+Epidemic+of+Mindbody+Disorders","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bfa8f468e163ff528c84252cc8acda7742fc9f7","infoHashBuffer":{"type":"Buffer","data":[91,250,143,70,142,22,63,245,40,200,66,82,204,138,205,167,116,47,201,247]},"announce":[],"urlList":[]}}