{"title":"The Theban Oracle: Discover the Magic of the Ancient Alphabet Th","uid":12861737,"size":3176406,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c434d377f4b9599ad67e72a23845b2c4dcd20b0&amp;dn=The+Theban+Oracle%3A+Discover+the+Magic+of+the+Ancient+Alphabet+Th&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1448745306,"description":"The Theban Oracle: Discover the Magic of the Ancient Alphabet That Changes Lives | EPUB\r\n\r\n\r\n\r\nBased on the ancient magical writings of 14th-century magus, Honorius of Thebes, the Theban Oracle is a codex employed for centuries as a means of devotion and divination. Used by such masters of the occult sciences as Heinrich Cornelius Agrippa, Dr. John Dee, Francis Barrett, and later Gerald Gardner, it has remained relatively obscure and elusive to the modern practitioner. Until now.\r\nIn this book, author Greg Jenkins, PhD, offers both the complete history of this medieval magical system and a working manual for the modern mage to utilize it. In these pages, you'll find:\r\nHow to make and care for your own set of stones.\r\nA variety of methods for divination, from using just one stone to using nine stones and more.\r\nHow to use the Theban stones for spellcasting, including love and purification spells and Theban incense and candle magick.\r\nA complete lexicon of the Theban alphabet with a who's who of Theban history along with divinatory meanings and how they relate to the modern world.\r\nA quick reference to the sacred herbs and angelic orders associated with each symbol.\r\nPrepare yourself to discover the hidden mysteries of the ancients and the magick within you.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:5c434d377f4b9599ad67e72a23845b2c4dcd20b0","amp;dn":"The+Theban+Oracle%3A+Discover+the+Magic+of+the+Ancient+Alphabet+Th","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c434d377f4b9599ad67e72a23845b2c4dcd20b0","infoHashBuffer":{"type":"Buffer","data":[92,67,77,55,127,75,149,153,173,103,231,42,35,132,91,44,77,205,32,176]},"announce":[],"urlList":[]}}