{"title":"Through.The.Eyes.Of.A.Pro.Advanced.Techniques.For.Canon.DSLR.Pho","uid":4076333,"size":3901090281,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5c6f8ca485dd4cb3de3e7d26e35a45dd35052a5e&amp;dn=Through.The.Eyes.Of.A.Pro.Advanced.Techniques.For.Canon.DSLR.Pho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"waygeekierthanu","files":1,"time":1205333646,"description":"During the course of these two volumes, we follow Tim on a stock photo shoot, an outdoor portrait session, a wildlife shoot, and a little league game. In all these situations Tim explains the challenges faced and how to overcome them.\n\nThroughout the presentation, Tim shares experiences and techniques gained over twenty years of shooting athletes, sporting events, weddings, as well as commercial and personal assignments. Hundreds of his photos are included in these DVDs.\n\nBlue Crane Digital has published a two-volume set geared to owners of Nikon DSLRs and another set of volumes for Canon shooters.\n\nView some of Tim&amp;#039;s work here: http://www.mantoani.com\n\nDuring the combined running time of three and one-half hours, Volumes 1 and 2 present the viewer with a structure for developing solid photographic skills. Several photo assignments are presented, along with Tim&amp;#039;s approach to making a great image. Tim also discusses lenses, meters, tripods, and other accessories.\n\nIf you own a Digital SLR, even if it is not a Canon or Nikon, the first two volumes in this series can help improve your photography. Spend a few hours with this remarkable photographer and teacher, and see the world through Tim&amp;#039;s eyes.\n\nThese DVDs are not technical discussions of camera settings. They are aimed at helping photographers see and think about the decisions that make great photographs. If you need help learning how to operate your camera, please refer to other DVDs on this site.\n\nThis is Volume II ONLY!\n\nFor Volume I, go here: http://thepiratebay.se/tor/4064821/Through_The_Eyes_Of_A_Pro_Advanced_Techniques_For_Canon_DSLR_Pho","torrent":{"xt":"urn:btih:5c6f8ca485dd4cb3de3e7d26e35a45dd35052a5e","amp;dn":"Through.The.Eyes.Of.A.Pro.Advanced.Techniques.For.Canon.DSLR.Pho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c6f8ca485dd4cb3de3e7d26e35a45dd35052a5e","infoHashBuffer":{"type":"Buffer","data":[92,111,140,164,133,221,76,179,222,62,125,38,227,90,69,221,53,5,42,94]},"announce":[],"urlList":[]}}