{"title":"[DVDRip-XviD-TRL-ita]The Air I Breathe 2007","uid":4719144,"size":733921307,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5d7d37cd6678d054a3856dd3dd907ee73a0f5e66&amp;dn=%5BDVDRip-XviD-TRL-ita%5DThe+Air+I+Breathe+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"benzo85","files":2,"time":1234435587,"description":"&quot;The Air I Breathe&quot; si basa su un proverbio asiatico che analizza la vita attraverso quattro chiavi emozionali : la felicitÃƒÂ , il dolore, il piacere e l'amore. Il film ÃƒÂ¨ composto proprio da 4 ritratti ognuno dei quali incarna e rappresenta queste emozioni. La storia centrale ruota attorno alla relazione amorosa tra Pleasure (Brendan Fraser), un gangster e Sorrow (Sarah Michelle Gellar), giovane e bellissima cantante. Quando Sorrow entra in affari con Fingers (Andy Garcia), un potente boss che vuole allargare la sua influenza nel campo dello spettacolo, Pleasure entrerÃƒÂ  in conflitto con lei e dovrÃƒÂ  scegliere se seguire il suo cuore. Poi c'ÃƒÂ¨ la storia di Happiness (Forest Whitaker), uo scontento banchiere che sta disperatamente cercando una fuga dalle sue lunghe e monotone giornate.Dopo aver preso un importante prestito ed aver perso tutto nel gioco d'azzardo con Fingers, Happiness si troverÃƒÂ  di fronte ad un bivio e scegliere se accettare passivamente il suo destino oppure confrontarsi con le sue paure. Infine la storia di Love (Kevin Bacon), un appassionato medico innamorato di Gina (Julie Delpy), la moglie del suo migliore amico. Quando un incidente nel laboratorio riduce in fin di vita Gina, che puÃƒÂ² essere salvata solo da una trasfusione, Love inizia una disperata corsa contro il tempo in quanto il gruppo sanguinio di Gina ÃƒÂ¨ estremamente raro. Questa vicenda porterÃƒÂ  porterÃƒÂ  ad un fatale incrocio di destini tra Sorrow, Pleasure, Love, Happiness and Fingers. \n","torrent":{"xt":"urn:btih:5d7d37cd6678d054a3856dd3dd907ee73a0f5e66","amp;dn":"%5BDVDRip-XviD-TRL-ita%5DThe+Air+I+Breathe+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d7d37cd6678d054a3856dd3dd907ee73a0f5e66","infoHashBuffer":{"type":"Buffer","data":[93,125,55,205,102,120,208,84,163,133,109,211,221,144,126,231,58,15,94,102]},"announce":[],"urlList":[]}}