{"title":"NubileFilms - Paula (My Love) NEW 27 December 2015","uid":13100844,"size":277523302,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5da7805fd960a2ec79090b6d9f62b67767906b2c&amp;dn=NubileFilms+-+Paula+%28My+Love%29+NEW+27+December+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1451227970,"description":"Paula knows she's looking hot as she struts her stuff on a windy day. When Dan comes to greet her, the wind has given him a tantalizing view of her ass and panties beneath her miniskirt. Ever the gentleman, Dan offers Paula his jacket for the walk home so that no one else can enjoy the goods that are exclusively his.The second they get in the house, their lips are locked as they make their way towards the bed. Dan helps Paula with the zip on her dress, making it easy to slide the loose material off of her slender body so that he can worship her curves properly. When Dan gets down on his belly and buries his face in Paula's smooth pussy, her moans of pleasure are long and unashamed at the magic he is working with his tongue.After enjoying his pussy feast for a few minutes, Dan takes things a step further by pressing first one finger and then two into Paula's needy twat. The couple gets flexible when Paula rolls onto her shoulders with her ass held in the air for Dan's pleasure. He continues his leisurely exploration of her creamy twat with his tongue, hitting all the right spots to drive her to the brink of sensual madness and then push her over the edge...\r\nTags: Big Boobs, Shaved Pussy, Brunette, Long hair, Panties, Hardcore, Outdoors, High Heels, Girl-Boy, Blowjob, European, Girls Finishing the Job, Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=24764724110613957702.jpg\r\n \nhttp://imgdone.com/viewer.php?file=76002416961716657381.jpg","torrent":{"xt":"urn:btih:5da7805fd960a2ec79090b6d9f62b67767906b2c","amp;dn":"NubileFilms+-+Paula+%28My+Love%29+NEW+27+December+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5da7805fd960a2ec79090b6d9f62b67767906b2c","infoHashBuffer":{"type":"Buffer","data":[93,167,128,95,217,96,162,236,121,9,11,109,159,98,182,119,103,144,107,44]},"announce":[],"urlList":[]}}