{"title":"BBC Long Shadow - 2. Ballots and Bullets - GHOST DOG","uid":11156015,"size":1065391239,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:5f8e0d0bec5930bbc6ebb359e1c23dbc5ecdf440&amp;dn=BBC+Long+Shadow+-+2.+Ballots+and+Bullets+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"marxph","files":2,"time":1412383645,"description":"David Reynolds traces the legacy of the Great War across 100 years and 10 different countries, examining how the war haunted a generation and shaped the peace that followed.\n\nPart 2: Ballots and Bullets\n\nDavid Reynolds examines the intriguing paradox of the Great War - that it was not caused by profound political or ideological divisions but did create them in its wake. He looks at how the conflict made politics red hot, giving birth to an age of turbulent mass democracy.\n\nDemocracy, Reynolds argues, hit postwar Europe like a big bang. He traces how, in the immediate aftermath of war, monarchies toppled, the people rose up and three iconic leaders - Vladimir Lenin, Woodrow Wilson and Benito Mussolini - emerged with competing visions of people-power that polarised much of continental Europe between right and left in the 1920s and 1930s.\n\nDavid Reynolds explores why Britain's experience was very different. In Britain the socialist Labour Party could be absorbed into the political mainstream and how the monarchy under crusty King George V was repackaged as a symbol of the nation.\n\nFor Britain this was an era of political coalitions headed by Stanley Baldwin and Ramsay MacDonald, parliamentarians who reached for the centre ground and quietly squeezed out extremists like Oswald Mosley and also charismatic politicians like Winston Churchill.\n\nThrough richly visual sequences comparing the experience of France, Italy and Britain, at locations including the battlefield of Caporetto now in Slovenia, the National Assembly in Paris and Buckingham Palace in London, this film re-examines the explosive impact of the Great War on European politics.\n &lt;a href=&quot;\nhttp://www.tvrage.com/shows/id-44987&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tvrage.com/shows/id-44987&lt;/a&gt;\n\nGeneral info\n\nRipper: marxph\nSource: WEB-DL\nFile Format: MP4\nDuration: 00:59:12\nBit Rate: 2399Kbps\nFile Size: 1016.00 MB\n\nVideo\n\nVideo Codec: h264\nVideo Bitrate: 2271Kbps\nVideo Size: 1280x720\nAspect Ratio: 1.78:1\nFrame Rate: 25.00fps\n\nAudio\n\nAudio Codec: AAC\nAudio Bitrate: 128K\nTrack: 2\nSample Rate: 48kHz\n\n\nghost dog...","torrent":{"xt":"urn:btih:5f8e0d0bec5930bbc6ebb359e1c23dbc5ecdf440","amp;dn":"BBC+Long+Shadow+-+2.+Ballots+and+Bullets+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f8e0d0bec5930bbc6ebb359e1c23dbc5ecdf440","infoHashBuffer":{"type":"Buffer","data":[95,142,13,11,236,89,48,187,198,235,179,89,225,194,61,188,94,205,244,64]},"announce":[],"urlList":[]}}