{"title":"WILHELM REICH - The Mass Psychology of Fascism.pdf","uid":4957740,"size":843388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fa1ba9cf16cdba7ab33787de3439a2af505d311&amp;dn=WILHELM+REICH+-+The+Mass+Psychology+of+Fascism.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"britishpatriot001","files":1,"time":1245183538,"description":"In this classic study, Reich provides insight into the phenomenon of fascism, which continues to ravage the international community in ways great and small. Drawing on his medical experiences with men and women of various classes, races, nations, and religious beliefs, Reich refutes the still generally held notion that fascism is a specific characteristic of certain nationalities or a political party ideology that is imposed on innocent people by means of force or political manoeuvres. &quot;Fascism on only the organized political expression of the structure of the average man's character. It is the basic emotional civilization and its mechanistic-mystical conception of life.&quot; Wilhelm Reich. Responsibility for the elimination of fascism thus results with the masses of average people who might otherwise support and champion it. \n\nAbout the Author\nWilhelm Reich was one of the great psychoanalysts of the twentieth-century. He worked as a psychoanalyst in Vienna and became deputy director of Freud s Psychoanalytic Polyclinic. He moved to Berlin in 1930 but left Germany in 1933 when Hitler came to power and in 1939 he moved to the USA. Wilhelm Reich died in 1957.\n\nAs a result of writing the book, Reich was kicked out of the Communist Party of Germany . The book was banned by the Nazis when they came to power. He realized he was in danger and hurriedly left Germany disguised as a tourist on a ski trip to Austria. Reich was expelled from the International Psychoanalytical Association in 1934 for political militancy","torrent":{"xt":"urn:btih:5fa1ba9cf16cdba7ab33787de3439a2af505d311","amp;dn":"WILHELM+REICH+-+The+Mass+Psychology+of+Fascism.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fa1ba9cf16cdba7ab33787de3439a2af505d311","infoHashBuffer":{"type":"Buffer","data":[95,161,186,156,241,108,219,167,171,51,120,125,227,67,154,42,245,5,211,17]},"announce":[],"urlList":[]}}