{"title":"The Charles Dickens TV Drama Series Collection  (BBC)","uid":6681646,"size":20644365600,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5fd52282344ebc5521c26f1abf45163161ac23f2&amp;dn=The+Charles+Dickens+TV+Drama+Series+Collection++%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":15,"time":1316216632,"description":"The Pickwick Papers (1985)\n\nNigel Stock stars as Mr. Pickwick in this colourful BBC adaptation of Charles Dickens' first and much-loved best-seller about the chaotic and amusing adventures of the Pickwick Club, consisting of Mr. Pickwick and his companions.\n\nOliver Twist (1985)\n\nOne of the most faithful productions of Dickens' favourite tale - with an authentic and compulsive twist to an old and classic tale.\n\nA Christmas Carol (1977)\n\nFirst broadcast in 1977, repeated in 1993 with a stunning cast, the perennial favourite morality tale is vividly brought to life by Michael Hordern as Scrooge, with John le Mesurier and Bernard Lee.\n\nMartin Chuzzlewit (1994)\n\nMartin Chuzzlewit is a wealthy old man. But who will inherit his riches? He has disinherited his grandson, young Martin, suspecting the motives of the young man's love for Mary, Chuzzlewit's nurse and companion. With such a prize to play for, the rest of his family - including the snivelling hypocrite Pecksniff and the fabulously evil Jonas - bring forth all of their cunning, greed and selfishness. With his grandson floundering in America, these increasingly desperate relatives close in on the vulnerable old man.\n\nDavid Copperfield (1999) ALSO - The Making Of David Copperfield\n\nBob Hoskins leads an all-star cast in an adaptation of one of Charles Dickens' most famous novels.\n\nDrawing on his own life Dickens tells the tale of David from birth and idyllic upbringing through hardship and adventure leadingto the eventual discovery of his vocation as a successful novelist. On his journey David encounters a gallery of Dickens's most memorable characters. Mr Micawber, Uriah Heep &amp; Steerforth are among those who share his development.\n\nA Tale of Two Cities (1980)\n\nTwo cities intertwined during the French revolution by tyranny and love in this absorbing and heart-rending production. It tells the story of Syney Carton, a man of no consequence, who gives up his life to save Charles Darnay.\n\nGreat Expectations (1999)\n\nPip is a young orphan who is taken under the protection of a kindly family. He is also brought into contact with Miss Havisham and the aloof Estella who he loves from afar. Miss Havisham becomes his benefactor and he is allowed to grow into a young gentleman, but is haunted by his past, in particular an encounter with Magwitch on the marshes when he was young.\n\nHe is besotted with Estella but she shows no affection towards him to begin with and teases him by flirting with a number of eligible suitors. The story climaxes with a fire at Miss Havisham's house where old secrets are revealed and Pip and Estella finally realise their love for each other.\n\nOur Mutual Friend (1998) ALSO - Dickens - The Final Chapter\n\nFrom the dark waters of Victorian London, Charles Dickens weaves a tale of crime and compassion. Poor Lizzie and her father eke out a living on the banks of the Thames until one day they recover a body that links them with another world - the world of dinner parties and the household of the Wilfers. As their lives intertwine a complex story of money and love emerges.\n\nVideo Specs\n\nContainer and Codec : AVI | XviD\nBitrate: 1200 Kbps\nEncoding: 2 Pass\nResolution: 720 x 544, 720 x 400\nDisplay Aspect Ratio: 4:3,16:9\nFrame Rate: 25.000 Fps\n\nAudio Specs\n\nAudio Type: MP3\nBitrate Mode: Constant\nBitrate: 128 Kbps\nSample Rate: 48.0000 KHz\nChannel Count: 2 Channels\n\nNo Subs\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:5fd52282344ebc5521c26f1abf45163161ac23f2","amp;dn":"The+Charles+Dickens+TV+Drama+Series+Collection++%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fd52282344ebc5521c26f1abf45163161ac23f2","infoHashBuffer":{"type":"Buffer","data":[95,213,34,130,52,78,188,85,33,194,111,26,191,69,22,49,97,172,35,242]},"announce":[],"urlList":[]}}