{"title":"Nazareth - Complete Singles Collection 1972-1995  3CD-Box 2005","uid":6622768,"size":1444972351,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:618deb87f04dd3839a7c13b62ea919e683c4c7d2&amp;dn=Nazareth+-+Complete+Singles+Collection+1972-1995++3CD-Box+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1314057839,"description":"Nazareth are a Scottish hard rock band that had several hits in the UK in the early 1970s, and established an international audience with their 1975 album Hair of the Dog. Perhaps their best-known hit single was a cover of the ballad Love Hurts, in 1975. The band continues to record and tour as of 2011.\n\n- - -\n\nNazareth was formed in December 1968 in Dunfermline, Scotland, out of the ashes of semi-professional local group The Shadettes (formed in 1961) by vocalist Dan McCafferty, guitarist Manny Charlton (ex Mark V and The Red Hawks), bassist Pete Agnew, and drummer Darrell Sweet. They took their name from Nazareth, Pennsylvania, which is cited in the first line of The Band's classic song The Weight (I pulled into Nazareth / Was feelin' about half past dead). Nazareth's cover version of Java Blues by The Band's bassist/singer Rick Danko and Emmett Grogan is on their 1981 live album Snaz.\n\nThe band moved to London, England in 1970, and released their eponymous debut album in 1971. After getting some attention with their second album Exercises, released in 1972, Nazareth supported Deep Purple on tour, and issued the Roger Glover-produced Razamanaz, in early 1973. This collection spawned two UK Top Ten hits, Broken Down Angel and Bad Bad Boy. This was followed by Loud 'n' Proud in late 1973, which contained another hit single with a hard-rocking cover of Joni Mitchell's song This Flight Tonight. Then came another album Rampant, in 1974, that was equally successful although its only single, Shanghai'ed in Shanghai, narrowly missed the British Top 40. A non-album song, again a cover version, this time of Tomorrow's My White Bicycle, was a UK Top 20 entry in 1975.\n\nHair of the Dog was released in April 1975. The title track of that album (popularly, though incorrectly, known as Son Of A Bitch due to its hook lyrics) became a staple of 1970s rock radio. The American version of the album included a song originally recorded by The Everly Brothers, and also covered by Roy Orbison, the melodic ballad Love Hurts, that was released as a hit single in the UK and in the U.S., where it went platinum. The track became the band's only U.S. Top Ten hit. The song spent a record-shattering 60 weeks on the Norwegian chart.\n\nIn 1979, second guitarist Zal Cleminson was added to the line-up, remaining for two albums, No Mean City and Malice in Wonderland, and contributing numerous compositions. Malice in Wonderland produced a popular Adult-Oriented Rock single called Holiday. In 1981, they contributed the song Crazy (A Suitable Case for Treatment) to the soundtrack to the film, Heavy Metal.\n\nVarious Nazareth line-ups continued to make studio albums and tour throughout the 1980s and 1990s, although their popularity had declined such that some albums no longer received either a UK or a U.S. release. They remained popular in Europe, particularly Germany, where Dream On became a hit single. Billy Rankin returned for a second spell in the ranks in 1991 for the No Jive album, replacing Manny Charlton who pursued a solo career.\n\nA tribute came in 1993 when Guns n' Roses covered Nazareth's Hair of the Dog on The Spaghetti Incident?, consolation after they turned down Axl Rose's request for the group to play at his wedding. Rankin departed again in 1994, but with Jimmy Murrison and keyboard player Ronnie Leahy, Nazareth maintained a live following in Europe and the U.S.\n\nIn 1999, while touring the U.S., original drummer Darrell Sweet died at age 51 of a heart attack. He was replaced by bassist Pete Agnew's son Lee for later editions of the band.\n\nIn February 2008, an album was released on the Hamburg-based label Edel Entertainment entitled The Newz. The release of the album coincided with Nazareth's fortieth anniversary tour which started on 25 January in Sweden and visited most of Europe, finished on 4 November 2008 in Norway. A follow up album entitled Big Dogz was released on 15 April 2011. (wikipedia)\n\n- - -\n\nNazareth - Complete singles collection 1972-1995\n(3CD London Snapper Music 2005)\n\n 1. Dear John  \n 2. Morning dew \n 3. If you see my baby \n 4. Broken down angel \n 5. Bad bad boy  \n 6. Hard living  \n 7. Razamanaz  \n 8. Glad when your gone  \n 9. This flight tonight \n10. Shanghai'd in Shanghai  \n11. Love hurts \n12. Hair of the dog  \n13. My white bicycle  \n14. Holy roller \n15. Carry out feelings  \n16. Yor're the violin  \n17. I don't want to go on without you \n18. Somebody to roll \n19. Gone dead train \n20. Place in your heart \n21. May the sunshine \n22. Whatever you want Bebe \n23. Star \n24. Holiday \n25. Big boy \n26. Heart's grown cold (live) \n27. Dressed to kill \n28. Every young man's dream\n29. Moonlight eyes \n30. Let me be your leader  \n31. Morning dew '81 \n32. Love leads to madness \n33. Games \n34. Dream on  \n35. Where are you now  \n36. Ruby Tuesday  \n37. Party down \n38. Cinema \n39. Piece of my heart  \n40. Winner on the night \n41. Every time it rains \n42. Tell me that you love me \n43. Move me \n44. Love hurts (Orchestral version) \n45. Morgentau \n46. Out of time (Dan McCafferty single)\n47. Watcha gonna do about it (Dan McCafferty single)\n48. Stay with me baby (Dan McCafferty single)\n49. The Honky Tonk downstairs  (Dan McCafferty single)\n50. Starry eyes (Dan McCafferty single) \n","torrent":{"xt":"urn:btih:618deb87f04dd3839a7c13b62ea919e683c4c7d2","amp;dn":"Nazareth+-+Complete+Singles+Collection+1972-1995++3CD-Box+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"618deb87f04dd3839a7c13b62ea919e683c4c7d2","infoHashBuffer":{"type":"Buffer","data":[97,141,235,135,240,77,211,131,154,124,19,182,46,169,25,230,131,196,199,210]},"announce":[],"urlList":[]}}