{"title":"Discovery Science Secrets Of The Dinosaur Mummy WS PDTV XViD Som","uid":4806959,"size":367169536,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:62f28b3094492a882cd2eb765e9e331bfe9f0fa7&amp;dn=Discovery+Science+Secrets+Of+The+Dinosaur+Mummy+WS+PDTV+XViD+Som&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dyslexik2","files":1,"time":1238236707,"description":"&quot;Leonardo&quot; was found in Montana almost fully intact. Ninety percent of his body is covered in skin. We know what he ate for his last meal. What makes this so impressive? Leonardo is a 77 million-year-old dinosaur. Discovery Channel reveals what is unquestionably one of the most unexpected and important dinosaur discoveries of all time in the one-hour high-definition special Secrets of the Dinosaur Mummy.\n\nDiscovered in 2000 by a team of amateur paleontologists exploring Malta, Mont., Leonardo -- named for graffiti found near his burial site -- is the first dinosaur mummy with intact digestive tract contents ever found. With this once-in-a-lifetime finding, scientists now have more than just bones to fully reconstruct how dinosaurs looked and lived. From the cause of death to Leonardo's last meal, scientific tests provide far more detail than the team of scientists ever expected. Skin impressions and actual fossilized samples of the digested food still inside the viscera, plus skin and joints, allow the team to create the first reconstruction of a giant dinosaur, accurate both inside and out.\n\nLeonardo is a young Brachylophosaurus, a four-legged plant-eating duck-billed dinosaur, the very first juvenile of the species discovered with extensive skin. He was approximately 3 to 4 years old when he died and would have been 20 feet long, weighing about 2,000 pounds.\n\nFrom high-tech testing of Leonardo's remains, scientists have positively identified what a plant-eating dinosaur ate -- something that has never been done before. Leonardo's last meal consisted largely of leaves, which included ferns, magnolias and conifers. Additional analysis has confirmed at least 40 different types of prehistoric plant pollen preserved in his stomach. Since most dinosaurs were herbivores, this find is an incredibly important step in learning more about the creatures' lives on the planet.\n\nAnother finding that was only possible due to Leonardo's intact remains is the strong evidence for a crop. Modern plant-eating birds have crops to aid in the digestion process, but there was no evidence of the possibility that dinosaurs may have also had crops until Leonardo was unearthed. This startling discovery has led to new theories of how these creatures lived.\n\n\n\n\n[code]\nAVI File Details\n========================================\nName.........: ds.sotdm.pdtv-sometv.avi\nFilesize.....: 350 MB (or 358,564 KB or 367,169,536 bytes)\nRuntime......: 00:43:28 (65,199 fr)\nVideo Codec..: XviD\nVideo Bitrate: 1008 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 109 kb/s (54/ch, stereo) VBR LAME3.90.\u0002Ã‚Â°\nFrame Size...: 640x352 (1.82:1) [=20:11]\n[/code]\n\n\n","torrent":{"xt":"urn:btih:62f28b3094492a882cd2eb765e9e331bfe9f0fa7","amp;dn":"Discovery+Science+Secrets+Of+The+Dinosaur+Mummy+WS+PDTV+XViD+Som","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62f28b3094492a882cd2eb765e9e331bfe9f0fa7","infoHashBuffer":{"type":"Buffer","data":[98,242,139,48,148,73,42,136,44,210,235,118,94,158,51,27,254,159,15,167]},"announce":[],"urlList":[]}}