{"title":"Droid Scan Pro PDF v5.4.3 Final By bobiras2009","uid":7590445,"size":894589,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:63d2a86f4b85f464600c769cff29776488ae0f95&amp;dn=Droid+Scan+Pro+PDF+v5.4.3+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346526061,"description":"                             By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nDroid Scan is a mobile app that turns your phone or tablet into a portable document scanner. With Droid Scan you can transform images captured with your camera into professional multi-page PDF documents in just a few clicks.\n\nUnique, state of the art features, including:\n\n    Batch processing, including turbo import, turbo capture, and batch convert, so that multi-page documents can be created with just a few taps.\n    Integrates with OCR by Google Docs, Evernote, and Google Goggles.\n    Document shape recognition, for perfectly shaped, professional-looking scans.\n\nTurn your mobile phone into a document scanner that goes where you go. Convert any snapshot into a highly readable JPEG or PDF by fixing geometry, contrast, and color.\n\nRecord business cards, white boards, full page documents, and receipts. On-phone conversion: complete confidentiality, no subscription fees.\n\nMultiple resolutions available from low-res, suitable for quick sharing via email, to highest fidelity reproductions suitable for OCR and printed copy.\n\nAutomatic recognition of document shapes like US Letter, A4, Business card, and more.\n\nEasy creation of multi-page PDF documents and ZIP files using the built-in scan gallery.\n\nShare via email, Box.net, Dropbox, HP iPrint, and many more.\n\nWhat's in this version : (Updated : Aug 30 2012)\n\n    Intelligent JPEG sharing: share scans all at once with apps that support it, and one at a time with apps that don't.\n    Popup selector with quick access to color, contrast, and brightness settings.\n    Bug fix for Android 4.1 (Jelly Bean).\n\nRequired Android O/S : 2.1+\n\n\n\n                             By bobiras2009\t\n","torrent":{"xt":"urn:btih:63d2a86f4b85f464600c769cff29776488ae0f95","amp;dn":"Droid+Scan+Pro+PDF+v5.4.3+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63d2a86f4b85f464600c769cff29776488ae0f95","infoHashBuffer":{"type":"Buffer","data":[99,210,168,111,75,133,244,100,96,12,118,156,255,41,119,100,136,174,15,149]},"announce":[],"urlList":[]}}