{"title":"CurrentDiagnosis_TreatmentSurgery","uid":7917614,"size":29772823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:649b3c187553dd6017afd05ce83bd2123649352b&amp;dn=CurrentDiagnosis_TreatmentSurgery&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"shafi3803","files":-1,"time":1355358567,"description":"CURRENT Diagnosis &amp; Treatment: Surgery, 13e\n\nGeneral Information\nPublication Date: August 20, 2009 \nISBN-10: 0071635157 \nISBN-13: 978-0071635158 \nEdition: 13\n\nDescription\nTo-the-point information on more than 1000 diseases and disorders surgeons are most likely to encounter.The leading single-source surgery book for house-staff, students, practitioners, and surgeons\n\nA Doody's Core Title for 2011\n&quot;This is an excellent source of updated, authoritative, and concise information on diseases encountered in general surgery and the surgical subspecialties of otolaryngology, urology, gynecology, orthopedics, plastic and reconstructive surgery, and pediatrics....This is a wonderful resource for all levels of surgical practitioners as well as nonsurgical practitioners. In my experience, it has provided me with a framework to prepare for both oral and written boards. 3 Stars.&quot;--Doody's Review ServiceAuthoritative, concise, and completely up-to-date, CURRENT Diagnosis &amp; Treatment Surgery features:Wide-ranging coverage that encompasses general surgery and all the important subspecialties including otolaryngology, urology, gynecology, orthopedics, plastic and reconstructive surgery, and pediatricsReferences linked to recent journal articlesLogical quick-find organization made even more accessible by a comprehensive index More than 600 informative photographs and illustrations Detailed treatment algorithms NEW CD-ROM with content from Quick Answers: Surgery to speed diagnosis of symptoms and signs NEW Chapter on Training, Communication, Professionalism, and Systems-Based Practice Completely rewritten chapters on Wound Healing, Anesthesia, Otolaryngology/Head &amp; Neck Surgery, The Heart, Neurosurgery, Gynecology, and Orthopedics\n","torrent":{"xt":"urn:btih:649b3c187553dd6017afd05ce83bd2123649352b","amp;dn":"CurrentDiagnosis_TreatmentSurgery","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"649b3c187553dd6017afd05ce83bd2123649352b","infoHashBuffer":{"type":"Buffer","data":[100,155,60,24,117,83,221,96,23,175,208,92,232,59,210,18,54,73,53,43]},"announce":[],"urlList":[]}}