{"title":"RAZBAM LTV A-7 Corsair II.rar","uid":7703593,"size":247316990,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:64f0a9133970ce9f6269856461fd9270ebfef5c5&amp;dn=RAZBAM+LTV+A-7+Corsair+II.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"medioalmud","files":1,"time":1349614884,"description":"RAZBAM A-7E and A-7D Corsair II for FSX\n\nThe Ling-Temco-Vought A-7 Corsair II is a carrier-based subsonic light attack aircraft introduced to replace the United States Navy's A-4 Skyhawk, initially entering service during the Vietnam War.\n\nThe Corsair was later adopted by the United States Air Force, to include the Air National Guard, to replace the A-1 Skyraider, F-100 Super Sabre and F-105 Thunderchief. The aircraft was also exported to Greece in the 1970s, and Portugal and Thailand in the late 1980s.\n\nThe A-7 airframe design was based on the successful supersonic F-8 Crusader produced by Chance Vought. It was one of the first combat aircraft to feature a head-up display (HUD), an inertial navigation system (INS), and a turbofan engine.\n\nThe A-7 offered a plethora of leading-edge avionics compared to contemporary aircraft. This included data link capabilities that, among other features, provided fully &quot;hands-off&quot; carrier landing capability when used in conjunction with its approach power compensator (APC) or auto throttle. Other notable and highly advanced equipment was a projected map display located just below the radar scope. The map display was slaved to the inertial navigation system and provided a high-resolution map image of the aircraft's position superimposed over TPC/JNC charts. Moreover, when slaved to the all-axis auto pilot, the inertial navigation system could fly the aircraft &quot;hands off&quot; to up to nine individual way points. Typical inertial drift was minimal for newly manufactured models and the inertial measurement system accepted fly over, radar, and TACAN updates.\n\nProduction of Corsairs continued through 1984, yielding a total of 1,569 aircraft built. The A-7 Corsair has the distinction of being the only United States single seat jet fighter-bomber of the 1960s that was designed, built, and deployed directly into the Vietnam War.","torrent":{"xt":"urn:btih:64f0a9133970ce9f6269856461fd9270ebfef5c5","amp;dn":"RAZBAM+LTV+A-7+Corsair+II.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64f0a9133970ce9f6269856461fd9270ebfef5c5","infoHashBuffer":{"type":"Buffer","data":[100,240,169,19,57,112,206,159,98,105,133,100,97,253,146,112,235,254,245,197]},"announce":[],"urlList":[]}}