{"title":"Elton John feat. LeAnn Rimes - Written In The Stars(Xvid-2nafish","uid":6023984,"size":97598476,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:655cf57c5a1d72069656be00ad46720a7a80b291&amp;dn=Elton+John+feat.+LeAnn+Rimes+-+Written+In+The+Stars%28Xvid-2nafish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1291880425,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:22\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2850 Kbps\nQuality Factor : 0.42 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Written in the Stars&quot; is a single released in 1999 by LeAnn Rimes and Elton John.\n\nThis song came from the musical Aida written by Elton John. In this scene in the musical, Radames informs Aida that he's calling off the wedding. Aida knows that this would ruin her father's escape and tells him he must go through with it. Radames agrees, on condition that she escapes to freedom on a boat he will provide. The two lovers lament the complication of the circumstances of their love together before parting. Due to Rimes' previous country music success, this song made #74 on Canada's RPM country chart due to unsolicited airplay as an album cut. There are two different recordings of the song, one with Rimes performing the first verse, the other with John. The song is featured on Rimes' album I Need You and the concept album for the musical. The song was performed live at VH1 Divas Live 1999.\n\nAccording to an episode of VH1's Pop-Up Video, the music video for this song was meant to evoke forbidden loves, as well as the separation between the two singers. Rimes was shown in colder, more heavenly backdrops; John was given warmer backgrounds, as in a milder depiction of hell.\n\nAida is a musical in two acts based on Giuseppe Verdi's Italian-language opera by the same name, the scenario of which was written by Auguste Mariette. The musical was produced by Disney Theatrical, with music by Elton John, lyrics by Tim Rice, and book by Linda Woolverton, Robert Falls, and David Henry Hwang.\n\nThe musical originated from a children's storybook version of Verdi's opera written by the soprano Leontyne Price. The book featured illustrations by Leo and Diane Dillon. The rights were acquired by Disney studios for a proposed animated feature film. Development on the film was shelved, but the source material evolved into the stage version.\n\nAfter productions in Atlanta and Chicago, the musical premiered on Broadway in 2000.\n\nI Need You is the sixth album by country-pop artist LeAnn Rimes, released in 2001. The album was released by Curb Records as a collection of promotional tracks and B-sides to help satisfy Rimes' recording contract obligations during litigation with the label and her management. The album was re-released on March 26, 2002 with four remix bonus tracks and the song &quot;Light the Fire Within&quot; which LeAnn performed at the 2002 Winter Olympics opening ceremony in Salt Lake City.\n\nThe album was publicly disowned by Rimes in 2002 because it was &quot;cobbled together with studio outtakes.&quot; \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:655cf57c5a1d72069656be00ad46720a7a80b291","amp;dn":"Elton+John+feat.+LeAnn+Rimes+-+Written+In+The+Stars%28Xvid-2nafish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"655cf57c5a1d72069656be00ad46720a7a80b291","infoHashBuffer":{"type":"Buffer","data":[101,92,245,124,90,29,114,6,150,86,190,0,173,70,114,10,122,128,178,145]},"announce":[],"urlList":[]}}