{"title":"Chuck Missler- Cosmic Codes","uid":3494183,"size":301841458,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:661b5fb91b1f71258383fb0de4531229e9763910&amp;dn=Chuck+Missler-+Cosmic+Codes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bucky katt","files":1,"time":1149929368,"description":"Are we in possession of messages of extraterrestrial origin?\nIf so, what do they mean?\nWhat do these messages from the edge of eternity portend for the future?\nWhat has the science of cryptology revealed about these ancient texts? Is our universe itself a &quot;digital message&quot;?\nDo these messages explain the interval between the miracle of our origin and the mystery of our destiny?\n\nRead the implications of our finite universe and the shocking discoveries of quantum physics at the very boundaries of reality and learn their significance to our origin and personal destinies!\n\nYou will grow in excitement as Chuck Missler details astonishing hidden messages within the text of the Torah that could only have been placed there by the Great Author Himself. He explores the impact of information sciences on our understanding of ancient texts...including microcodes, macrocodes, and metacodes...as well as the highly controversial &quot;equidistant letter sequences&quot; discovered in the Bible. You will be able to use this exciting information to discover the hidden messages yourself because many of them do not require a computer to decipher.\n\nThis collection contains all four Cosmic Codes studies as the Automated Multimedia files which contain the all-new slideshows, and the complete set of notes in PDF format.\n\n* Volume One - Introduction Chuck Missler reviews the history of cryptography - the study of secret codes - and the background of proposed interstellar languages.\n* Volume Two - Microcodes: An exploration of Microcodes, the unique qualities of Hebrew that make it codeable.\n* Volume Three - Macrocodes: A study of macrocodes, prophetic messages that God has given through symbolism and types.\n* Volume Four - Metacodes: A study of metacodes, the codes that God has placed in nature - signals from the tenth dimension and the code of life.\n\nRunning Time: Approx 8 hours.\n\nCTCA\n","torrent":{"xt":"urn:btih:661b5fb91b1f71258383fb0de4531229e9763910","amp;dn":"Chuck+Missler-+Cosmic+Codes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"661b5fb91b1f71258383fb0de4531229e9763910","infoHashBuffer":{"type":"Buffer","data":[102,27,95,185,27,31,113,37,131,131,251,13,228,83,18,41,233,118,57,16]},"announce":[],"urlList":[]}}