{"title":"Mythic Delirium 20 (Neil Gaiman)","uid":8607022,"size":18878207,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67ed88b6be644ba0c08d58f9e4196d4a17d5af77&amp;dn=Mythic+Delirium+20+%28Neil+Gaiman%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1372035737,"description":"Being the geeky Neil Gaiman completist that I am, I snatched up one of these when he mentioned it on his blog. It was available for a while, but when checking their website to grab the description below I noticed it has gone out of print. \nNeil's poem is great, but the entire volume is very entertaining. Mythic Delirium has a detailed website, if you find this book interesting you should check it out. They're up to issue 28, but are currently converting to a new digital format that will include fiction along with the poetry. They have two upcoming print issues left (29 and 30) before they start over with issue 0.1 in 2014.\n\n--------------------------------------------------------------------------------\n\n'Mythic Delirium 20'\n\nMythic Delirium Books, Winter/Spring 2009, 44 pages (this file)\n\nThe table of contents... &lt;a href=&quot;\nhttp://bayimg.com/eAnjdaaeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/eAnjdaaeg&lt;/a&gt;\n\nMythic Delirium is delighted to celebrate our 10th anniversary of publishing the best off-beat and eclectic speculative poetry with a landmark event in the history of our little do-it-yourself 'zine. Our newest issue, No. 20, showcases an original poem from best-selling and multiple award-winning author Neil Gaiman. Fin multiplexes nationwide.\n\nA true jack-of-all-mediums and a master entertainer, Neil has exhibited astonishing versatility over nearly three decades, whether writing for comics, writing novels, writing screenplays, writing children's picture books, or writing poems, a number of which appear in his short story collections. It's hard to express how proud we are to have him on board for the final issue of our first 10 years, but take our word for it, we're proud. And we're certain you'll find his new poem, titled &quot;Conjunctions,&quot; a surreal vision centered around an image both comic and disturbing, to be a genuine treat for both Neil's fans and for fans of speculative verse.\n\nBut Neil's contribution isn't the only ingredient that makes our 20th issue the largest and most exquisitely strange confection we've ever produced. This outsized issue contains 40 pages of odd and adventurous verse, featuring such voices familiar to long time subscribers as Sonya Taaffe, Darrell Schweitzer, F.J. Bergmann, Kendall Evans, Samantha Henderson, G.O. Clark, Danny Adams, Jessica Paige Wick, Amal El-Mohtar and Deborah P Kolodji. Over the years Mythic Delirium has given a number of writers and poets their very first publications, a source of considerable pride for us, and our anniversary issue is no exception, with nearly half of the poems scribed by contributors who, like Neil, are appearing in our pages for the first time. There's a surprise on every page. This is certainly an issue you shouldn't miss. ","torrent":{"xt":"urn:btih:67ed88b6be644ba0c08d58f9e4196d4a17d5af77","amp;dn":"Mythic+Delirium+20+%28Neil+Gaiman%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67ed88b6be644ba0c08d58f9e4196d4a17d5af77","infoHashBuffer":{"type":"Buffer","data":[103,237,136,182,190,100,75,160,192,141,88,249,228,25,109,74,23,213,175,119]},"announce":[],"urlList":[]}}