{"title":"Extreme Vegas 2009 720p HDTV.mkv","uid":10057772,"size":983099914,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:685590dcad73ebfc9fa9dfb25ae7d132dcf76c58&amp;dn=Extreme+Vegas+2009+720p+HDTV.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"headcedon7","files":-1,"time":1398685900,"description":" &lt;a href=&quot;http://www.travelchannel.com/destinations/las-vegas/articles/extreme-vegas&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.travelchannel.com/destinations/las-vegas/articles/extreme-vegas&lt;/a&gt;\n\n\nGambling. All-night parties. Strip Clubs. These cultural vices are synonymous with Las Vegas. However, we dug a little deeper and uncovered new ways Sin City turns mundane events, like having a glass of wine or sharing a dessert, into extreme mind-blowing experiences.\n\nSkydive Wedding\nSkydive Las Vegas\nHome of the shotgun wedding, Vegas is no stranger to quickie nuptials, but none are faster than the service offered at Skydive Las Vegas. Here, couples take the ultimate plunge from 3 miles up. After viewing a 30-minute training video, couples suit up, strap on a parachute and hit the tarmac on their way to happily ever after. Once reaching 15,000 feet in the air, rings are exchanged between some sweaty palms, then the newlyweds freefall into marital bliss.\n\nAureole's Wine Tower\nMandalay Bay\nAt Mandalay Bay's Aureole, diners can choose from the restaurant's 9,865 bottles of wine housed in a skyscraper-like wine tower. Each glass is delivered by daredevil waitresses who deftly maneuver in a high-tech, mission impossible-style harness system. These wine angels can zip a pinot noir or sparkling white into your hand in less than 10 seconds.\n\nThe Pleasure Pit\nPlanet Hollywood\nSin City is home to countless strip clubs and casinos, and nowhere do these 2 vices come together more devilishly than at Planet Hollywood's The Pleasure Pit. This naughty and seriously addictive casino is home to Vegas' hottest dealers -- each and every card thrower here is a former or current model scantily clad in revealing lingerie. It's also the only casino on the Strip with four stripper poles on the casino floor -- a nice distraction during a losing a streak.\n\nThrill Rides\nThe Stratosphere\nTake the elevator 100 stories above the Strip at The Stratosphere Hotel and Casino to experience 3 of the highest, most terrifying thrill rides in the world. On the X-Scream, your rollercoaster car dangles 29 feet off the building's edge and more than 900 feet in the air. The Insanity is an 80,000-pound steel and titanium centripetal spin machine that tests even the strongest stomachs. It flies higher than the X-Scream and simulates the same amount of force astronauts feels when a space shuttle lifts off.\n\nThe Stratosphere's most extreme thrill ride is the Big Shot, a catapult-like ride that explodes 160 feet at 45 miles per hour. The ride takes about 2 and a 1/2 seconds and creates four Gs of force on the way up -- at the top, you're over 1,000 feet above the Vegas Strip.\n\nThe Four by Four by Two\nRM Seafood\nThe desert's most sinful dessert is served exclusively at RM Seafood and it's called the Four by Four by Two. The dish is 4 rows by 4 rows of seriously surprising ice cream flavors meant to be shared by 2 people. Out of the 16 scoops, no 2 flavors are alike -- and we guarantee they aren't anything you've ever tasted before. Made completely from scratch, the dessert features flavors like black pepper with balsamic vinegar, carrot cheesecake, foie gras, rum and coke, celery lime and black truffle just to name a few.\n\nThe Neon Museum\nIn a neon city that constantly reinvents itself, there's only one place to go to see the signs of Las Vegas' past. The Neon Museum is a 3-acre light-filled graveyard where 160 years of vintage Vegas signs cast light on Sin City's historic past. Among the most famous are the Silver Slipper and the Stardust Casino sign. The slipper stands 15 feet tall and weighs over 2 tons and once sat atop the Silver Slipper Gambling Hall, a favorite haunt of Frank Sinatra. After its debut in 1968, the Stardust sign was the largest sign in the world for 10 years.\n\nFremont Street in downtown Las Vegas is a 5-block pedestrian walkway showcasing 10 fully refurbished classic signs. It's the number one tourist destination in Las Vegas, welcoming almost 19 million people a year.\n\nCarnival Buffet\nRio All-Suite Hotel and Casino\nThe Rio is home to Vegas' biggest buffet. The food choices stretch out on tables measuring over 340 feet long and features over 400 different kinds of food including pizza, sushi and the popular Texas-sized prime rib. The buffet is open for breakfast, lunch and dinner 7 days a week and allows patrons to stay as long as they want and eat as much as their stomachs will hold.\n\nMinus 5\nMandalay Bay\nMinus 5 is Las Vegas' coolest bar -- literally. Inside the bar, everything is made entirely of ice and temperatures are kept at a constant negative 5 degrees Celsius, or 23 degrees Fahrenheit. Once inside, each guest gets outfitted in insulated parkas, boots and gloves -- a requirement for entry. The gloves are especially handy when sipping cocktails served in glasses made entirely of ice. The temps are so frigid that patrons are strongly urged to spend only 30 minutes inside the bar at a time at which point they should step back out into the desert heat to warm up.\n\n\n\nWidth                                    : 1 280 pixels\nHeight                                   : 720 pixels\nDisplay aspect ratio                     : 16:9\n\n\nAudio\nCodec ID                                 : A_AAC\nDuration                                 : 43mn 31s\nChannel(s)                               : 6 channels","torrent":{"xt":"urn:btih:685590dcad73ebfc9fa9dfb25ae7d132dcf76c58","amp;dn":"Extreme+Vegas+2009+720p+HDTV.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"685590dcad73ebfc9fa9dfb25ae7d132dcf76c58","infoHashBuffer":{"type":"Buffer","data":[104,85,144,220,173,115,235,252,159,169,223,178,90,231,209,50,220,247,108,88]},"announce":[],"urlList":[]}}