{"title":"American_Top_40_1978_July_22nd","uid":10620458,"size":146189210,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:68971dae377c177ba1ffda39949f43622358aa52&amp;dn=American_Top_40_1978_July_22nd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"RocketMan999","files":-1,"time":1406164316,"description":"&quot;We're counting down the most popular songs in the country from Kodiak to Kokomo; from Hartford to Honolulu.&quot;\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is one I found on the internet.\n\nIn this countdown:\n\nThere is the latest song by a man who says he has been involved in the creative process of more than a thousand albums. Maybe that is why his current song features the talents of Nickolas Ashford, Valerie Simpson, and Chaka Khan.\n\nEvelyn &quot;Champagne&quot; King debuts with her first hit &quot;Shame&quot; (at number 37), and Olivia Newton-John has the highest debuting song of the week, &quot;Hopelessly Devoted To You&quot; (at number 35).\n\nA listener wants to know what group, and what woman, has had the most number one albums. The group holding that title is the Beatles, and Casey tells what two female artists are tied for first place.\n\nThe movie &quot;FM&quot; (with cameos by Linda Ronstadt and Tom Petty) has two songs in the countdown: the title song by Steely Dan (at number 17) and &quot;Life's Been Good&quot; by Joe Walsh (at number 22). &quot;Thank God It's Friday&quot; (which includes performances by the Commodores and Donna Summer) is another movie represented by two songs: the title song by Love and Kisses (at number 22) and &quot;Last Dance&quot; by Donna Summer (at number 5). I am helping to seed copies of these (uploaded by others) for at least a month AND to a ratio of 30 (whichever comes last), so you can enjoy a full 1978 experience. Get your copies at the links provided in the text.\n\nCasey gives a special report on Sister Luc Gabrielle, who had a hit song, &quot;Dominique&quot; and was facing jail time for non-payment of back taxes at the time of this broadcast. She had taken a vow of poverty and all her royalties went to charity.\n\nThere is a band in the countdown whose success came so quickly, they had trouble finding an opening act because nobody had ever heard of them. Casey explains.\n\nIn a country whose gross national product per capita is the largest in the world, the most profitable business enterprise is a recording act that has a hit in this countdown. Casey explains this too.\n\nHaving heard Casey say that Johnny Mathis holds the record for riding the album chart the most consecutive weeks with the same album, a listener wants to know who holds that record among female artists. Casey says the woman who leads all the ladies also leads all the men except Mathis.\n\nWith this countdown, the record label RSO has held the number one spot 29 of the last 32 weeks. Casey lists the number one hits that made it happen.\n\n40: An Everlasting Love - Andy Gibb\n39: Rivers Of Babylon - Boney M\n38: Stuff Like That - Quincy Jones\n37: Shame - Evelyn &quot;Champagne&quot; King\n36: Boogie Oogie Oogie - A Taste Of Honey\n35: Hopelessly Devoted To You - Olivia Newton-John\n34: Love Or Something Like It - Kenny Rogers\n33: Prove It All Night - Bruce Springsteen\n32: Can We Still Be Friends - Todd Rundgren\n31: You're The One That I Want - John Travolta &amp; Olivia Newton-John\n30: I've Had Enough - Wings\n29: Wonderful Tonight - Eric Clapton\n28: Two Out Of Three Ain't Bad - Meatloaf\n27: Stay - Jackson Browne\n26: King Tut - Steve Martin\n25: Songbird - Barbara Streisand\n24: If I Ever Needed You Again - Roberta Flack\n23: FM - Steely Dan\n22: Thank God It's Friday - Love and Kisses\n21: I'm Not Gonna Let It Bother Me Tonight - Atlanta Rhythm Section\n20: Magnet And Steel - Walter Egan\n19: Bluer Than Blue - Michael Johnson\n18: My Angel Baby - Toby Beau\n17: Life's Been Good - Joe Walsh\n16: Dance With Me - Peter Brown\n15: Copacabana - Barry Manilow\n14: Hot Blooded - Foreigner\n13: Runaway - Jefferson Starship\n12: It's A Heartache - Bonnie Tyler\n11: Love Will Find A Way - Pablo Cruise\n10: Three Times A Lady - Commodores\n9: Take A Chance On Me - ABBA\n8: Use Ta Be My Girl - O'Jays\n7: The Groove Line - Heatwave\n6: Grease - Frankie Valli\n5: Last Dance - Donna Summer\n4: Still The Same - Bob Seger\n3: Miss You - The Rolling Stones\n2: Baker Street - Gerry Rafferty\n1: Shadow Dancing - Andy Gibb","torrent":{"xt":"urn:btih:68971dae377c177ba1ffda39949f43622358aa52","amp;dn":"American_Top_40_1978_July_22nd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68971dae377c177ba1ffda39949f43622358aa52","infoHashBuffer":{"type":"Buffer","data":[104,151,29,174,55,124,23,123,161,255,218,57,148,159,67,98,35,88,170,82]},"announce":[],"urlList":[]}}