{"title":"Wonderbook.Walking.with.Dinosaurs.PS3-RiOT","uid":9189420,"size":4959665662,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:68fd5d1162165399e83d5fc2d758baa6f67b3bf2&amp;dn=Wonderbook.Walking.with.Dinosaurs.PS3-RiOT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"thenoobish","files":661,"time":1384362351,"description":"dD!hsa\n\n.. against                         and\neverything                         everybody ..\n\nRiot!\n\nWonderbook : Walking with Dinosaurs - Playstation 3\n\n|  Company....: BBC / Sony           |  Genre...: Entertainment\n|  Released...: November 12th, 2013  |  Origin..: BCES-01806\n\n| iNFO:\n\n| Explore your own dig site to become a real dino expert.\n| Grab your Wonderbook, dig up 150-million-year-old secrets and uncover|\n| dinosaur fossils, then stand back as the prehistoric giants come to  |\n| life right before your eyes. Walk among giant herbivores such as\n| Triceratops and Stegosaurus and come face-to-face with deadly\n| predators including Mapusaurus and Tyrannosaurus.\n| Experience the danger and adventure of prehistoric worlds. Catch up  |\n| with Patchi and Juniper, stars of Walking with Dinosaurs: The 3D\n| Movie, as well as a whole cast of new characters.\n| Tilt, rotate, touch and rub your Wonderbook and use your voice to\n| interact with the dinosaurs.\n\n| www.tothegame.com\n\n| NOTES\n\n| Hardware needed !\n\n| Greetings:\n\n| 1001 Crew, 2000 ad, ABC crackings, Abnormal, Absolute, Accumulators, |\n| Ace Crackings Inc, Ace, Ackerlight, Active, Agile, Alcatraz, Angels, |\n| Alpha Flight, Amiga Industries, Anthrox, Australian Crackers United, |\n| Accession, Bamiga Sector One, Beastie Boys, Bencor Bros, Balance,\n| Beyond Force, Bitstoppers, Boys Without Brains, Black Monks,\n| Byterapers, CIA, Censor, Choroid, Chromance, Classic, Commando,\n| Frontier, Company, Computerbrains Cracking Service, Cosmos, Crionics,|\n| CrazyTyper, Crusaders, Crystal, DOC, Danish Gold, DefJam, Dexion,\n| DigiTech, Dominators, Dual Crew - Shining, Dueco Enterprises,\n| Eagles soft, F4CG, FairLight, Finnish Gold, Fusion, Freestyle,\n| Flash Production, Gamebusters 1541, Genesis, German Cracking\n| Service, High Quality Crackings, Horizon, Hotline, Ikari, Ibb,\n| Illusion, Jedi 2001, Judges, Jungle, Justice,  Kefrens, Legend,\n| Light, Light Circle, Llamasoft, MAD, Mad Monks, Madonna Cracking\n| Group, Maniacs Of Noise, Mark II, Masters Design Group, Megastyle,\n| Melon, Ministry, Movers, Nato, Nemesis, Network, NorthStar, Northern |\n| Lights, Nukebusters, Oracle, Paranoimia, Paniaro, Panoramic Designs, |\n| Papillons, Paradox, Phenomena, Plutonium Crackers, Powerslaves,\n| Powerplant Legend, Prestige, ProSonix, Prophets AG, Pure-Byte,\n| Quadlite, Quartex, Quoram, Radwar, Razor 1911, Rebels, Reflex,\n| Red Sector Inc, Relax, SAE, SCA, SCG, SLL, Science 451, Scoopex,\n| Setrox, Silents, Skid Row, Slipstream, Softkiller crew, Spreadpoint, |\n| Strike Force, Subway, Supplex, Swedish Cracking Crew, Syntax 2001,\n| TRSI, Tarkus Team, The Band, The Connection, The Force, The Goonies, |\n| The Movers, The Shaolin Monastery, The Supply Team, Transcom, TKK,\n| The Twilight Inc, The Great Swappers, The Wanderer Group, Threat,\n| Top Swap, Triad, Triangle, Trilogy, Tristar, Triumph, Twilight,\n| Unit A, Upfront, Vibrants, Vision Factory, Vision, Vortex 42,\n| World of Wonders, X-men, XAKK.\n\n| And to the ones we may have forgot !\n\nYou liked that game?            Buy the original as we did then!","torrent":{"xt":"urn:btih:68fd5d1162165399e83d5fc2d758baa6f67b3bf2","amp;dn":"Wonderbook.Walking.with.Dinosaurs.PS3-RiOT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68fd5d1162165399e83d5fc2d758baa6f67b3bf2","infoHashBuffer":{"type":"Buffer","data":[104,253,93,17,98,22,83,153,232,61,95,194,215,88,186,166,246,123,59,242]},"announce":[],"urlList":[]}}