{"title":"X2.The.Threat.MULTi8-PROPHET","uid":11990832,"size":865097082,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:695e8880f85a0b3f3c843748b46b06df37f4a1c5&amp;dn=X2.The.Threat.MULTi8-PROPHET&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sunblock.","files":2,"time":1433500031,"description":"X2 The Threat MULTi8-PROPHET\n\nDescription:\n\nThe Threat is of a new generation of space simulator games, you play the role of Julian Gardna who continues the story set by X: Beyond The Frontier.\n\n\nFeatures:\n\nExplore: You can explore over 130 beautifully designed sectors occupied by nebulas that affect your ships and stations, asteroids you can mine for materials you can later sell on for profit.\nNew Ships: Explore in over 60 ships of varying sizes from scout class ships to the much larger carrier class battleships.\nNew Upgrades: Upgrade your ships systems with many more upgrades, and download new upgrades that make use of the new scripting engine designed specially for XÂ².\nNew Weapons: Add new weapons to your ship including the Ion Disruptor and Mass Driver, but also build factories that will develop these weapons and sell them to make a profit, expanding your own empire among the universe.\nNew Missions: Take part in missions offered to you on each stations bulletin board, make money by defending convoys and destroy incoming Xenon fleets intent on destroying everything in their path.\nBut above all else, help to defend the universe from the Khaak, before they kill everyone and everything they come across","torrent":{"xt":"urn:btih:695e8880f85a0b3f3c843748b46b06df37f4a1c5","amp;dn":"X2.The.Threat.MULTi8-PROPHET","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"695e8880f85a0b3f3c843748b46b06df37f4a1c5","infoHashBuffer":{"type":"Buffer","data":[105,94,136,128,248,90,11,63,60,132,55,72,180,107,6,223,55,244,161,197]},"announce":[],"urlList":[]}}