{"title":"Sexually Broken---- Made to cum over and over!  Courtney Taylor","uid":8184619,"size":1426414939,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:69ceb081afecd5baf65c99573c7b982ffa0c208e&amp;dn=Sexually+Broken%5C----+Made+to+cum+over+and+over%21++Courtney+Taylor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"merzedes","files":-1,"time":1361704304,"description":"Courtney Taylor, bound, manhandled, used, fucked and deep throated. Made to cum over and over! | Courtney Taylor | Matt Williams\n\nFebruary 20, 2013\nMP4 only.\n    \n \nCourtney Taylor and her huge 38DDD boobs are back on Sexually Broken. This hot blond was built for sex and absolutely loves her job. \n\nStanding over 6 foot tall in heels, our sexy blond with her monster boobs could be called Amazonian. Who doesn't want to manhandle, bind and fuck a hot blond Amazonian? We start by binding her elbows tightly together. This make her huge boobs stick out even farther. We bind her wrists together, and make her strip for us. We take aged leather and tightly, very tightly wrap her triple D fun bags. \n\nThis Amazonian whimpers as we wrap each boob tighter and tighter. Next we knock Courtney to her knees and begin a Category 5 skull fucking. We fuck her hot mouth with reckless abandon. Courtney struggles as the cock repeatedly slides all the way down her throat, over and over. We skull fuck our sexy Amazon into subspace. She is loopy and struggling for air.\n\n We pull out a vibrator and within seconds Courtney is cumming and cumming hard. It rocks her brain and we quickly move her to a bench, bend her backwards and continue a brutal face fucking. We leave Courtney dazed, her mouth wide open as we fuck the back of her throat over and over. Drool and spit runs down her face and eyes. She is a skull fucked sex zombie. We vibrate her while deep throating and she cums over and over as the cock is buried balls deep, tickling her lungs.\n\n For fun we lift her legs and push the wet, hard cock into her tight, waiting pussy. Sliding balls deep with the first stroke it's only a matter of a few hard thrusts and Courtney is cumming again. This girl is spent, Sexually Broken. A drooling, moaning mess who is deep in subspace, unable to even move we leave her bound helpless and wanting... \n \nScreens    &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/02_20ctaylor/SexuallyBroken-Courtney-Taylor-Adams-Matt-Williams-Courtney-Taylor-bound-manhandled-fucked-and-deep-throated-Made-to-cum-over-and-over.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/02_20ctaylor/SexuallyBroken-Courtney-Taylor-Adams-Matt-Williams-Courtney-Taylor-bound-manhandled-fucked-and-deep-throated-Made-to-cum-over-and-over.php&lt;/a&gt;\n\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:69ceb081afecd5baf65c99573c7b982ffa0c208e","amp;dn":"Sexually+Broken%5C----+Made+to+cum+over+and+over%21++Courtney+Taylor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69ceb081afecd5baf65c99573c7b982ffa0c208e","infoHashBuffer":{"type":"Buffer","data":[105,206,176,129,175,236,213,186,246,92,153,87,60,123,152,47,250,12,32,142]},"announce":[],"urlList":[]}}