{"title":"My Name is Addiction - Visual Novel","uid":10714664,"size":725612121,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6a17626f4642db75cd27244dba5589fe4daae172&amp;dn=My+Name+is+Addiction+-+Visual+Novel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Cleril_","files":3,"time":1407392044,"description":"This works on Windows, Mac and Linux.  Just download the file folder you need.\n\nHey everyone.  I'm Cleril, from Cleril Calamity Studios.  I signed on to Greenlight and at the rate I'm going I'll never get anywhere near greenlit without your help.\n\nPlease, if you'd be so kind, would you give your vote here: \n\nI'd appreciate it greatly.  I would love to make a living off being an indie developer.  I'd definitely make a more &quot;gamey&quot; game next.\n\nThank you for reading just this, if you'd like to know more about this, read below.\n\nThe Story: Without Spoilers\n\nYou play as a young man who has many names but only one face; the face of a monster. He's been addicted for some time when you step into his shoes as he got hooked on porn at the age of 13. However, you experience his 21 year old self, 3 years into realizing he was addicted to porn (at age 18).\n\nThe novel spans over a year of time. You'll be tossed around forcefully from time period to time period often going into the future and back as the protagonist recounts memories and lives his life. You'll attempt to have sex for the first time. You'll try to date one of two women or you can go your own way and live the single life.\n\nYou'll visit a club, the park, and even your dreams. Although your dreams may seem more like nightmares from the inside out.\n\nYou'll go from choice to choice experiencing lasting consequences. All choices affect future outcomes sometimes even affecting the ending you'll receive.\n\nThis novel is not about the shock value. It's about the human experience of a porn addict.\n\nAnd understanding the monster within.\n\nFeatures:\n\n    A highly emotional roller coaster adventure based upon the developer's own addiction to porn.\n    Seven different endings based on your choices with many ways to approach each ending!\n    Unique hand-drawn art style that is not influenced at all by anime. It is a mixture of abstract and realistic work using digital oil paint.\n    Over 50 drawings to be seen. Plenty are unique to the choices you make!\n    Over 40 songs! A unique custom soundtrack with music ranging from classical to club genres. All created by yours truly (Cleril)!\n    Available on Windows, Mac, and Linux on release! \n\n","torrent":{"xt":"urn:btih:6a17626f4642db75cd27244dba5589fe4daae172","amp;dn":"My+Name+is+Addiction+-+Visual+Novel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a17626f4642db75cd27244dba5589fe4daae172","infoHashBuffer":{"type":"Buffer","data":[106,23,98,111,70,66,219,117,205,39,36,77,186,85,137,254,77,170,225,114]},"announce":[],"urlList":[]}}