{"title":"The Litter - $100 Fine 1968 [US Garage Punk Psychedelic Rock]","uid":4843051,"size":180533357,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6ba13c9642b87e38124ebb9de75245b278e2da11&amp;dn=The+Litter+-+%24100+Fine+1968+%5BUS+Garage+Punk+Psychedelic+Rock%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":34,"time":1239574083,"description":"The Litter - $100 Fine 1968 [US Garage Punk Psychedelic Rock]\nCD  To Mp3 320 mbit/s\nIncluded: CD Covers and this Info\n\nBiography\tby Richie Unterberger\nOne of Minneapolis' most popular '60s bands, the Litter are most known for their classic 1967 garage rock single &quot;Action Woman.&quot; With its demonic fuzz/feedback guitar riffs and cocky, snarling lead vocal, it was an archetype of the tough '60s garage rock favored by fans of the Pebbles reissue series. In fact, the single, which got some airplay in Minnesota in early 1967 and then was largely forgotten, didn't reach an international audience until it became cut one, Side One on Volume One of Pebbles in the late '70s. It now has a place of honor on the Nuggets box set. The Litter were a little more successful and long-lived than the average regional garage band, recording a few albums, the last one for a major label, and evolving into a more progressive hard rock outfit before disbanding around the end of the '60s.\n\nThe Litter was formed by members of two Minneapolis area mid-'60s groups, the Victors and the Tabs. (A few songs recorded by the Victors in late 1965 can be heard on the compilation The Scotty Story.) Heavily influenced by the fiercest British Invasion bands, such as the Yardbirds and the Who, they recorded their debut single, &quot;Action Woman&quot;/&quot;A Legal Matter,&quot; with local producer Warren Kendrick in late 1966. &quot;Action Woman,&quot; in fact, was not a Litter original, but a Kendrick composition. Bill Strandlof, who had played the searing guitar lead on &quot;Action Woman,&quot; was replaced by Tom &quot;Zippy&quot; Caplan in the spring of 1967, just before they recorded most of the tracks that comprised their debut album. Leaning heavily on covers of songs by British bands like the Yardbirds, the Who, and Small Faces, Distortions was nevertheless a prime example of sixties garage rock at its most powerful. With the garage rock revival this local release became a coveted collector's item, and has since been reissued several times.\n\nLike many bands in the late '60s, the Litter subsequently went into a more psychedelic/hard rock direction. Their second album, $100 Fine, put more weight on original material, although their sound was growing more generic. Around this time the Litter missed out on some potential big opportunities, turning down offers from both Elektra and Columbia. They appear in a 1968 Chicago psychedelic nightclub scene in political filmmaker Haskell Wexler's classic movie Medium Cool, but only super-briefly; although they're shown playing onstage, the soundtrack includes none of their music, with the Mothers of Invention's &quot;Flower Punk&quot; overdubbed onto the scene. By the time they did get onto a major label for the 1969 album Emerge (on ABC), Caplan and original lead singer Denny Waite had been replaced, and their hard rock sound had become less distinguished. The Litter have reunited and sometimes continued to play and record, with different lineups, into the '90s. \n\nThe Litter $100 Fine [1-10](1968) Larry Loofbourrow Demos [11-28] (1965-68) (1968)\nThis rock cd contains 28 tracks and runs 73min 15sec. \n\nTracklist:\n01. The Litter - Mindbreaker (03:10)\n02. The Litter - Tallyman (02:54)\n03. The Litter - Here I Go Again (02:52)\n04. The Litter - Morning Sun (02:27)\n05. The Litter - (Under The Screaming Double) Eagle (02:42)\n06. The Litter - Apologies To 2069 (01:13)\n07. The Litter - Kaleidoscope (02:19)\n08. The Litter - Blues One (04:14)\n09. The Litter - She's Not There (09:13)\n10. The Litter - Angelica (With J.Frank Wilson) (03:51)\n11. The Litter - For All The Times I'm Happy (Version 1) (02:02)\n12. The Litter - Where Is She Now (02:51)\n13. The Litter - I Can't Forget You (02:20)\n14. The Litter - I'm Really Not Used (To Being Treated Bad) (02:44)\n15. The Litter - I Love My Love (02:42)\n16. The Litter - Oh, So Sad (01:45)\n17. The Litter - I Lost Another Girl Today (Version 1) (01:51)\n18. The Litter - Second Hand Woman (02:07)\n19. The Litter - Only Love (01:33)\n20. The Litter - He Couldn't Find One Anywhere (01:42)\n21. The Litter - I'll Never Love Again (a.k.a.The Egyptian) (02:20)\n22. The Litter - Let Me Feel It Too (01:40)\n23. The Litter - Candy (02:32)\n24. The Litter - (Because) I Need Somebody (To Love) (02:09)\n25. The Litter - (Because) I'm Taking All Your Happiness (Away) (02:19)\n26. The Litter - For All The Times I'm Happy (Version 2) (01:57)\n27. The Litter - I Lost Another Girl Today (Version 2) (01:51)\n28. The Litter - He Couldn't Find One Anywhere (Instrumental) (01:40)","torrent":{"xt":"urn:btih:6ba13c9642b87e38124ebb9de75245b278e2da11","amp;dn":"The+Litter+-+%24100+Fine+1968+%5BUS+Garage+Punk+Psychedelic+Rock%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ba13c9642b87e38124ebb9de75245b278e2da11","infoHashBuffer":{"type":"Buffer","data":[107,161,60,150,66,184,126,56,18,78,187,157,231,82,69,178,120,226,218,17]},"announce":[],"urlList":[]}}