{"title":"Future Pinball and some Tables","uid":4976687,"size":231123587,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6c0c15c7d8ebeb92815981c306c22cf76f2cf69d&amp;dn=Future+Pinball+and+some+Tables&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"falbala145","files":-1,"time":1246033980,"description":"Future Pinball is a real time Pinball Development System. It allows you to design and play your very own pinball simulation in True real time 3D. It uses Advanced Physics to provide the best possible Simulation of a true to life pinball machine.\n\nTables are built up out of Standard components (Plastics, Pegs, Bumpers, Lights etc..) which are placed onto the playfield via the Editor. Objects like Surfaces, Lights and Rubbers are shapeable within the editor and generated real-time when the table is played. Other objects (Bumpers, Flippers, Gates, Triggers, Targets etc..) use pre-made 3d Models (of which there is a nice selection of each type).\n\nThe Table logic is scripted in Visual Basic Scripting (via the Microsoft Scripting Technology's built into Microsoft Windows). Scripting is designed to be simple but flexible enough to allow a wide vararity of Original Games to be created. Only a limited subset of the Visual Basic Scripting Language is used as a lot of extra functionality is provided by the game engine.\n\nFull Sound / Music Support is also provided with multiple Music Channels to allow cross fading.\n\nAs Future Pinball is a Game Construction Program it contains some advanced concepts which may require a little bit of time (and patience) to learn and fully understand (such as computer graphics and scripting concepts).\n &lt;a href=&quot;\nhttp://www.futurepinball.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.futurepinball.com/&lt;/a&gt;\n\n\nWhat Hardware will I Need ?\n\nA Pentium / Athlon processor of 1800 mhz or\ngreater, 512meg ram and at least a (or better)\nGeforce FX / Radeon video card.\nVideo Card MUST support shaders.\t\n\nWhat platforms are supported ?\n\nMicrosoft Windows Vista and XP (SP1 or above)\nor 2000 (unsupported) running\nopenGL 1.5 and Direct X 8 (Direct Input).\nWindows 98/ME/NT are not supported.\n\nFuture Pinball also runs under some linux distributions\nvia the Wine compatibility layer.\n\nFuture Pinball is a free platform for creating realistic pinball tables.Insite this torrent there are a few tables that i gathered after a brief search over the internet.There is a big community of people that are making their own tables and publish them on varius websites ,just search the internet for &quot;future pinball tables&quot; for more tables or follow the links from : &lt;a href=&quot;\nhttp://www.futurepinball.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.futurepinball.com/&lt;/a&gt; \n\n\n\n","torrent":{"xt":"urn:btih:6c0c15c7d8ebeb92815981c306c22cf76f2cf69d","amp;dn":"Future+Pinball+and+some+Tables","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c0c15c7d8ebeb92815981c306c22cf76f2cf69d","infoHashBuffer":{"type":"Buffer","data":[108,12,21,199,216,235,235,146,129,89,129,195,6,194,44,247,111,44,246,157]},"announce":[],"urlList":[]}}