{"title":"Ubuntu 14.04 Custom with applicatins","uid":10554923,"size":3672115905,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:6d2e11ad1d3cb50fc65805a6a28642b668600e76&amp;dn=Ubuntu+14.04+Custom+with+applicatins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"arisepeter","files":-1,"time":1405377937,"description":"This is a customised version of Ubuntu 14.04 code named Trust Tahr. \n\nFor installing this burn the iso image (3.7 GB) in to a DVD or flash drive. Right click on the iso image and click write to disk using k3b/brasero in Linux or Windows DVD burning tool. \n\nReboot the system and the DVD will be booted with a menu. You may select the &quot;Boot Live CD to to run the OS from DVD itself or click Install rightaway. If you choose to boot as Live CD, you can install from inside too. If you have aleady Windows installed it will recognise it and install in a seperate partition. If you want to make a new partition you may choose the type as Ext4 XFS etc. But atleast one of the partition should be choosen as boot partition ie. with &quot;/&quot;. You can have seperate partition for your personal files as &quot;Home&quot;partition or just one partition for everything. When installation completes system rebooted with manu for selecting Ubuntu/ Windows to load. \n\n\nIn addition to the Application available in the official Ubuntu CD, The following applications are bundled with this DVD. \n\n1. Amarok - A stylish and best quality music player\n2. Android Studio - Complete softwere development kit for making android applications \t (updated to the latest version with Android L preview and Open JDK pre installed)\n3. Artha- An English dictionory with meaning and thesures.\n4. Blender - A Popular graphics and animation application\n5. Calender Indicator - Application to enable synchronising with Google calender \n6. Dropbox - File uploading application.\n7. GDebi package installer - fast package installer like synaptic \n8. Gnome Media Player - A nice Media player\n9. Google Chrome - web browser \n10.Google keep - Application for taking notes in Android phone with synchronisation    \t\twith Ubuntu.\n11. Iso master - for modifying disk images\n12. K3b - Stylish and Most useful DVD/CD burning app\n13. Libre Cad - A simple Auto CAD programme.\n14. Modem Manager - Application for managing your 3G dongle. with data balance check \t and sms receiver  \n15. Openshot Video editor - A simple UI Video editor with most functions, though    \ttricky to use.\n16. Opera web browser \n17. Remastersys - For making Installation/Live CD from your Linux Installation like \tthis. for back up too\n18. SM Player - A Superior Quality video Player.\n19. Sound Converter - Converting many types of audio files\n20. Thunderbird mail client \n21. Transmageddon video file converter. \n22. VLC media player - vlc plays all the media files used today.\n23. YPPA - for easily adding PPA to Apt source\n24. Xnote - for simply making notes in desktop\n25. Restricted Extras - for playing All propreietary media formats like mp3, flash etc.\n\nThank You. Have a Nice Day !","torrent":{"xt":"urn:btih:6d2e11ad1d3cb50fc65805a6a28642b668600e76","amp;dn":"Ubuntu+14.04+Custom+with+applicatins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d2e11ad1d3cb50fc65805a6a28642b668600e76","infoHashBuffer":{"type":"Buffer","data":[109,46,17,173,29,60,181,15,198,88,5,166,162,134,66,182,104,96,14,118]},"announce":[],"urlList":[]}}