{"title":"The National Health.avi","uid":8462381,"size":1969220222,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6d97d39275f342dd0ae1e434fb73af82344966b2&amp;dn=The+National+Health.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pigman58","files":1,"time":1368268791,"description":"This film is not commercially available. No copyright infringement is intended and this is for fan use only. This copy is derived from a home VHS recording c. 1985, and the quality is thus indifferent. Ad breaks have been edited out.\n\nThe National Health is a largely forgotten 1973 British black comedy / satire, based by Peter Nicholls on his own play of the same name, which ran on Broadway for 53 performances. Having seen both, I think the film far superior. The film was nominated for a 1973 BAFTA and won the best comedy award in the Evening Standard Film Awards.\n\nThe film is set in the Princess Maria of Battenberg Hospital, a fading Victorian pile, typical of British hospitals in the 1970s, probably in a fairly poor area of London. The patients are a cross section of the local community, some terminally ill, all with their own problems. The staff are overworked - except for the odious ward orderly Bartnett (Jim Dale) - and have little time to care for, or interest in, their patients.\n\nPlaying on the ward television however is the medical soap Nurse Nortons Affair, set in the gleaming new Mount Vernon Hospital. Although this hospital too is somewhere in London, the staff are all beautiful, speak in mid Atlantic accents, and are concerned mostly with their tangled love lives. But wait - have we not seen some of these people before, in the run down NHS hospital.....?\n\nThe film switches between the two hospitals and the characters alter egos, highlighting the differences between the real world of illness and death, and the sanitised world of television. There are some great visual gags in Nurse Nortons Affair, where the acting is suitably big and cheesy, which nicely contrasts the understated acting in the real world. \n\nThe film can be viewed on different levels, but works really well as a black comedy. There is a great cast, including an unknown actor called Bob Hoskins, who work well in this ensemble piece.\n\nEnjoy!\n","torrent":{"xt":"urn:btih:6d97d39275f342dd0ae1e434fb73af82344966b2","amp;dn":"The+National+Health.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d97d39275f342dd0ae1e434fb73af82344966b2","infoHashBuffer":{"type":"Buffer","data":[109,151,211,146,117,243,66,221,10,225,228,52,251,115,175,130,52,73,102,178]},"announce":[],"urlList":[]}}