{"title":"Stroke 9 - 3 Albums 1999 - 2006 [FLAC] - Kitlope","uid":7039020,"size":1084150355,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6e2eb0e50b13abb78b2dded423ac9e69c1854ac0&amp;dn=Stroke+9+-+3+Albums+1999+-+2006+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Kitlope","files":44,"time":1329474661,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Plextor PX-716SA / Samsung SH-S223L\nOptical Drive Firmware: 1.11 / SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes (for my rips)\nEAC Cue Sheet: Yes (for my rips)\nM3U Playlist: Yes (for my rips)\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 6E2EB0E50B13ABB78B2DDED423AC9E69C1854AC0\nFile Size: 1.0 GB\nLabel: Universal\n\n\n\n\n\nAlbums, Years &amp; Catalog # in This Torrent:\n\n\nNasty Little Thoughts 1999 UD 53157 *\nRip It Off 2002 (not my rip)\nCafe Cuts: A Collection of Acoustic Favorites 2006 SXM2-61066 *\n\n\n* Denotes My Rip \n\n\n\n\n\n\nI would like to thank the original uploader of &quot;Rip It Off&quot; Ezzabee from The Pirate Bay for this rip. Thank You! Since it didn't include log &amp; cue files I did an Audiocheck on the file and included the log. If anybody has anymore Stroke 9 please do make available in lossless. Thanks.\n\n\nKit\n\n\n\n\n\nPlease help seed these FLACs! \n\n\n\n\n\nFrom Wiki:\n\n\nStroke 9 is an alternative rock band that was formed in the San Francisco Bay Area in 1989.\n\nThe band formed due to a &quot;Rock Band&quot; class at Marin Academy in San Rafael, just north of San Francisco. In 1990, as a project, students Luke Esterkyn, Greg Gueldner, Tom Haddad and Kirsten Stromberg went to Jim Reitzel's Right Sole Studio in Kentfield, California. They produced a demo containing five songs, including &quot;Blindness&quot;, &quot;Wild&quot;, and &quot;Dream Song&quot;. After spring that year, they took their final half-semester off during Senior Project to form the band Stroke 9 for full credit. They set up in Esterkyn's basement, and started writing songs for their next demo.\n\nStroke 9 had their first &quot;official&quot; live performance at Caffe Nuvo in San Anselmo. They split up for the summer and didn't get back together until the summer of 1991. However, Tom Haddad and Kirsten Stromberg had no desire to revive Stroke 9. Therefore, Esterkyn and Gueldner recruited old schoolmates John McDermott and Stephen Heath. They moved from the basement to the garage and played publicly anywhere that they could. The band put out two independent releases in 1993 and 1995. Eric Stock began filling in on drums in April 1997; Stock was a New York transplant who had previously toured with Modern English.\n\nAfter signing to Universal Records, the band released Nasty Little Thoughts in 1999, which charted in the US, yielded two rock radio hits, &quot;Little Black Backpack&quot; and &quot;Letters&quot;, and was certified Gold by the RIAA on April 21, 2000.[1] The band appeared in the film EDtv as part of the promotion of Nasty Little Thoughts.[2] A second album on Universal followed, entitled Rip It Off. The album's art cover was made to resemble a bootleg CD-R, similar to that of System of a Down's Steal This Album!, which was released about a year later. The album was not promoted heavily, and its lead single, &quot;Kick Some Ass&quot;, was less successful at radio. &quot;Kick Some Ass&quot; also appeared in Kevin Smith's Jay and Silent Bob Strike Back during a montage of Jay and Silent Bob flying around the country to attack message board users who bashed them. Late in 2003, the band split with Universal and announced plans to release its next album, All In, independently.[3]\n\nThe band released Last of the International Playboys on June 5, 2007, on Rock Ridge Records. Stroke 9 also recorded &quot;Tap Tap Domination&quot; for the iPhone OS game Tap Tap Revenge. It also features &quot;The Yeah Song&quot; as a free downloadable track.\n\n\n\n\n\n\n\n\nNasty Little Thoughts 1999\n\n\n\nNasty Little Thoughts is the fourth album from San Francisco, California, USA, alternative rock band Stroke 9. It was released on September 7, 1999.\n\n\n\nTracks: \n\n\n1.\t&quot;Letters&quot;\n2.\t&quot;City Life&quot;\n3.\t&quot;Little Black Backpack&quot;\n4.\t&quot;Tail Of The Sun&quot;\n5.\t&quot;Washin' + Wonderin'&quot;\n6.\t&quot;Make It Last&quot;\n7.\t&quot;Are You In This?&quot;\n8.\t&quot;Not Nothin'&quot;\n9.\t&quot;One Time&quot;\n10.\t&quot;Down&quot;\n11.\t&quot;Angels&quot;\n12.\t&quot;Tear Me In Two&quot;\n\n\n\n\n\n\n\n\nRip It Off 2002\n\n\n\nRip It Off is the fifth album from San Francisco, California, USA, alternative rock band Stroke 9. It was released on October 1, 2002. The song &quot;Kick Some Ass&quot; appeared in the 2001 film Jay and Silent Bob Strike Back, and the music video for the song features the title characters Jay and Silent Bob attacking random fictional singers and rappers.\n\n\nTracks: \n\n\n1.\t&quot;Latest Disaster&quot;\n2.\t&quot;100 Girls&quot;\n3.\t&quot;Vacuum Bag&quot;\n4.\t&quot;Kick Some Ass&quot;\n5.\t&quot;Don't Worry&quot;\n6.\t&quot;Do It Again&quot;\n7.\t&quot;Just Can't Wait&quot;\n8.\t&quot;We Were Wrong&quot;\n9.\t&quot;Reject&quot;\n10.\t&quot;Anywhere&quot;\n11.\t&quot;Lead The Way&quot;\n12.\t&quot;California&quot;\n\n\n\n\n\n\n\n\n\nCafe Cuts  2006\n\n\nCafe Cuts: A Collection Of Acoustic Favorites is an album released by San Francisco, California, USA alternative rock band Stroke 9 on February 7, 2006. It is composed of acoustic versions of popular songs from their discography.\n\n\nTracks: \n\n\n1.\t&quot;Washin' + Wonderin'&quot;\n2.\t&quot;Little Black Backpack&quot;\n3.\t&quot;Do It Again&quot;\n4.\t&quot;Make It Last&quot;\n5.\t&quot;Vacuum Bag&quot;\n6.\t&quot;Letters&quot;\n7.\t&quot;Next Time&quot;\n8.\t&quot;Liar&quot;\n9.\t&quot;Tear Me In Two&quot;\n10.\t&quot;City Life&quot;\n11.\t&quot;Just Can't Wait&quot;\n12.\t&quot;California&quot;\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:6e2eb0e50b13abb78b2dded423ac9e69c1854ac0","amp;dn":"Stroke+9+-+3+Albums+1999+-+2006+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e2eb0e50b13abb78b2dded423ac9e69c1854ac0","infoHashBuffer":{"type":"Buffer","data":[110,46,176,229,11,19,171,183,139,45,222,212,35,172,158,105,193,133,74,192]},"announce":[],"urlList":[]}}