{"title":"Johnny Lever - Hansee Ke Hungame - 1980 Audio - Comedy","uid":6915628,"size":42381375,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6f1858eb8399922d8d3d80b294919245fd5e6531&amp;dn=Johnny+Lever+-+Hansee+Ke+Hungame+-+1980+Audio+-+Comedy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"joshea","files":-1,"time":1325018578,"description":"Johnny Lever was born in a Telugu Christian family and was brought up in Mumbai in King's Circle, Dharavi. Johnny was studied in Andhra Telugu School till the seventh grade but couldn't study further because of financial problems in his family. After which he decided to leave school and started working at a very young age. He did all kinds of work, for example selling pens on the streets of Bombay in a special way of imitating Bollywood stars. He also danced on the songs of Bollywood stars. Hence he developed a passion for mimicry and stand-up comedy, inspired by watching comedians like Johnny Walker, Kishore Kumar and Mehmood in films and mimicry artists like Dinesh Hingoo on stage. He then decided to be a mimicry artist. To seek guidance and help regarding mimicry he met his mentor Pratap Jani and mimicry artist Ram Kumar, who helped him and taught him the basics of mimicry.\n\nHe is known as the king of comedy in Bollywood and known to have inspired many comedians and stand-up artists in India.\n\nIn the 1980s he released his audio cassette of mimicry/comedy, Hansee Ke Hungame, which became a super hit not only in India, but worldwide, after which he became very famous and this took him to another level.","torrent":{"xt":"urn:btih:6f1858eb8399922d8d3d80b294919245fd5e6531","amp;dn":"Johnny+Lever+-+Hansee+Ke+Hungame+-+1980+Audio+-+Comedy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f1858eb8399922d8d3d80b294919245fd5e6531","infoHashBuffer":{"type":"Buffer","data":[111,24,88,235,131,153,146,45,141,61,128,178,148,145,146,69,253,94,101,49]},"announce":[],"urlList":[]}}