{"title":"Sri Lanka's Killing Fields - War Crimes Unpunished.avi","uid":7151408,"size":506631486,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6f18d25a037fb5cfb9cd3537e7fa615d8b6f697f&amp;dn=Sri+Lanka%27s+Killing+Fields+-+War+Crimes+Unpunished.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"publicmedia","files":-1,"time":1333320087,"description":"Sri Lanka's Killing Fields: War Crimes Unpunished\t\n     \n\nIn 2011 Channel 4 exposed damning evidence of atrocities committed in the war in Sri Lanka. Jon Snow presents this powerful follow-up film, revealing new video evidence as well as contemporaneous documents, eye-witness accounts, photographic stills and videos relating to how exactly events unfolded during the final days of the civil war. \n\nThe film forensically examines four specific cases and investigates who was responsible. \n\nThe four cases include: the deliberate heavy shelling of civilians and a hospital in the 'No Fire Zone'; the strategic denial of food and medicine to hundreds and thousands of trapped civilians - defying the legal obligation to allow humanitarian aid into a war zone; the killing of civilians during the 'rescue mission'; and the systematic execution of naked and bound LTTE prisoners - featuring new chilling video footage of a 12-year-old boy who has been brutally executed. \n\nThis painstaking investigation traces ultimate responsibility up to the highest echelons of the chain of command, asking questions of both President Rajapaska and his brother, the Defence Secretary. \n\nSource: http://srilanka.channel4.com\n\nThe torrent file can be downloaded from: http://torcache.net/torrent/6F18D25A037FB5CFB9CD3537E7FA615D8B6F697F.torrent\n\nFull torrent description with video file information here: http://www.pastebay.net/314327\n\nThe first documentary, 'Sri Lanka's Killing Fields', aired on 14/06/2011 can be downloaded from this Info Hash: 32370304BDBCF048C94C95B8D2C2BE909023CCCA","torrent":{"xt":"urn:btih:6f18d25a037fb5cfb9cd3537e7fa615d8b6f697f","amp;dn":"Sri+Lanka%27s+Killing+Fields+-+War+Crimes+Unpunished.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f18d25a037fb5cfb9cd3537e7fa615d8b6f697f","infoHashBuffer":{"type":"Buffer","data":[111,24,210,90,3,127,181,207,185,205,53,55,231,250,97,93,139,111,105,127]},"announce":[],"urlList":[]}}