{"title":"Breaking.Bad.S03E09.H264[quark]","uid":5568812,"size":80458159,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6fec9e28dad6f378a4bd2d8236fe87425684e8b8&amp;dn=Breaking.Bad.S03E09.H264%5Bquark%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twentyforty","files":1,"time":1274081609,"description":"&quot;Home&quot; of my torrents (for Bookmark/Favorites in your browser) &lt;a href=&quot;\nhttp://thepiratebay.se/user/twentyforty&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/twentyforty&lt;/a&gt;\n\nSCHEDULE for this week (and NO more requests):\n\nMonday:  The Simpsons, Desperate Housewives as 272p;\n         Family Guy, Treme as [quark];\n         The Pacific as 360p;\n         Breaking Bad as [quark] and 720p\nTuesday: Chuck, &quot;24&quot;, Gossip Girl, Castle as 272p MP4 H264;\n         HIMYM and TBBT as 360p\nWednesday: Lost, &quot;V&quot; as 272p H264\nThursday: Criminal Minds as 272p MP4 H264;\n          Happy Town as 720p MP4 H264\nFriday:  FlashForward, The Mentalist, Grey's Anatomy as 272p MP4 H264;\n         Supernatural, The Mentalist, FlashForward, The Vampire Diaries and Fringe as [quark];\n         30 Rock as 720p\nSaturday:  Smallville as 272p MP4 H264;\n           Stargate Universe as [quark]\nSunday:  re-seed of week's episodes\n\n\nDO NOT download if you watch on high resolution TV or monitors.\nNOT for handhelds or phones, just computers. \nPlayable in VLC, WMP and MPC with CoreCodec and DivX 7 AAC DShow filter, \nmplayer, KMplayer and of course, in QuckTime Player.\nHowever, picture is better than 90% of CAMs and definitely watchable. Goal was &quot;preview&quot; quality, not the ultimate one - what is self-evident from redicolously small file-size. Trade-offs must be included.\nAnd please, do not watch it with a nose in the screen, take proper distance to the monitor or TV (as advised in TV manuals).\nFor example; when I finish encoding, I always check out the file, do short preview, rewinding back and forth. It usualy looks ugly - but - then I move back and sit on the sofa, 6 feet away - and everything looks as it should. Nice and watchable, like on older, analog TV set. Not to force you, but take my advice regarding watching seriously.\n\nWARNING: \n                     a) If you are from developed countries, have download \n                     speed above 15 KB/s, think twice what are you doing.\n                     b) If you download [quark] to test your &quot;equipment&quot; \n                     forget about it, on first sign of &quot;malfunctioning&quot;\n                     or &quot;misdoings&quot; of any kind I will block you. (if you \n                     change IP number, I will block your ISP, your region, \n                     your country and even whole continent. \n                     So, think thrice what are you doing. \n                     Internet IS Big place and you can go anywhere else, true? \n                     No one force you to download my torrents, right?\n                     c) If you have FAST connection, HELP the people by downloading\n                      - however NOT as you've done elsewhere, but by KEEPING your \n                     UPLOAD SPEED at MAX. Any other behavior will be treated\n                     appropriately.\n                     d) When you finished downloading [quark] STAY TO SEED. \n                     Anyone who can download - CAN UPLOAD too.\n                     Ones who cannot - only because they are poor - are excluded.\n                     Ones who are not poor, I beg you to show two things: \n                     solidarity and perpetual goodness.\n                     \n                     \nPLEASE, think about the ones who have Internet but cannot afford download of big files.\nEvery day I have 10% of my peers on dial-up and ancient hardware who need whole day to download a &quot;normal&quot; sized 350MB.\nPlease, I beg you for understanding of my work, let them through and if you can - help them by downloading and seeding afterward as long as you can. These people have slow download and it helps them a lot (please, be generous - on such file having ratio 9:1 is like 1:1 on normal-sized XviD).. \nExample for the ones looking more on ratio numbers, than real and &quot;generated&quot; traffic (ones who need to save - skip this, its just an example):\n&gt;&gt;XviD's downloading 350MB: giving back 350MB equals 700MB (1:1 ratio)\n&gt;&gt;[quark]'s is ~70MB + 9 times 70 = 630 MB (well... 70 MB &quot;less&quot;)\nSo, people who can give more, should not be focused on plain ratio-number too much - in &quot;world&quot; of [quarks] many things are different.\n\nThank you.\n\n******************************EXAMPLE*************************************\n\n&gt; ....... at 2010-04-15 22:59 CET: \n\nthanks, i'll be seeding for the rest of the day, but my upload speed sucks and won't make a big difference.\n\n&gt;....... at 2010-04-16 06:09 CET: \nP.S. I am having a problem understanding 'RATIOS'in relation to seeding.\n        I use uTorrent 2.x and it uses percentages for ratio of seeding.\n\n&gt;&gt;&gt;twentyforty at 2010-04-16 06:56 CET: \n\nRatios are irrelevant guys. They are &quot;numbers&quot; that mean something just - to you.\nIf someone pays, pays by the traffic (megabytes, gigabytes) not by the ratio, right?\n\nThe point I was trying to make was just: If you want... and can - seed - do not look at the ratio. \nFile is mostly in range 20 - 70 MB.\nTo seed few FILES back to the people, doesn't look too costly. And it doesn't looks complicated to understand too\n\nUnfortunately, that's why [quark] torrent dies within 6 hours. Many little hands together can move the mountain. For instance, most downloaded [quark] is &quot;The Vampire Diaries&quot; - 1147 times. Could you imagine that ALL people stayed to seed - at 1kB/s? Just that. At least for a while. I do understand the problem of daily nature of the daily talk shows pack (shelf-life is built-in), but - for sake of god - not to stay on two-three seeders within few hours.\nAny torrent with more than 8.4% Hit&amp;Run people will die very, very fast.\nTherefore, I delete the torrents loaded by selfish people. At cost of all others (including myself).\n\n********** MANY LITTLE HANDS TOGETHER CAN MOVE THE MOUNTAIN **************\n\n--------------------------------------------------------------------------\nNOTE: 720p comes after, choose version you need.\n--------------------------------------------------------------------------\n\nPlease, after finished download keep the torrent active. Seed. I get lot of e-mail from peers who are on stone-age dial-up with 5 kb/s &quot;speed&quot; and they feel left out. As long as you can (24h suffice), as much as you can. World live all around the clock and your morning is late night somewhere else, where some of our friends eagerly (maybe more than you) wants to download and watch newest episode. Imagine disappointment when torrent is &quot;dead&quot; same day because anybody - is gone.\n\nPlease, do seed. You'll see how slow some connections are and it wouldn't cost you too much - money-wise. \nBut, you'll be payed back, one day, from some perfect stranger on way totally different. And vice-versa.\n\nI beg you... it's not about me, I profit nothing, I gain nothing, I sell nothing too. It's about help, compassion and what was left of goodness in each and every human.\n","torrent":{"xt":"urn:btih:6fec9e28dad6f378a4bd2d8236fe87425684e8b8","amp;dn":"Breaking.Bad.S03E09.H264%5Bquark%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fec9e28dad6f378a4bd2d8236fe87425684e8b8","infoHashBuffer":{"type":"Buffer","data":[111,236,158,40,218,214,243,120,164,189,45,130,54,254,135,66,86,132,232,184]},"announce":[],"urlList":[]}}