{"title":"Haydn - The Complete Symphonies - Dennis Russell Davies","uid":6114351,"size":10735738479,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:716c5265fdfdbf4c1ba4937032122255aa3708dc&amp;dn=Haydn+-+The+Complete+Symphonies+-+Dennis+Russell+Davies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Lucy1948","files":114,"time":1295486864,"description":"I wasn't sure what to expect from this new set from Sony of the complete Haydn symphonies. The Stuttgart Chamber Orchestra is one of the best chamber orchestras in the world, if not THE best, but I have not always been favorably impressed by the work of its conductor, Dennis Russell Davies. In particular, I found his recent Bruckner recordings to be less than inspired. What a delight to find this new Haydn set to be a gold mine of carefully thought out and beautifully performed music of the highest order! (Since this is a chamber orchestra playing modern instruments, don't expect astringent, vibratoless playing that you would get in historically retrograde performances.)\n\nThis is no set of barely rehearsed studio run-throughs. Each symphony, from the earliest works to the last masterpieces are played with a sense of commitment, clear articulation and sensitive phrasing in live performances. (Not everyone will like the fact that audience applause is included at the end of each symphony, but audience noise is not noticeable during the performance itself.) The sound is especially good: clear, well balanced with every musical line clearly evident and with some bloom to provide a rich panorama that is pleasing to the ear.\n\nI began my listening with number 71, a fairly long middle period symphony. The opening movement gave me the first indication that Davies' approach was going to be deliberate without being heavy, with each strand given its due, with plenty of spring in the instrumental articulation. Next I listened to number 1 and was a little taken aback at the measured tempo for a movement marked &quot;Presto&quot; - but the tempo seemed chosen to give clear voice to each detail of the score. The Stuttgart players show their stuff in the lovely playing of slow movements, keeping their concentration while treating the listener to some lovely music-making. Then I played Symphony 97, which is my favorite, and found it delightful from beginning to end.\n\nAs I've listened to more of this set, I would say: Don't walk ... RUN to get your hands on this marvelous achievement, if you are a lover of Haydn symphonies. I have both the Dorati and Fischer sets of the complete symphonies (as well as the complete set on Naxos done by various conductors), and while each has its virtues and drawbacks, this new one from Davies and the Stuttgart players is better in every way: better sound, more consistent and committed playing, and the involvement and fizz of live performance. I haven't heard every symphony in this box yet, but I have yet to run into my first dud.\n\nGenerally the packaging is very handsome, with some oddities. The works are not presented in numerical order, but are grouped within six time sequences: Early Symphonies, The First Symphonies Written for Prince Esterhazy, The &quot;Storm and Stress&quot; Works, Symphonies for Entertainment Purposes, Symphonies for the Public at Large, and the London Symphonies. Each time period has its own color-coded cardboard sleeves. For some reason, Sony has chosen to unnecessarily enlarge the box by nearly an inch in depth, padding the extra space with cardboard. As if collectors don't have enough problems with shelf space! But this is a minor quibble.\n\nDavies and the Stuttgart have done themselves proud!\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:716c5265fdfdbf4c1ba4937032122255aa3708dc","amp;dn":"Haydn+-+The+Complete+Symphonies+-+Dennis+Russell+Davies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"716c5265fdfdbf4c1ba4937032122255aa3708dc","infoHashBuffer":{"type":"Buffer","data":[113,108,82,101,253,253,191,76,27,164,147,112,50,18,34,85,170,55,8,220]},"announce":[],"urlList":[]}}