{"title":"American Anthrax.mpeg","uid":9538607,"size":432025600,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:7181c2e437634e9ea90360f5fe988b84ffa2a134&amp;dn=American+Anthrax.mpeg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"H2oDragon","files":1,"time":1390987211,"description":"\n\nPublished on Jan 26, 2014\n &lt;a href=&quot;\nhttp://www.mediaroots.org/mr-document...&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mediaroots.org/mr-document...&lt;/a&gt;\n\nMedia Roots presents American Anthrax, a documentary comprised of news footage that establishes, by history's own narration, how everything you've been told about the Anthrax Attacks is a lie. Conceptualized, edited and produced by Robbie Martin, co-host of Media Roots Radio.\n\nSeptember 11, 2001   {actually 2000, noticed as i put it on my fave tor site: tpb]    , shook the United States to the core, a country that had been nearly untouchable since its democratic inception. However, immediately following this horrific tragedy, another equally as impactful 'terrorist attack' occurred when weaponized anthrax was sent to multiple Congressman and journalists through the U.S. Postal Service.\n\nThe attacks on the World Trade Center and the Pentagon were both one-time events that happened in two prominent cities. Unlike 9/11, the Anthrax Attacks localized terrorism and spread fear to every corner of American life, where the simple act of getting your mail could prove to be fatal. Five people died as a result of breathing in the deadly anthrax spores, including postal workers and one NY Post reporter. Countless others were infected.\n\nThe Bush administration initially tried to link this 'second wave of terrorism' to al-Qaeda with zero proof. Once that talking point out-lived its usefulness, the official narrative began leaning towards Saddam Hussein and his mythological biological weapons program.\nEstablishment propagandists like John Mccaine and ABC news reporters intentionally spread disinformation to plant the seed in the public mind that the anthrax came from Iraq, which eventually lead to Colin Powell's infamous 2003 WMD speech at the UN. All the while, the U.S. government was fully aware that the anthrax did not come from an external source, because the strain showed tell-tale signs of being a specific anthrax strain that was weaponized and manufactured by the U.S. military.\n\nRegardless, the idea of the Anthrax Attacks being executed by an external terrorist organization remained conventional wisdom the public was conditioned into believing in the aftermath of 9/11. Eventually, two men were accused of being the perpetrators behind the attacks, yet no charges were ever brought to either of them. The first accused individual, Steven Hatfill, ended up being rewarded a multimillion dollar settlement from the government for being wrongly accused before any evidence was presented against him. The subsequent accused individual, Bruce Ivins, allegedly committed suicide while the FBI was trying to break him into confessing.\n\nUltimately, the FBI asked the National Academy of Sciences (NAS) to verify its evidence pointing to Ivins as the main suspect. Instead, the NAS concluded that the DNA in the anthrax sent in the mail was in fact not a match to the anthrax Ivins worked with. Before the National Academy of Sciences finished their independent investigation, the FBI rushed its preestablished conclusions about Ivins's guilt to the press, and the case was closed. To this day, the FBI has never commented on the many glaring contradictions in the official government narrative about the Anthrax Attacks.\n\nFollow Robbie at @fluorescentgrey\n &lt;a href=&quot;\nhttp://www.mediaroots.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mediaroots.org&lt;/a&gt;\n\n    Category\n\n    News &amp; Politics\n    License\n\n    Standard YouTube License\n\n    7:57 Les Guignols de l'Info du 27 11 13 Rouler en Peugeot ! Canal+ 2013by Les guignols5,345 views\n    3:30 El Komander - el Chino antraxby Mandon60251,625 views\n    2:00 DSK et sa recette pour sortir la France de la criseby Alain Parvi110,542 views\n    46:09 Barry Kissin 2013 &quot;The Anthrax Attacks&quot;by 911TVorg347 views\n    8:10 Guignols.De.L'Info.2011by Mon Nom est Personne51,596 views\n    4:58 Your Encryption is No Match for The NSA's Quantum Computerby Foo DailyNews225 views\n    2:35 ALERT! H1N1 CDC flu pandemic surges Oregon hospitals VR MorningMayan SHTF WROLby BakersBoyz229 views\n    4:09 ","torrent":{"xt":"urn:btih:7181c2e437634e9ea90360f5fe988b84ffa2a134","amp;dn":"American+Anthrax.mpeg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7181c2e437634e9ea90360f5fe988b84ffa2a134","infoHashBuffer":{"type":"Buffer","data":[113,129,194,228,55,99,78,158,169,3,96,245,254,152,139,132,255,162,161,52]},"announce":[],"urlList":[]}}