{"title":"Encyclopedia of Politics: The Left and the Right (2 Vols){BBS}","uid":6734638,"size":29603779,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72513c8661da1b0000c63b6f902bad75701f099c&amp;dn=Encyclopedia+of+Politics%3A+The+Left+and+the+Right+%282+Vols%29%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1318282132,"description":"If one can believe the pundits on the Sunday morning TV political shows, there is no center remaining in politics, only the Left and the Right. It is no wonder that this latest offering from Sage is not only subtitled The Left and the Right but each political side is in a separate volume, as if there could be no coming together of the two, even between the covers of a book.\n\nThe Leftand the Right are political concepts widely used and, it is assumed, widely understood and accepted. In more than 450 entries, these volumes attempt to delve more deeply into what these terms mean and imply. In each volume, alphabetically arranged entries cover countries, people, movements, ideological principles, and more. Most entries are at least a page long and generally have a historical focus. Volume 1 contains a time line and a &quot;Reader's Guide&quot; that lists topics and shows where they fall (for example, &quot;People on the Left,&quot; &quot;People on the Right&quot;). Volume 2 has a &quot;Resource Guide&quot; listing books, journals and magazines, and Web sites; an extensive glossary; and a set index. As one might expect of a reference encyclopedia from Sage, this source has high production values, with excellent paper, readable type, and proper bibliographies at the end of each entry. The editor has appropriate credentials for such an undertaking, as do those on the list of contributors. The content of the articles is clear and balanced. At a first examination, this is a seemingly excellent reference source.\n\nThe sense of balance disappears when one takes a look at the choice of which volume contains which articles. The entries dealing with the countries of the world appear in both volumes, with the emphasis of the discussion matching the &quot;leaning&quot; of the volume. Concepts such as Censorship, Feminism, and Supreme Court appear in both. Some topics obviously belong in one volume or the other and are appropriately located. However, others are assigned to a volume with what could be considered bias. For example, the articles on Education, Patriotism, Religion, and Taxes appear in the volume for the Right, but there is no corresponding discussion of the concepts in the volume for the Left. Conversely, Campaign finance, Environmentalism, and Human Rights are assigned only to the Left.\n\nIt is difficult to properly assess this reference source. It could be both very useful and a source of outrage (not a common pairing in standard reference books). For collections in which political science is a major subject, purchase might be unavoidable, but users might need some explanation. Danise Hoover\nCopyright Ã‚Â© American Library Association. All rights reserved\nReview\n&quot;The 450 articles have been written by an impressive array of world scholars, creating an appropriately global perspective. A brief time line of politics and helpful glossary of terms are appended, along with a reader's guide and index. . . . The work is a solid and lasting contribution to the understanding of the issues that divide us politically. Highly recommended for its readability, scholarly content, and uniqueness.&quot; (Kelli Perkins Library Journal )\n\n&quot;This two-volume set would be helpful to students with a renewed interest in politics. The writing is clear and concise.&quot; (Laura Younkin )\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 1088 pages\n    * Publisher: Sage Publications, Inc; 1 edition (March 17, 2005)\n    * Language: English\n    * ISBN-10: 1412904099\n    * ISBN-13: 978-1412904094","torrent":{"xt":"urn:btih:72513c8661da1b0000c63b6f902bad75701f099c","amp;dn":"Encyclopedia+of+Politics%3A+The+Left+and+the+Right+%282+Vols%29%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72513c8661da1b0000c63b6f902bad75701f099c","infoHashBuffer":{"type":"Buffer","data":[114,81,60,134,97,218,27,0,0,198,59,111,144,43,173,117,112,31,9,156]},"announce":[],"urlList":[]}}