{"title":"Studio Television Production and Directing{BBS}","uid":6673708,"size":34044288,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72dd5c829964f247f1f0ee91ed89cad4b553c232&amp;dn=Studio+Television+Production+and+Directing%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315959816,"description":"Learn how to direct television programs, understand complex directing tasks, and learn the fundamentals of studio production procedure in this back-to-basics guide to studio-based productions. Learn about lighting, set, camera operations, floor direction, technical direction, audio, tape, graphics, prompting, and assistant directing. As it's one of the most challenging types of programming, the live newscast is used to illuminate television producing and directing procedures for your newscast or other program genre. You'll soon be able to direct any type of studio-based program with ease.\n\n* A short, quick, easy-reference guide to multicamera TV directing\n* Heavily illustrated and written in the popular Media Manual format, designed for use on the job\nAbout the Author\nAndrew H. Utterback, Ph.D. is an Assistant Professor in the Department of Communication at Eastern Connecticut State University. As a former Senior Production Technician, he writes from professional studio-based television experience on over 300 major production assignments that include program credits in master control, as grip, gaffer, camera operator, tape op, floor director, audio, technical director, graphics, assistant director, and as director. Since 1996, Dr. Utterback has trained hundreds of students in Studio Television Production at the University of Utah, Northern Arizona University, Marist College, and Eastern Connecticut State University.\n\nProduct Details\n\n    * Paperback: 200 pages\n    * Publisher: Focal Press (March 8, 2007)\n    * Language: English\n    * ISBN-10: 0240808738\n    * ISBN-13: 978-0240808734","torrent":{"xt":"urn:btih:72dd5c829964f247f1f0ee91ed89cad4b553c232","amp;dn":"Studio+Television+Production+and+Directing%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72dd5c829964f247f1f0ee91ed89cad4b553c232","infoHashBuffer":{"type":"Buffer","data":[114,221,92,130,153,100,242,71,241,240,238,145,237,137,202,212,181,83,194,50]},"announce":[],"urlList":[]}}