{"title":"Making.Mr.Right.S01E01.VeroVenlo","uid":7999273,"size":431378654,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:72f2ba1d7915cd0beb9944ae3cdba98da4d9bd6d&amp;dn=Making.Mr.Right.S01E01.VeroVenlo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"verovenlo","files":1,"time":1357703236,"description":"\n\n\n\n&quot;Making Mr. Right,&quot; which will determine just how far three women will go to find true love. With the help of 15-year veteran successful matchmaker April Beyer, three single women pose as &quot;expert matchmakers&quot; to pull a rouse on 14 unsuspecting guys who think they've signed up for a show called &quot;Match Me If You Can.&quot; Brittany Skipper, Lindsay Osborne and Rachel Seeker pretend to find these guys true love, but in reality are there to mold the guys into their own versions of &quot;Mr. Right.&quot; In order to find their Mr. Right, the &quot;matchmakers&quot; will put the men through a series of challenges designed to test not only their dating skills, but also to reveal their flaws, and with their animated personalities and dating personas the process gets very intense. Brittany, Lindsay and Rachel will get an insider's point-of-view coaching these men, molding them and showing them what it takes to be the perfect partner. Besides jaw-dropping make-overs and difficult challenges, the contestants will also be given the opportunity to showcase their romantic abilities by being professional, charming and sexy for their &quot;matchmakers.","torrent":{"xt":"urn:btih:72f2ba1d7915cd0beb9944ae3cdba98da4d9bd6d","amp;dn":"Making.Mr.Right.S01E01.VeroVenlo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72f2ba1d7915cd0beb9944ae3cdba98da4d9bd6d","infoHashBuffer":{"type":"Buffer","data":[114,242,186,29,121,21,205,11,235,153,68,174,60,219,169,141,164,217,189,109]},"announce":[],"urlList":[]}}