{"title":"Stossel.2014.02.27.[Battle of the Ages].FBN.CF.avi","uid":9694762,"size":349434040,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:72f9fce504f39b097067a1e76fd822897d7e8168&amp;dn=Stossel.2014.02.27.%5BBattle+of+the+Ages%5D.FBN.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1393919881,"description":"----------\n\nSTOSSEL - [Battle of the Ages] - Fox Business Network\n2014, February 27, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nGENERATIONAL THEFT: Thanks to Medicare and Social Security, my generation takes money from younger people, who have much less money than we have:\n\n(Source: Nielsen Claritas)\n\nJonathan Bydlak of the Coalition to Reduce Spending wants this spending reduced. Mike Konczal of the Roosevelt Institute says government should spend more.\n\nOVERPOPULATION MYTH: The birth rate in America is below replacement level, and some people think that's a good thing, because they worry about overpopulation. Jonathan Last, author of &quot;What to Expect When No One's Expecting,&quot; explains why that fear is absurd and why we need new births (new brains, new inventors, new wealth-creators) to pay for my generation's retirement.\n\nBABY BOOMERS: P.J. O'Rourke, author of &quot;The Baby Boom,&quot; says Baby Boomers are &quot;spoiled, self-indulged and self-obsessed, but that selfishness led to tremendous creativity.&quot;\n\nCURMUDGEON CRUSADE: An amazing thing has happened. This woman has been reborn in the body of Bill O'Reilly:\n\nCarrie Nation (above) of the Women's Christian Temperance Union helped bring America alcohol prohibition. O'Reilly claims marijuana, violent video games and too much texting corrupt our youth and weaken America. He should chill out! Youth violence has dropped over the past 20 years. Teen pregnancy also declined, and fewer teens have sex.\n\nMILLENNIALS: Charlotte Hays, author of &quot;When Did White Trash Become the New Normal?&quot; says young people don't get jobs because they don't do what they need to do. &quot;The Gen Y Guy&quot; Jason Dorsey says millennials have skills that we geezers don't understand.\n\nTHE CULTURE OF OUTRAGE: I was disappointed to see Miley Cyrus &quot;twerking&quot; at the Video Music Awards. Michael Moynihan of The Daily Beast calls this moral panic, and says it gives the media something to hype. Is Cyrus's act different from Madonna's or Elvis Presley's iconic swiveling hips? At the time, even Frank Sinatra objected to that, saying &quot;His kind of music is deplorable, a rancid smelling aphrodisiac. It fosters almost totally negative and destructive reactions in young people.&quot; Outrage is part of the media circus.\n\nMY TAKE: Old people always talk about the &quot;good old days&quot;. But the good old days were not so good. When I was young, more kids were intolerant, racist, sexist and homophobic. Kids today are better, not worse. I'm sorry my generation demands so much money from them. ","torrent":{"xt":"urn:btih:72f9fce504f39b097067a1e76fd822897d7e8168","amp;dn":"Stossel.2014.02.27.%5BBattle+of+the+Ages%5D.FBN.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72f9fce504f39b097067a1e76fd822897d7e8168","infoHashBuffer":{"type":"Buffer","data":[114,249,252,229,4,243,155,9,112,103,161,231,111,216,34,137,125,126,129,104]},"announce":[],"urlList":[]}}