{"title":"The Anthony Cumia Show 2015-04-29 Colin Flaherty MP4 MP3","uid":11871016,"size":328244421,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:73b0415438c343d0e083cee3f418254ae4fdd26f&amp;dn=The+Anthony+Cumia+Show+2015-04-29+Colin+Flaherty+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mothergoose58","files":2,"time":1430413615,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Colin Flaherty\n\nEpisode 154 - A flustered Ant tell us about bad Beavis, gets into Baltimore coverage by looking at a Geraldo news clip, Shepard Smith's excitement, seeing a disappearing arrest act, and we find out &quot;thug&quot; is now a bad word. We watch Gavin McInnes's new video, Anthony talks about accepting police help, debunking stats, Gray's lawyer William Murphy suggesting that running from the cops is ok, and Ant suggests making some changes and looking at facts. KtC reminds everyone that TACS website will have outage over the weekend, we get an Apple Watch update from Rat, and Ant relocates to the table of the stars to meet with Colin Flaherty. Ant and Colin discuss people's fear of speaking their mind, a firing over at AT&amp;T, the word &quot;courageous&quot; have no weight, victimization in the black community, hypocrisy in reporting, myths in mantras, cooking the books, cop harassment, and racial reporting. They also talk about addressing commonality, excuses versus accountability, Colin explains the title of his book &quot;Don't Make the Black Kids Angry&quot;, the guys conversate about people that think violence is fine, excuses, &quot;white racism&quot;, religious leaders, open and honest dialect, rushing to judgement, and why it's taking so long to find out what happened to Freddy Gray's spine. We look at a news story regarding a possible &quot;race fight&quot;, the guys chat up racial division in police departments, politicians finger pointing in communities, standing up to scrutiny, racial discrimination lawsuits, using the past as an excuse, profiling, and they wrap up on the of topic of changing people's denial.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:73b0415438c343d0e083cee3f418254ae4fdd26f","amp;dn":"The+Anthony+Cumia+Show+2015-04-29+Colin+Flaherty+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73b0415438c343d0e083cee3f418254ae4fdd26f","infoHashBuffer":{"type":"Buffer","data":[115,176,65,84,56,195,67,208,224,131,206,227,244,24,37,74,228,253,210,111]},"announce":[],"urlList":[]}}