{"title":"Core Temp Version 1.0 RC5 - 28th February, 2013","uid":8490029,"size":1611344,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:73f38a4530f9eb83d620cf98a9124054fa674fe0&amp;dn=+Core+Temp+Version+1.0+RC5+-+28th+February%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prodallasosoft","files":1,"time":1368981731,"description":"Version 1.0 RC5 - 28th February, 2013\n\n*** Core Temp Monitor is now available, an Android app to monitor your machines from anywhere in the world! More information can be found here.\n\n- New: Multilingual interface. Core Temp now natively supports adding non-English languages.\n- New: Plugin system - 3rd party developers can now create plugins and extensions for Core Temp, both native code and .Net is supported, please see this for more information.\n- New: Added support for Intel Pentium and AMD K5 and newer processors. (detection only, Temperature by Acpi Thermalzones)\n- New: Added support for VIA processors. (C3 - detection only, Temperature by Acpi Thermalzones)\n- New: Intel Sandy Bridge, Ivy Bridge, AMD Bulldozer, Piledriver and Fusion (Trinity, Llano, Brazos) support.\n- New: Max TDP detection on supporting processors.\n- New: Active power consumption on Intel's Sandy Bridge and Ivy Bridge processors.\n\n- Fix: All of the user reported bugs and many more unreported problems.\n\n- Update: Optimized the startup code, Core Temp should now launch 2 to 4 times faster.\n- Update: Optimized many other aspects of the code, Core Temp should now consume much less CPU time than before.\n- Update: Restored support for older OS: Windows XP is now fully supported, Windows 2000 requires security updates KB935839, KB835732 and GDI+. In some cases hotfix KB816542 may be needed as well.","torrent":{"xt":"urn:btih:73f38a4530f9eb83d620cf98a9124054fa674fe0","amp;dn":"+Core+Temp+Version+1.0+RC5+-+28th+February%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73f38a4530f9eb83d620cf98a9124054fa674fe0","infoHashBuffer":{"type":"Buffer","data":[115,243,138,69,48,249,235,131,214,32,207,152,169,18,64,84,250,103,79,224]},"announce":[],"urlList":[]}}