{"title":"Evanovich_Janet-Ten_Big_Ones.epub","uid":9224746,"size":197690,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74d9a09adcbb9adba988341c460a9069730d0e5b&amp;dn=Evanovich_Janet-Ten_Big_Ones.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1384991376,"description":"She's accidentally destroyed a dozen cars. She's a target for every psycho and miscreant this side of the Jersey Turnpike. He mother's convinced she'll end up dead...or worse, without a man. She's Stephanie Plum and she kicks butt for a living (well, she thought it would sound good to put it that way...)\n\nIt begins as an innocent trip to the deli-mart, on a quest for nachos. But Stephanie Plum and her partner, Lula, are clearly in the wrong place at the wrong time. A robbery leads to an explosion, which leads to the destruction of yet another car. It would be just another day in the life of Stephanie Plum...except that she becomes the target of a gang. And the target of an even scarier, more dangerous force that comes to Trenton. With super bounty hunter Ranger out of town (and Stephanie on the outs with vice cop Morelli), she finds herself alone, with a decision to make: how to protect herself and where to hide while on the hunt for a killer known as the Junkman. There's only one safe place, and it has Ranger's name all over it-if she can find it. And if the Junkman doesn't find her first. With Lula riding shotgun and Grandma Mazur on the loose, Stephanie Plum is racing against the clock in her most suspenseful novel yet. Ten Big Ones is page-turning entertainment and Janet Evanovich is the best there is.","torrent":{"xt":"urn:btih:74d9a09adcbb9adba988341c460a9069730d0e5b","amp;dn":"Evanovich_Janet-Ten_Big_Ones.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74d9a09adcbb9adba988341c460a9069730d0e5b","infoHashBuffer":{"type":"Buffer","data":[116,217,160,154,220,187,154,219,169,136,52,28,70,10,144,105,115,13,14,91]},"announce":[],"urlList":[]}}