{"title":"Paris - Big Towne, 2061 [1976][2013][320KBPS][Japan SHM-CD]","uid":9464105,"size":99732141,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:75ef4e8e8ec6003e3e30eac0ed4e0b2088b90ff9&amp;dn=Paris+-+Big+Towne%2C+2061+%5B1976%5D%5B2013%5D%5B320KBPS%5D%5BJapan+SHM-CD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":14,"time":1389415890,"description":"Paris - Big Towne, 2061 [1976][2013][Japan SHM-CD]\n\n\n\n\n\n01 Blue Robin\n02 Big Towne, 2061\n03 Pale Horse, Pale Rider\n04 New Orleans\n05 Outlaw Game\n06 Money Love\n07 Heart Of Stone\n08 Slave Trader\n09 1 In 10\n10 Janie\n\n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nParis was an American rock music power trio formed in 1975 by guitarist and vocalist Bob Welch, who had just left Fleetwood Mac, bass player Glenn Cornick, formerly of Jethro Tull, and drummer Thom Mooney who had been a member of Nazz with Todd Rundgren. The group released two albums for Capitol Records, but was largely unsuccessful and split in 1977. After the first album, Mooney was replaced by Hunt Sales, who had also played with Rundgren.\n\nInitially the band's sound was rock-oriented, but later developed towards funk, and represented a departure from Welch's work with Fleetwood Mac. A third album was planned, but Sales fell ill and the band split. Songs from the aborted third Paris album were used for Welch's first solo album, French Kiss, and the deal with Capitol was converted into a solo album deal for Welch.\n\nAfter Paris split up, Welch launched a successful solo career, and Sales worked with Iggy Pop and later Tin Machine with David Bowie. British-born Cornick moved to the US where, after a decade out of the music business, he reformed his band Wild Turkey in the 1990s.\n\n-----------------------------------------------------------------------------------\n\nBig Towne, 2061 was the second of the two albums recorded by Paris, a power trio who were active from 1975-1977.\n\nParis originally comprised guitarist Bob Welch, formerly with Fleetwood Mac, bassist Glenn Cornick, formerly of Jethro Tull and drummer Thom Mooney, formerly of Nazz, but Mooney left shortly after recording the eponymous first album, so drums on this album were played by Hunt Sales, who had previously been with Todd Rundgren's Runt.\n\nThe album was not critically acclaimed, and did not sell well, reaching #152 on the Billboard pop album chart.\n\nBob Welch had written most of the songs for a projected third Paris album, when Sales fell ill, and the group disbanded before recording started, so Welch used these tracks on his solo album French Kiss.\n","torrent":{"xt":"urn:btih:75ef4e8e8ec6003e3e30eac0ed4e0b2088b90ff9","amp;dn":"Paris+-+Big+Towne%2C+2061+%5B1976%5D%5B2013%5D%5B320KBPS%5D%5BJapan+SHM-CD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75ef4e8e8ec6003e3e30eac0ed4e0b2088b90ff9","infoHashBuffer":{"type":"Buffer","data":[117,239,78,142,142,198,0,62,62,48,234,192,237,78,11,32,136,185,15,249]},"announce":[],"urlList":[]}}