{"title":"Obert Skye - Pillage, Choke, Ambush (Pillogy) epub &amp; mobi","uid":9250605,"size":9494714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:761bb12b91f7ee44959fcb18a8385b22c763a160&amp;dn=Obert+Skye+-+Pillage%2C+Choke%2C+Ambush+%28Pillogy%29+epub+%26amp%3B+mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"RedLegsGreaves","files":-1,"time":1385455873,"description":"Pillage\nWhen fifteen-year-old Beck Phillips travels by train to the secluded village of Kingsplot to live with his wealthy but estranged uncle, Beck discovers some dark family secrets. A buried basement, a forbidden wall, an old book of family history with odd references to . . . dragons? Beck s life is about to be changed forever in this suspenseful tale about the destructive nature of greed and the courage to make things right. Pillage is filled with Mr. Skye s signature humor as well as some very intense moments, including a surprise ending, that will keep readers young and old engrossed and entertained.\n\nChoke\nPillage was the first of three books in the fantasy adventure that Obert Skye calls a Pillagy. Choke, the second volume, continues the eccentric adventures of Beck Phillips, who seems to have a knack for causing mischief in the secluded village of Kingsplot. In Pillage, Beck used his unique gift to hatch several dragon eggs. Thankfully, the dragons were destroyed . . . or were they? In Choke, a stranger has discovered that Beck Phillips is the key to finding and hatching a lost dragon s egg a task that will allow the stranger to claim the Pillage treasure for his own. Beck learns that outward appearances can be deceiving and that sometimes grown-ups really do have valuable lessons to offer. Readers will laugh out loud at Beck s antics and sit on the edge of their seats as Beck and his friends confront Lizzy, the largest, most ferocious dragon Beck has ever seen!\n\nAmbush\nThings are strange in the town of Kingsplot. The usually sleepy town is experiencing things it just can t explain. Plants are vandalizing the museum, buildings are being torn apart at night, and the minds of residents are growing foggy and confused. In the Pillage manor above the town, Beck s life is unraveling as well. The girl he cares for has had enough, his father is in the hospital, and the madness that has poisoned Beck s ancestors is beginning to infect his own thoughts. There s also the matter of the manor. Behind its walls and floors are more surprises, including an elevator that s been walled up for years. Furthermore, in order to save his father, Beck must plant the final dragon stone, which brings to life much more than he expected. Not just one dragon appears, but three the king and two wicked guardians. Beck s new desire to pillage is in stark contrast to the rightful task he knows he must perform a task that will put an end to the dragons once and for all. Of course, even the best-laid plans can fall apart beneath the surprise of an ambush. This final book in the Pillagy series takes Beck, Kate, and Wyatt through their most dangerous adventure ever.","torrent":{"xt":"urn:btih:761bb12b91f7ee44959fcb18a8385b22c763a160","amp;dn":"Obert+Skye+-+Pillage%2C+Choke%2C+Ambush+%28Pillogy%29+epub+%26amp%3B+mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"761bb12b91f7ee44959fcb18a8385b22c763a160","infoHashBuffer":{"type":"Buffer","data":[118,27,177,43,145,247,238,68,149,159,203,24,168,56,91,34,199,99,161,96]},"announce":[],"urlList":[]}}