{"title":"Nunchucks Weapon Training - Pro Chux - Advanced Chucks Series -","uid":10162219,"size":4193664612,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:76760ff498ad552291b68280aa5aa410bd7f4bc6&amp;dn=Nunchucks+Weapon+Training+-+Pro+Chux+-+Advanced+Chucks+Series+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"scottvenzel","files":4,"time":1400314180,"description":"Lee Barden / Pro Chux / Pro Chucks Video Training\n4 VHS converted to DVD. About 1 hour each video. 4 Hours total. Quality about a 5/10 since its VHS converted to digital but training is excellent.\n\nVideo 1: Advanced Chux for the Beginner : Introduction to advanced weapons system Lissajous-Do. Learn how to pick the right Chux, how to strike and more.  \n\nVideo 2: Advanced Chux for the Intermediate: Introduction to ratio, motion, physics and logic. Turn your standard boring old moves into flowing ratios of motion.  \n\nVideo 3: Advanced Chux for the Expert: Introduction to ratio, motion, physics and logic. Turn your standard boring old moves into flowing ratios of motion.  \n\nVideo 4: Beyond Advanced Chux: Beyond any advanced level instructional video ever produced. Reverse finger rolls, double throws, wrist rolls and more.  \n\n &lt;a href=&quot;\nhttp://www.prochux.com/about-lee-barden.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.prochux.com/about-lee-barden.html&lt;/a&gt; &lt;a href=&quot;\nhttp://www.prochux.com/order-dvds.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.prochux.com/order-dvds.html&lt;/a&gt;\n\nStudio: Black and Blue Video Productions\nStarring: Lee Barden\nGenre: Martial Arts Instruction\n\n\nIntroduction to advanced weapons system Lissajous-Do. Learn how to pick the right Chux, how to strike and more.  \n\n\n========================================\nHOW TO MAKE THESE NUNCHUCKS AT HOME:\n========================================\n\nI made about 100 pairs of these chucks at home and they work great! So here are the steps if you wanted to do it. I don't think the pro chucks are anything amazing. I used some wood working tools and replicated so many pairs after taking apart my prochucks. (which yes I bought the first time) but after that they were not that hard to make if you have the time, some wood tools aval to you and the desire with some patience.\n\nTools you need: Table saw, Drill press, wood, metal clothes hangers\nRope that you can find at a boat store - paracord like but braided similar to paracord in thickness (remember has to fit in the hole)\n\nAluminum or metal tubing thats small to fit the rope through, metal crimper, lighter\n\n-----------------\nPreparing the Wood\n--------------------\n- Take a 1x1x12 inch wood at home depot (maybe it will be 3/4)\n- Popular wood is nice but it is lighter - red oak is better but slightly more expensive\n- Cut the pieces 3/4 by 3/4 by 10 inch or 12 inch (if you want longer in length) using a table saw\n\n*Always make multiple cuts and have multiple chucks because adding the holes sometimes can be tricky and inserting the rope as well. It is good to play with combinations later when inserting the rope.\n\n--------------------------------------\nGetting the octagonal shape:\n-------------------------------------\nTake a router (what they use to make cabinets and use a 45 degree angle bit to cut the 4 corners setting up a jig.\n* Note you can do this with a table saw that angles at 45 degree but a bit more dangerous and hard to get it even\n\n-----------------\nGet the hole\n---------------\nUsing a drill press thats 1/2 inch bit - drill press down 2 inches deep (youll need a little extra depth for the rope to loop around\n\n----------------------------------\nDrill hopes for the rope securing area\n----------------------------------\nMeasure off your 2 inches and go about 1.75 inches from the top of the chuck and drill a TINY hole slightly smaller than a metal clothes hanger\n- do this on both chucks - this will be your faster where you stick the pin through\n\n-----------------\nCreate rope loop\n--------------------\nThe rope in the chucks actually is a CIRCLE. Your goal is to make about a 2 foot piece. So here is how you do it... you take and cut a 2 foot piece and burn the ends with the lighter after you cut it (so its nice and smooth. The nylon will then harden. Use aluminum foil or metal something make both ends of the rope nice and hard so it doesnt split.\n\nNow that you have a nice piece of rope with both ends burned cut the metal pipe with tube cutters or the crimpers / pliers. It is small so shouldn't be hard. The tube should be about less than 1 inch.\n\nStick one end of the rope in half the inch and the other half the other end of the rope and CRIMP with the crimpers flattening out the tube. Alternate the crimping meaning crimp then rotate 50 degrees for the second crimp so you have a opposite ends that are flat.\n\nNow you should have a circular rope.\n\n----------------------\nHow the rope goes in\n-----------------------\nThe rope goes in actually folded. So when you have a circle you fold it in HALF.\nSo now you have 2 parts of the rope to latch onto on one end and 2 on the other end. You will have 4 strands total in the middle if you think about it\n\n(rope) [[___|__    &lt;---(pin)\n\n\n---------------------------\nInserting the rope in the chucks.\n---------------------------\nThis is the tricky part and can be very hard the first few times until you have a system down.\n\nHere is what i do. First cut the clothes hanger with the pliers a  piece the width of the chuck (3/4) - this you will hammer IN once you caught the rope in the right spot. So this pin goes right through that mini hole you drilled once the rope is there and you will wack it with the hammer a few times.\n\nSo to get the rope in, i made an L bracket metal piece from a clothes hanger.\n\n[___________\n\nIt is literally a flat L shape stick exactly as wide as the hole. I put the rope on the outside and PUSH the metal INTO the chuck. Then I stick a thin nail through the hole and see if the rope caught.\n\nThe problem here is always catching it because the rope gets twisted.\n\n(rope)  {{  [____(stick)____    &lt;---- stick pushes \n\nOnce you get it in just put your PIN that you cut earlier from the clothes hanger and nail it in and it will be good. \n\nThis can take 1hr the first time you do it so be patient and make MULTIPLE chucks / wood because if your holes are UNEVEN you will want to play with other hole combinations.\n\n-----------------------\nOther side and measuring\n-----------------------\nDo the same with the other side... if you measured your pin holes the right size and the rope length then when the chucks fold you should be able to move them very slightly up or down (when folded and looking at you)\n\nI would say 2 finger spaces if they are resting in the middle with the rope hanging. Not much larger. \n\n-----------------\nSanding\n---------------------\nDont forget to sand your chucks to make them smooth\nyou can add glow tape too if you want\n\n\n\n","torrent":{"xt":"urn:btih:76760ff498ad552291b68280aa5aa410bd7f4bc6","amp;dn":"Nunchucks+Weapon+Training+-+Pro+Chux+-+Advanced+Chucks+Series+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76760ff498ad552291b68280aa5aa410bd7f4bc6","infoHashBuffer":{"type":"Buffer","data":[118,118,15,244,152,173,85,34,145,182,130,128,170,90,164,16,189,127,75,198]},"announce":[],"urlList":[]}}