{"title":"Learn Electronics with Arduino {BBS}","uid":7564592,"size":20621887,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:768f3aae2894247d650dfe30adabf30b1538e203&amp;dn=Learn+Electronics+with+Arduino+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1345827702,"description":"Have you ever wondered how electronic gadgets are created? Do you have an idea for a new proof-of-concept tech device or electronic toy but have no way of testing the feasibility of the device? Have you accumulated a junk box of electronic parts and are now wondering what to build?\n\nLearn Electronics with Arduino will answer these questions to discovering cool and innovative applications for new tech products using modification, reuse, and experimentation techniques. You'll learn electronics concepts while building cool and practical devices and gadgets based on the Arduino, an inexpensive and easy-to-program microcontroller board that is changing the way people think about home-brew tech innovation. \n\nLearn Electronics with Arduino uses the discovery method. Instead of starting with terminology and abstract concepts, You'll start by building prototypes with solderless breadboards, basic components, and scavenged electronic parts. Have some old blinky toys and gadgets lying around? Put them to work! You'll discover that there is no mystery behind how to design and build your own circuits, practical devices, cool gadgets, and electronic toys. \n\nAs you're on the road to becoming an electronics guru, you'll build practical devices like a servo motor controller, and a robotic arm. You'll also learn how to make fun gadgets like a sound effects generator, a music box, and an electronic singing bird.\n\n\n# Paperback: 280 pages\n# Publisher: Apress; 1 edition (June 27, 2012)\n# Language: English\n# ISBN-10: 1430242663\n# ISBN-13: 978-1430242666","torrent":{"xt":"urn:btih:768f3aae2894247d650dfe30adabf30b1538e203","amp;dn":"Learn+Electronics+with+Arduino+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"768f3aae2894247d650dfe30adabf30b1538e203","infoHashBuffer":{"type":"Buffer","data":[118,143,58,174,40,148,36,125,101,13,254,48,173,171,243,11,21,56,226,3]},"announce":[],"urlList":[]}}