{"title":"Hidden Secrets - Part 23 -  Lght Spd - 1000K Faster 10K yrs ago ","uid":12182570,"size":8080197822,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:76d14c89315f678e0f07cf0b53af1f654cf68949&amp;dn=Hidden+Secrets+-+Part+23+-++Lght+Spd+-+1000K+Faster+10K+yrs+ago+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":69,"time":1438481340,"description":"\nWhat Is Light?\nFaster Than The Speed of Light\nIs Light Slowing Down?\nThe Speed of Light Exceeded\n\n[Ed Note: We have been following Barry Setterfield's research on the speed of light since 1993.1 It is interesting that both evolutionists and creation scientists can be blinded by their own presuppositions...]\n\nWhen we walk into a dark room, flip a switch and the lightis instantly on, it seems that light has no speed but is somehow infinite - instantly there - and that was the majority opinion of scientists and philosophers until September 1676, when Danish astronomer Olaf Roemer announced to the Paris Academie des Sciences that the anomalous behavior of the eclipse times of Jupiter's inner moon, Io, could be accounted for by a finite speed of light. 2 His work and his report split the scientific community in half, involving strong opinions and discussions for the next fifty years. It was Bradley's independent confirmation of the finite speed of light, published January 1, 1729, which finally ended the opposition.3 The speed of light was finite-incredibly fast, but finite.\n\nThe following question was: &quot;Is the speed of light constant?&quot; Interestingly enough, every time it was measured over the next few hundred years, it seemed to be a little slower than before. This could be explained away, as the first measurements were unbelievably rough compared to the technical accuracy later. It was not that simple, though. When the same person did the same test using the same equipment at a later period in time, the speed was slower. Not much, but slower.\n\nThese results kicked off a series of lively debates in the scientific community during the first half of the 20th century. Raymond Birge, highly respected chairman of the physics department at the University of California, Berkeley, had, from 1929 on, established himself as an arbiter of the values of atomic constants.4 The speed of light is considered an atomic constant. However Birge's recommended values for the speed of light decreased steadily until 1940, when an article written by him, entitled &quot;The General Physical Constants, as of August 1940 with details on the velocity of light only,&quot; appeared in Reports on Progress in Physics (Vol. 8, pp.90-100, 1941). Birge began the article saying: &quot;This paper is being written on request - and at this time on request ... a belief in any significant variability of the constants of nature is fatal to the spirit of science, as science is now understood [emphasis his].&quot; These words, from this man, for whatever reason he wrote them, shut down the debate on the speed of light. Birge had previously recognized, as had others, that if the speed of light was changing, it was quite necessary that some of the other &quot;constants&quot; were also changing. This was evidently not to be allowed, whether it was true or not, and so the values for the various constants were declared and that was that. Almost. In the October 1975 issue of Scientific American (p. 120), C.L. Strong questioned whether the speed of light might change with time &quot;as science has failed to get a consistently accurate value.&quot; It was just a ripple, but the issue had not quite disappeared.\n\nPartly in order to quell any further doubts about the constancy of the speed of light, in October 1983 the speed of light was declared a universal constant of nature, defined as 299,792.458 kilometers per second, which is often rounded off to the measurement we are more familiar with in the West as 186,000 miles per second.\n\nBirge's paper was published in 1941. Just a year later, Barry Setterfield was born in Australia. In 1979 he was 37 years old. That year he received a book from a friend, a book on astronomical anomalies. It was a large book, and near the end of it there was a section on the speed of light, questioning its constancy. Barry was stunned. Nothing he had read or learned in physics or astronomy had even hinted that there was a question regarding the speed of light. It was a constant, wasn't it? As he read, he learned about the measurements that had been taken years before, and the arguments that had gone on in the scientific literature, and he was fascinated. He figured he could read up on it and wrap up the question in about two weeks; it didn't quite work out that way","torrent":{"xt":"urn:btih:76d14c89315f678e0f07cf0b53af1f654cf68949","amp;dn":"Hidden+Secrets+-+Part+23+-++Lght+Spd+-+1000K+Faster+10K+yrs+ago+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76d14c89315f678e0f07cf0b53af1f654cf68949","infoHashBuffer":{"type":"Buffer","data":[118,209,76,137,49,95,103,142,15,7,207,11,83,175,31,101,76,246,137,73]},"announce":[],"urlList":[]}}