{"title":"An Introduction to LTE LTE LTE-Advanced-2010kaiser","uid":7745324,"size":7467665,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:777429d5f5d59fcc77c757a5ac0637f6c659a22b&amp;dn=An+Introduction+to+LTE+LTE+LTE-Advanced-2010kaiser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2010kaiser","files":-1,"time":1350747931,"description":"                        An Introduction to LTE LTE LTE-Advanced-2010kaiser\n\n\n\n\nAn Introduction to LTE explains the technology used by 3GPP Long Term Evolution. The book covers the whole of LTE, both the techniques used for radio communication between the base station and the mobile phone, and the techniques used for signalling communication and data transport in the evolved packet core. It avoids unnecessary detail, focussing instead on conveying a sound understanding of the entire system.\n\nThe book is aimed at mobile telecommunication professionals, who want to understand what LTE is and how it works. It is invaluable for engineers who are working on LTE, notably those who are transferring from other technologies such as UMTS and cdma2000, those who are experts in one part of LTE but who want to understand the system as a whole, and those who are new to mobile telecommunications altogether. It is also relevant to those working in non technical roles, such as project managers, marketing executives and intellectual property consultants. On completing the book, the reader will have a clear understanding of LTE, and will be able to tackle the more specialised books and the 3GPP specifications with confidence.\n\nKey features -\n\n    Covers the latest developments in release 10 of the 3GPP specifications, including the new capabilities of LTE-Advanced\n    Includes references to individual sections of the 3GPP specifications, to help readers understand the principles of each topic before going to the specifications for more detailed information\n    Requires no previous knowledge of mobile telecommunications, or of the mathematical techniques that LTE uses for radio transmission and reception\n\n\n\n\nPaperback: 352 pages\n \nPublisher: Wiley\n \nAuthor(s): Christopher Cox\n \nLanguage: English\n \nISBN-10: 1119970385\n \nISBN-13: 9781119970385\n\nENJOY AND SEED!!!","torrent":{"xt":"urn:btih:777429d5f5d59fcc77c757a5ac0637f6c659a22b","amp;dn":"An+Introduction+to+LTE+LTE+LTE-Advanced-2010kaiser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"777429d5f5d59fcc77c757a5ac0637f6c659a22b","infoHashBuffer":{"type":"Buffer","data":[119,116,41,213,245,213,159,204,119,199,87,165,172,6,55,246,198,89,162,43]},"announce":[],"urlList":[]}}