{"title":"Teen Wolf Season 2 Episode 2 Shape Shifted ( ITUNES )","uid":7332656,"size":460621754,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:788c2f23875f9117167102eb189631743640928a&amp;dn=Teen+Wolf+Season+2+Episode+2+Shape+Shifted+%28+ITUNES+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"jmanwf","files":1,"time":1338960802,"description":"Teen Wolf Season 2 Episode 2: Shape Shifted\n\n\n\nRipped from itunes\n\n\nadd free no annoying tv symbol onscreen\n\n\nFormat: AVI.h264\n\n\nIsaac's father is murdered the night before a full moon and Isaac is suspected. Meanwhile, Lydia returns to school, and the Argent family removes the school principal and replaces him with Gerard. Scott senses another werewolf's presence on the lacrosse team and discovers that it is in fact Isaac, who begs Scott not to tell the sheriff before being taken into custody for his father's murder. Derek takes Scott to Isaac's house to prove that Scott needs to become a member of the pack. When it is revealed that the hunters are going to kill Isaac, Scott, Stiles and Derek plan a break-out to save him, as Isaac is innocent. Derek and Stiles head to the county jail but Stiles is attacked by a hunter. Meanwhile, in preparation for the full moon, Allison locks Scott up in Isaac's basement, which his father had secretly used as a chamber of abuse against Isaac. She heads upstairs afterwards, but sees a menacing figure and screams, causing Scott to break out of the chamber to save her. However, just as he reaches her, the dark creature flees without hurting either of them, leaving both confused as to what it was.\nAt the county jail, Stiles is led to Isaac's cell by the hunter, but both realize that Isaac has already transformed and broken out. Isaac advances on Stiles after killing the hunter but Stiles is saved by Derek, who, being the Alpha, is able to force Isaac into submission, causing him to return to human form. Jackson, who had set up a video camera overnight to record his werewolf transformation, wakes up the next morning and is frustrated to learn after watching the footage that nothing happened. ","torrent":{"xt":"urn:btih:788c2f23875f9117167102eb189631743640928a","amp;dn":"Teen+Wolf+Season+2+Episode+2+Shape+Shifted+%28+ITUNES+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"788c2f23875f9117167102eb189631743640928a","infoHashBuffer":{"type":"Buffer","data":[120,140,47,35,135,95,145,23,22,113,2,235,24,150,49,116,54,64,146,138]},"announce":[],"urlList":[]}}