{"title":"Focus on Art (Art Ebook).pdf","uid":12948267,"size":55320250,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c5ad9b5df529cc475ca4b2aac379a0b95a63240&amp;dn=Focus+on+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1449701465,"description":"Rizzoli | 1982 | Pdf | Eng | ISBN 0847804046 | 279 pag | 52.7 MB\r\n\r\nThe internationally renowned German author and critic Werner Spies is arqbng today's most articulate and probing writers on the arts. This book offers a collection of his articles written between 1967 and 1981, covering a broad range of subjects and focusing on the leading figures and developments in twentieth-century art.\r\n\r\nIn these pages are penetrating interviews with Albers, Picasso, Ernst, as well as pieces on the influence of cybernetics on the art of Vasarely, the validity of the comic strip as an art form, and evaluations of movements such as Op and Pop. \r\n\r\nAmerican art and artists are the subjects of many of the essays, including a perceptive article on Andy Warhol and an article on the Rothko Chapel in Houston. \r\n\r\nLiterature is discussed: the French Encyclopedic, Baudelaire as aesthetician; a tribute to Samuel Beckett; an article on Louis Aragon; and a piece on James McPherson, the eighteenth-century Scottish poet, whose forgery of the poems supposedly by an ancient Celtic bard, Ossian, greatly influenced the romantic movement. Mr. Spies illuminates in depth his chosen topics, which are as fascinating as they are diverse: graphic art, decorative art, painting, sculpture and illustration","torrent":{"xt":"urn:btih:7c5ad9b5df529cc475ca4b2aac379a0b95a63240","amp;dn":"Focus+on+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c5ad9b5df529cc475ca4b2aac379a0b95a63240","infoHashBuffer":{"type":"Buffer","data":[124,90,217,181,223,82,156,196,117,202,75,42,172,55,154,11,149,166,50,64]},"announce":[],"urlList":[]}}