{"title":"CoolUtils Total Image Converter 1.5.0.92 Multilanguage Portable","uid":6453293,"size":18415847,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7cc5b1c13b6840b69d53838e14544ba0216be414&amp;dn=CoolUtils+Total+Image+Converter+1.5.0.92+Multilanguage+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1307509138,"description":"CoolUtils Total Image Converter 1.5.0.92 Multilanguage Portable\n\n\nTotal Image Converter allows you to take an image and create a new one with a different size or format, or perform the task for huge batches of graphic files with one click. It is invaluable for web designers and other IT professionals.\n\nTotal Image Converter helps you to convert image sizes and formats. A must-have utility for all web designers. ImageConverter is unique - it supports almost all popular formats (JPG, GIF, BMP, PBM, PGM, PCX, PNG, PPM, TGA, TIF, WMF, EMF). All you have to do is to set the required size or format and Total Image Converter automatically does the rest.\n\nWith Total Image Converter, you can also resize, rotate or perform mirror images and change color resolutions. If you have lists of images to be converted, use our batch processing. You'll get hundreds of images converted or resized with one click! ImageConverter is the best solution for converting images at a most reasonable price.\n\nHere are some key features of &quot;Total Image Converter&quot;:\nÃ‚Â· All image formats\nÃ‚Â· Total Image Converter supports almost all image formats (see the list -&gt;). It's all-in-one solution for those who do not want to waste time and effort searching for 10 different converters to deal with different formats.\nÃ‚Â· Batch conversion\nÃ‚Â· If you have hundreds of images to be converted, you can use its batch file convert option. Just check the files that you want to process or just press Select All button to save your time. Get any amount of image files converted or resized in one click!\nÃ‚Â· 3 ways of handling\nÃ‚Â· First, there is well-thought user interface. Second, Total Image Converter seamlessly integrates into Windows. That means that you may select the file in your desktop and make right-button mouse click. You will see ConvertTo item in the standart Windows popup menu. And there is also Command line support. Run Total Image Converter from the command line within other programs.\nÃ‚Â· Built-in viewer and thumbnails\nÃ‚Â· Total Image Converter has built-in viewer. You may easily view your images inside the program before or after the conversion. You can either work with detailed list of files (name, size, type, modify, attributes) or with their thumbnails.\nÃ‚Â· Resize, rotate, crop, mirror\nÃ‚Â· With Total Image Converter you can also resize, crop, rotate or mirror images and change the color resolution (include convert to black and white color) of your graphics. Besides, you may adjust White Balance and make gamma correction. Adjust or set Brightness, Contrast or Saturation, apply shadow or use some filter. All this done when converting your image with Total Image Converter!\nÃ‚Â· Watermarking\nÃ‚Â· Total Image Converter lets you apply watermarks to your images! You may add your comment, logo or date to a single photo or a bunch of them.\nÃ‚Â· No special knowledge required\nÃ‚Â· Even if you never dealt with image converters before you will master the program in seconds. The program will itself ask you all the questions about the conversion settings and in case you are at a loss it will advise you the best setting for each conversion. Click here to make a quick tour on the program and see how simple it is to use it.\nÃ‚Â· High quality\n\nHome Page - http://www.coolutils.com/\n","torrent":{"xt":"urn:btih:7cc5b1c13b6840b69d53838e14544ba0216be414","amp;dn":"CoolUtils+Total+Image+Converter+1.5.0.92+Multilanguage+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cc5b1c13b6840b69d53838e14544ba0216be414","infoHashBuffer":{"type":"Buffer","data":[124,197,177,193,59,104,64,182,157,83,131,142,20,84,75,160,33,107,228,20]},"announce":[],"urlList":[]}}