{"title":"Pantera: 3Vulgar Videos From Hell (2Disc)NTSC","uid":5548333,"size":9983500335,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7d0dfa55be0517615de224ffcc66436b6370f2cf&amp;dn=Pantera%3A+3Vulgar+Videos+From+Hell+%282Disc%29NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"FantomLord","files":-1,"time":1273452261,"description":"\n\nPantera: 3 Vulgar Videos From Hell (2Disc)Full NTSC\n\n720 x 480\nNTSC\n\n* Disc 1:\n* Cowboy From Hell Videos\n* Vulgar Video\n\n* Disc 2:\n* 3 Watch It Go\n* Bonus Footage: Pantera Live From Monsters of Rock in Moscow\n\n\nOriginally released on DVD in 1999, this new version features the same content-all of Pantera's VHS home video releases, plus Pantera Live From Monsters Of Rock In Moscow-with improved menus and all-new Dolby Digital 5.1 Surround Sound. Features videos, live performances, and the band's personal footage filmed on the road.\n\nDallas-based Pantera unleashed a scorched-earth roar with their monster 1990 major-label debut, Cowboys From Hell. Its follow-up, 1992's pulverizing Vulgar Display Of Power, is an all-time metal masterpiece, and 1994's Far Beyond Driven is widely considered the heaviest album ever to enter the Billboard Top 200 at #1. In a genre often steered by trends, the unassailable Pantera are revered for their uncompromising allegiance to the &quot;power groove,&quot; as they call it. They paved the way, but are others brave enough to follow?\n\nThis is THE DVD for the heavy metal fan. It makes sense that the best metal band ever would put out the craziest home video every. It captures the band in their wildly energetic live performances, reveals their hilarious and sometimes violent backstage behavior, and has several kick ass music videos. It's quite vulgar as anyone who knows Pantera would expect. Be ready for lots of drinking, trashing, moshing, smoking and some nudity. All part of rock n roll right? To anyone who might not know Pantera, this will show why they moved more masses than any metal before, or since. I've seen the 3rd video Watch It Go at least 200 times and it never gets old. A good DVD that covers most of Pantera's all too short career. A must for any hard music fan.\n\n\n\nTRACK LIST\nCOWBOYS FROM HELL\nPSYCHO HOLIDAY\nCEMETARY GATES\nHERESY (Live)\nART OF SHREDDING\nMOUTH FOR WAR\nTHIS LOVE\nWALK\nDOMINATION (Live)\nPRIMAL CONCRETE SLEDGE\nPLANET CARAVAN\nI'M BROKEN\n5 MINUTES ALONE\nDRAG THE WATERS\nCOWBOYS FROM HELL (Moscow)\nPRIMAL CONCRETE SLEDGE (Moscow)\nPSYCHO HOLIDAY (Moscow)\n\nThanks to FilthyMidian\n\n\n\n","torrent":{"xt":"urn:btih:7d0dfa55be0517615de224ffcc66436b6370f2cf","amp;dn":"Pantera%3A+3Vulgar+Videos+From+Hell+%282Disc%29NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d0dfa55be0517615de224ffcc66436b6370f2cf","infoHashBuffer":{"type":"Buffer","data":[125,13,250,85,190,5,23,97,93,226,36,255,204,102,67,107,99,112,242,207]},"announce":[],"urlList":[]}}