{"title":"BBC One Penguins Spy In The Huddle [2013]480p.HDTV.H264","uid":8196653,"size":2220559853,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7d17ba41d5785ec4769a4391b204ea53906bcc4f&amp;dn=BBC+One+Penguins+Spy+In+The+Huddle+%5B2013%5D480p.HDTV.H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":6,"time":1361927373,"description":"Release Title: BBC.One.Penguins.Spy.In.The.Huddle.[2013]480p.HDTV.H264(BINGOWINGZ-UKB-RG)\nTV Air Date: Feb 2013\nGenre: Documentary\nRunTime: 60 Minutes x3\n\nPenguins - Spy in the Huddle spends nearly a year\nin the close company of penguins, deploying 50\nspycams to capture as never before the true\ncharacter of these birds.\nEp1 The Journey\nPenguins as they have never been seen before. From the\nfreezing Antarctic to the scorching tropics, 50 spy\ncameras capture unique footage of three extraordinary\nspecies.\nEmperor penguins cross a treacherous frozen sea to reach\ntheir breeding grounds, and on the way one becomes lost\nin a blizzard. Once there, the females flipper flight\nover the males and those that succeed 'waddle walk' with\ntheir partners. They must lay their eggs without touching\nthe ice, but it is the males that face the greatest\nchallenge - overwintering alone in the coldest place\non earth.\nRockhoppers brave the world's stormiest seas, only to come\nashore and face a daunting assault up a 300-foot cliff,\nhopping most of the way up. Having laid their eggs, these\nplucky birds face airborne attacks from skuas and vultures.\nHumboldts are a strange tropical penguin that has rarely\nbeen filmed. To reach their desert nests they negotiate\n20,000 predatory sea lions, dodge vampire bats and battle\nhalf a million sharp-beaked seabirds.\nThe hard work for all the penguins finally pays off when\ntheir tiny, vulnerable chicks begin to hatch.\nAmong the spy cameras capturing unique behaviour is a\ntechnological first - robotic penguins with cameras for eyes.\n\n\n\n\n\nEp2 First Steps\nWatched by spycams, chicks are hatching out all over.\nMale emperors form an identity parade before handing\nover their newborns to the returning females.\nThe mothers shuffle into a huddle to protect their\noffspring from a blizzard. Outside, one tiny chick\ndoesn't make it and lies frozen by his mother. Chickcam\nfilms the young ones walking on their mothers' feet and\ntaking their own first unsteady steps. Females without\nyoung try to kidnap the new arrivals and giant petrels\nforce the chicks to huddle for protection.\nOn the Falklands, rockhopper chicks meet some unruly\nneighbours - king cormorants. Predatory vultures are\nseen off by a penguin army. Caracara birds grab an\neggcam and film the aerial shots of the colony! Parents\ntake a rock shower and even 'chimney climb' to their\nown private spa. The chicks face more predators and\nbereaved parents plan a chicknap.\nIn Peru, Humboldt chicks emerge into the desert. The\nadults leave their burrow plastered in mud and needing\na bath. They're joined in the waves by Humboltcam and\nboisterous fur seals. Home alone, the chicks shoot\ngulls with projectile poo and the colony faces a huge\ncormorant invasion.\nThe chicks are learning to become adult penguins.\n\nEp3 Growing Up\nThe chicks are growing up fast and becoming increasingly\nindependent. Emperor and rockhopper chicks are placed in\na creche as their parents go fishing. The Humboldts are\nleft in their burrows, as the adults enjoy a soft landing\nof feathers by a beach swarming with cormorants.\nPacked in a huddle, the emperor chicks have to be identity\nchecked before they are fed, and their parents are swamped\nby hungry impostors. Giant petrels are an ever-present\ndanger, while vampire bats target the Humboldts. As the\nyoung grow bigger and preen out baby fluff they sport punk\nhairdos. The emperor chicks go skating on a newly-formed\nice rink, while the rockhopper chicks practice jumping skills.\nEventually all the chicks leave for the sea, tackling the same\nhazards as their parents before them, from sea lions to predatory\nbirds, high cliffs to glaciers. All face huge challenges. There\nare plenty of surprises along the way, but soon the chicks\ndiscover their true home - the sea.\nFrom egg to adolescent, spycams have been with the young penguins\nthrough their tough early months. They are with them as they leave.\nIt will be years before they follow in their parents' footsteps\nand return to breed.\n\n\nORiGiNAL SOURCE: BBC1/HD\nVideo: MP4/852*480/25fps\nAudio: AAC/2ch/128Kbps\nFile Size: 700MB x3\nSample Included: Yes\n &lt;a href=&quot;\nhttp://img43.imageshack.us/img43/184/69955995.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img43.imageshack.us/img43/184/69955995.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img836.imageshack.us/img836/1523/63548097.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img836.imageshack.us/img836/1523/63548097.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img839.imageshack.us/img839/5616/penguin3.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img839.imageshack.us/img839/5616/penguin3.png&lt;/a&gt;","torrent":{"xt":"urn:btih:7d17ba41d5785ec4769a4391b204ea53906bcc4f","amp;dn":"BBC+One+Penguins+Spy+In+The+Huddle+%5B2013%5D480p.HDTV.H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d17ba41d5785ec4769a4391b204ea53906bcc4f","infoHashBuffer":{"type":"Buffer","data":[125,23,186,65,213,120,94,196,118,154,67,145,178,4,234,83,144,107,204,79]},"announce":[],"urlList":[]}}