{"title":"EnigmaT Set Rips { Cuts } - December 28th, 2013","uid":9408557,"size":555250094,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7fa050a5cf4a80b57e4cfe8e70afc7d54ca713bf&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+28th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":61,"time":1388221244,"description":"Ad Brown - L.A. (Zack Roth Remix) (Cut From Saint-Jules Set)-enTc.mp3\nAd Brown with Sean Mitiska - Pulse (Fon.Leman Remix) (Cut From Moor Set)-enTc.mp3\nAdam Shornys &amp; Cam Heathmam - Keji (Sou Kanai Remix) (Cut From MORPH Set)-enTc.mp3\nAllan Morrow feat. Sophie Way - Why We Do This (Dub Mix) (Cut From Saux Set)-enTc.mp3\nAndrew MacTire - Insurrection (Original Mix) (Cut From DJ Leon Set)-enTc.mp3\nAndrew Rayel &amp; Alexandre Bergheau - We Are Not Afraid Of 138 (Aleksander Lasocki Remix) (Set Rip)-enTc.mp3\nAndroid - City On Water (tranzLift Remix) (Set Rip)-enTc.mp3\nAngry Man - Lunatic (Before Sunrise Mix) (Set Rip)-enTc.mp3\nAnton Neumark - Break Free (A-Mase Breaks Mix) (Cut From Fonarev Set)-enTc.mp3\nApplescal - Onetasker (Cut From G&amp;D Set)-enTc.mp3\nBluEye - Origami (Max Braiman &amp; Victoria Shersick Remix) (Cut From Romel Set)-enTc.mp3\nCBM &amp; Johnny Zana - Exakto (Cut From Bjorn Set)-enTc.mp3\nDaniel Skyver - Boiling Point (Cut From Saux Set)-enTc.mp3\nDarren Morfitt - Imaginarium (Original Mix) (Cut From MORPH Set)-enTc.mp3\nDenton &amp; McGregor - Crossing Borders (Original Mix) (Cut From Suzy Set)-enTc.mp3\nDJ Feel &amp; Alex M.O.R.P.H. - Trancemission Anthem (-OvErSpAmMeD- Cut From Feel Set)-enTc.mp3\nDriftmoon &amp; Andy Blueman feat. DSharp - Exodus (In &amp; Out Mix) (Cut From DJ Leon Set)-enTc.mp3\nEstiva &amp; Justin Oh feat. Abby Rae - Reach For The Sky (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nFatboy Slim vs P.E.M. - Another Eat Sleep Rave Repeat (Organ Donors Remix) (Mark Sherry's Dreamland Intro Raveup) (Set Rip)-enTc.mp3\nFerry Corsten - Diss (Boyan &amp; Boyer Remix) (Cut From Ferry Set)-enTc.mp3\nFonarev pres. F13 - Tatooine (A-Mase Breaks Remix) (Cut From Fonarev Set)-enTc.mp3\nFractal Geometry - Sun Garden (Digital Prychosis Remix) (Cut From Romel Set)-enTc.mp3\nGreg Downey - Vivid Intent (Jordan Suckley's 'Acid' Mix) (Cut From Suckley Set)-enTc.mp3\nHoyaa - Metropolis (TrancEye Remix) (Set Rip)-enTc.mp3\nJordan Suckley &amp; Eddie Bitar - Centipede (Cut From Suckley Set)-enTc.mp3\nJordan Suckley - Take No Prisoners (Cut From Dinaire Set)-enTc.mp3\nJuventa - Woolloomooloo (Original Mix) (Set Rip)-enTc.mp3\nKheiro &amp; Medi - Reanimation (Original Mix) (Cut From Romel Set)-enTc.mp3\nM.D.K vs Christian Chatelle - Buenos Aires (Original Mix) (Cut From Feel Set)-enTc.mp3\nManuel Le Saux - One (Pinkque Remix) (Cut From Saux Set)-enTc.mp3\nMariano Ballejos - Another Moon (David Farquharson Remix) (Cut From Bjorn Set)-enTc.mp3\nMartin Solveig &amp; The Cataracs feat. Kyle - Hey Now (Pierce Fulton Remix) (Cut From Oakenfold Set)-enTc.mp3\nMatt Bukovski vs ATB - Tesla Ecstasy (Matt Bukovski Mashup) (Cut From Romel Set)-enTc.mp3\nMel B - For Once In My Life (Paul Oakenfold Club Remix) (Cut From Oakenfold Set)-enTc.mp3\nMichael Retouch - Atlant (Original Mix) (-OvErSpAmMeD- Cut From Feel Set)-enTc.mp3\nMixail - A New Age (Original Mix) (Cut From Saint-Jules Set)-enTc.mp3\nMosphet - Hope (Cut From Uplift Set)-enTc.mp3\nNhato feat. IA - Offshore (Cut From Bjorn Set)-enTc.mp3\nObsidian Radio feat. Jan Johnston - Love Like This (Thomas Datt Remix) (Set Rip)-enTc.mp3\nObsidian Radio Featuring Jan Johnston - Love Like This (Touchstone Remix) (Cut From Dinaire Set)-enTc.mp3\nOliver Cattley - Crystals (Cut From Cattley Set)-enTc.mp3\nOliver Cattley - Identity Crisis (Cut From Cattley Set)-enTc.mp3\nOliver Cattley - Nucleophile (Cut From Cattley Set)-enTc.mp3\nOliver Cattley - Old Skool Optical (Cut From Cattley Set)-enTc.mp3\nOliver Cattley - Termination Stage (Cut From Cattley Set)-enTc.mp3\nOliver Cattley - Titration (Cut From Cattley Set)-enTc.mp3\nPaul Todd - XONE (Astuni Remix) (Cut From Saux Set)-enTc.mp3\nPerpetuous Dreamer - The Sound of Goodbye (Art Inc. Bootleg) (Cut From Saint-Jules Set)-enTc.mp3\nPreon - Zentrum (Cut From Xabi Set)-enTc.mp3\nShaun Williams - Screenshot (Daniel Skyver Remix) (Cut From Envy Set)-enTc.mp3\nSteve Dekay - Magnetar (Original Mix) (Cut From Shiver Set)-enTc.mp3\nSunset &amp; Myk Bee - After The Sunrise (Rene Dale Remix) (Cut From Palagano Set)-enTc.mp3\nTangle - Aquarius (Cut From Tangle Set)-enTc.mp3\nTangle - The Night (Original Mix) (Cut From Tangle Set)-enTc.mp3\nThomas Datt &amp; Magnus - Binary Complex (Set Rip)-enTc.mp3\ntranzLift - ID  -December 2013-  (Original Mix) (Set Rip)-enTc.mp3\nTwo&amp;One with Team Bastian feat. Sir Adrian - Lonely People (Set Rip)-enTc.mp3\nUDM - Life Line (Cut From Saux Set)-enTc.mp3\nZack Roth - Wils Lives (Shingo Nakamura Remix) (Cut From Moor Set)-enTc.mp3\nZak Moya - Cobra (Original Mix) (Cut From Oakenfold Set)-enTc.mp3\nZaxx feat. Dustin Allen - Worlds Collide (Chris Schweizer Remix) (Cut From Halcon Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:7fa050a5cf4a80b57e4cfe8e70afc7d54ca713bf","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+28th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fa050a5cf4a80b57e4cfe8e70afc7d54ca713bf","infoHashBuffer":{"type":"Buffer","data":[127,160,80,165,207,74,128,181,126,76,254,142,112,175,199,213,76,167,19,191]},"announce":[],"urlList":[]}}