{"title":"Letters of Ada Lovelace BBC Radio4 Dramatisation AAC m4a [MPup]","uid":12482855,"size":54489357,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7ff4f07624ec8b354b5790f7f48abd6ab4ee64f2&amp;dn=Letters+of+Ada+Lovelace+BBC+Radio4+Dramatisation+AAC+m4a+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1443075969,"description":"The.Letters.of.Ada.Lovelace.BBC.Radio.4.Dramatisation.Complete.Series.BBCRip.AAC.M4A.[MPup]\r\n\r\nAudioCodec: AAC audio file\r\nChannels: 2 channels / Stereo\r\nSamplingRate: 48.0 KHz\r\nData Rate: 128.00 kbit/s\r\n\r\nGeorgina Ferry presents the correspondence of Ada Lovelace, dramatised by an all-star cast; and reveals the intense inner world of a young Victorian lady who anticipated our digital age.\r\n\r\n[img]http://extraimago.com/images/2015/09/24/1c6f05fbe41aa0203994ae09cd56cecc.png[/img]\r\n\r\n\r\nThe.Letters.of.Ada.Lovelace.s01e01.The.Poetry.of.Mathematics.[MPup]\r\n\r\n[b]1 of 2[/b]\r\n\r\nRunning Time: 28 minutes\r\n\r\nDramatisation of the correspondence of computing pioneer Ada Lovelace\r\n\r\nAda Lovelace (Sally Hawkins) was the abandoned daughter of the romantic poet Lord Byron. Concerned that Ada might inherit her father's feckless and 'dangerous' poetic tendencies, her single mother Lady Byron (Olivia Williams) made sure she was tutored thoroughly in mathematics, and regularly prescribed 'more maths' to improve her mental health. When she came out in London society, Ada met the man who would change her life, but not in the way most debutantes would have imagined. The distinguished mathematician, Charles Babbage (Anthony Head) became her life-long friend and mentor: Ada was fascinated by his steam-powered calculating machines. Supported by her husband William (George Watkins), she defied society's expectations, studying mathematics with extraordinary passion and determination when she was married with three small children; and later suggesting boldly to Babbage that he might like to work with her on his innovative thinking machines.\r\n\r\n\r\nThe.Letters.of.Ada.Lovelace.s01e02.Thinking.Machines.[MPup]\r\n\r\n[b]2 of 2[/b]\r\n\r\nRunning Time: 27 minutes\r\n\r\nDramatisation of the correspondence of computing pioneer Ada Lovelace\r\n\r\nIn part two of this dramatization of The Letters of Ada Lovelace, Georgina Ferry reveals the nature of the relationship between the young heiress, Ada Lovelace (Sally Hawkins) and the crusty mathematician, Charles Babbage (Anthony Head), inventor of steam-powered calculating machines.\r\n\r\nDespite, (or perhaps because of), constant battles with her mental and physical health, Ada pursued her interest in Babbage's innovative engines, with zeal. She threw herself into the task of describing his Analytical Engine and writing the Notes of the engine for which she is now famous. In an extraordinary leap of imagination, she suggested that this steam-powered engine could be used for much more than just adding and subtracting - 'for music and art perhaps'. And grasped just how many problems - and not only mathematical ones - might one day be solved by rigorous, logical analysis.\r\n\r\nAll her life Ada struggled to escape her controlling mother, Lady Byron (Olivia Williams) and the legacy of her notorious and absent father, the romantic poet Lord Byron. Babbage gave her the attention and intellectual respect that neither of her parents offered. She defied convention and produced a work of astonishing prescience, predicting how steam-powered calculating machines might one day change the world. She was a flawed and fragile individual: a Victorian tech visionary","torrent":{"xt":"urn:btih:7ff4f07624ec8b354b5790f7f48abd6ab4ee64f2","amp;dn":"Letters+of+Ada+Lovelace+BBC+Radio4+Dramatisation+AAC+m4a+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ff4f07624ec8b354b5790f7f48abd6ab4ee64f2","infoHashBuffer":{"type":"Buffer","data":[127,244,240,118,36,236,139,53,75,87,144,247,244,138,189,106,180,238,100,242]},"announce":[],"urlList":[]}}