{"title":"853 cover songs by various artists","uid":4767280,"size":3080200193,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8003864e9c02e2e49808e3cdf03029d0f7d06951&amp;dn=853+cover+songs+by+various+artists&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"cknox08","files":853,"time":1236916086,"description":"This torrent includes the following cover albums:\n\nBen Lee's &quot;New Wave&quot; (all covers of Against Me! songs)\nColin Meloy's &quot;Sings Morrissey,&quot; &quot;Sings Sam Cooke,&quot; and &quot;Sings Shirley Collins&quot; EPs\nDoveman's &quot;Footloose&quot;\nThe Easy Star All-Stars' &quot;Radiodread (all Radiohead covers)\nEric Reed's &quot;Pure Imagination&quot;\nGhoti Hook's &quot;Songs We Didn't Write&quot;\n&quot;I'm Not There&quot; soundtrack (all Bob Dylan covers)\n&quot;Life Beyond Mars&quot; (all David Bowie covers)\nMark Ronson's &quot;Version&quot;\nMe First and the Gimme Gimmes' &quot;Are a Drag,&quot; &quot;Blow in the Wind,&quot; &quot;Have a Ball,&quot; &quot;Love Their Country,&quot; and &quot;Ruin Jonny's Bar Mitzvah&quot;\nMxpx's &quot;On The Cover&quot;\nNew Found Glory's &quot;From the Screen to Your Stereo&quot; and &quot;From the Screen to Your Stereo II&quot;\nNouvelle Vague's &quot;Nouvelle Vague&quot; and &quot;Band a Part&quot;\nPatti Smith's &quot;Twelve&quot;\n&quot;Paupers, Peasants, Princes &amp; Kings&quot; (all Bob Dylan covers)\nPunk Goes Pop\nPunk Goes Metal\nPunk Goes 80s\nPunk Goes 90s\nPunk Goes Crunk\nsomethingawful.com's &quot;NES Covers&quot; album\n&quot;Start Right Here&quot; (all Keith Green covers)\n&quot;Veggie Rocks!&quot; (all Veggie Tales covers)\n\n\n...plus the following tracks:\n\n311 - Love Song (The Cure cover)\nA*Teens - Mamma Mia (ABBA cover)\nA*Teens - Gimme! Gimme! Gimme! (A Man After Midnight) (ABBA cover)\nA*Teens - Super Trouper (ABBA cover)\nA*Teens - S.O.S. (ABBA cover)\nA*Teens - Dancing Queen (ABBA cover)\nAce Troubleshooter - Your Love Broke Through (Keith Green cover)\nAerosmith - Come Together (The Beatles cover)\nAerosmith - Helter Skelter (The Beatles cover)\nAffinity - My Name is Jonas (Weezer cover)\nAlanis Morissette - King of Pain (The Police cover)\nAlbanopower - Love Will Tear Us Apart (Joy Division cover)\nAll Saints - Under the Bridge (Red Hot Chili Peppers cover)\nAllister - Fraggle Rock (theme song cover)\nAnberlin - Love Song (The Cure cover)\nAnnie Lennox - Take Me To The River (Talking Heads cover)\nArcade Fire - This Must Be The Place (Talking Heads cover)\nThe Ataris - Boys of Summer (Don Henley cover)\nThe Ataris - Butterfly (Weezer cover)\nAudio Adrenaline - Free Ride (Pete Townshend cover)\nAudio Adrenaline - Let My Love Open The Door (Pete Townshend cover)\nAudrye Sessions - Waltz #2 (XO) (Elliott Smith cover)\nAva Quigley - Don't Think Twice, It's Alright (Bob Dylan cover)\nBand of Horses - The End's Not Near (The New Year cover)\nBauhaus - Ziggy Stardust (David Bowie cover)\nBeach House - Play the Game (Queen cover)\nBeck - Leopard-Skin Pill Box Hat (Bob Dylan cover)\nBelle and Sebastian - Billie Jean (Michael Jackson cover)\nBelle and Sebastian - Final Day (Young Marble Giants cover)\nBelle and Sebastian - San Francisco (Scott McKenzie cover)\nBelle and Sebastian - Turn! Turn! Turn! (The Byrds cover)\nBen Folds - Bitches Ain't Shit (Dr. Dre cover)\nBen Folds - Get Your Hands Off of My Woman (The Darkness cover)\nBen Folds - Golden Slumbers (The Beatles cover)\nBen Folds - In Between Days (The Cure cover)\nBen Folds - Such Great Heights (The Postal Service cover)\nBen Folds - Tiny Dancer (Elton John cover)\nBen Folds Five - All Shook Up (Elvis Presley cover)\nBen Folds Five - Champagne Supernova (Oasis cover)\nBen Folds Five - Raindrops Keep Falling On My Head (Burt Bacharach cover)\nBen Folds Five - She Don't Use Jelly (The Flaming Lips cover)\nBen Folds Five - Video Killed the Radio Star (The Buggles cover)\nBen Gibbard - Joga (Bjork cover)\nBjork - Top of the World (The Carpenters cover)\nBleach - Asleep in the Light (Keith Green cover)\nThe Blood Brothers - Under Pressure (David Bowie &amp; Queen cover)\nThe Blues Band - Maggie's Farm (Bob Dylan cover)\nBon Jovi - The Boys are Back in Town (Thin Lizzy cover)\nThe Books (feat. Jose Gonzalez) - Cello Song (Nick Drake cover)\nThe Braids - Bohemian Rhapsody (Queen cover)\nBrand New - Car (Built to Spill cover)\nBrave Saint Saturn - Rocketown (Michael W. Smith cover)\nBruce Dickinson - All The Young Dudes (David Bowie cover)\nBuena Vista Social Club - High and Dry (Radiohead cover)\nCalibretto 13 - The Ballroom Blitz (Sweet cover)\nThe Cardigans - Iron Man (Black Sabbath cover)\nCat Power - Fortunate Son (CCR cover)\nThe Chapin Sisters - Toxic (Britney Spears cover)\nChris Isaak - Solitary Man (Neil Diamond cover)\nChristopher John - The World Has Turned and Left Me Here (Weezer cover)\nThe Clash - I Fought The Law (The Crickets cover)\nCold War Kids - Electioneering (Radiohead cover)\nColour Revolt - These Few Presidents (Why? cover)\nThe Corrs - Everybody Hurts (R.E.M. cover)\nThe Cure - Hello, I Love You (The Doors cover)\nThe Cure - Purple Haze (Jimi Hendrix cover)\nThe Cure - Young Americans (David Bowie cover)\nDamien Rice - Creep (Radiohead cover)\nDan Hill - Sometimes When We Touch (Rod Stewart cover)\nDanny &amp; Dusty - Knockin' on Heaven's Door (Bob Dylan cover)\nDarling - Suffragette City (David Bowie cover)\nDashboard Confessional - Jamie (Weezer cover)\nDave Sitek - With a Girl Like You (The Troggs cover)\nDavid Bazan - Hallelujah (Leonard Cohen cover)\nDavid Bazan - Waiting for Superman (The Flaming Lips cover)\nDavid Bazan's Black Cloud - Let Down (Radiohead cover)\nDavid Gray - Smile LIke You Mean It (The Killers cover)\ndc Talk - I Wish We'd All Been Ready (Larry Norman cover)\nDeath Cab for Cutie - All is Full of Love (Bjork cover)\nDeath Cab for Cutie - Rocking Chair (The Band cover)\nDef Leppard - Rebel Rebel (David Bowie cover)\nThe Dingees - Dear John Letter (To The Devil) (Keith Green cover)\nDirty Projectors - Hyperballad (Bjork cover)\nDirty Projectors - Rise Above (Black Flag cover)\nThe Dollyrots - Brand New Key (Melanie cover)\nDr. Evil - Just The Two of Us (Will Smith cover)\nThe Dropkick Murphys - The Kids Are Alright (The Who Cover)\nDuffy - Live and Let Die (Paul McCartney cover)\nDwight Yoakam - I Want You To Want Me (Cheap Trick cover)\nDwight Yoakam - Suspicious Minds (Elvis Presley cover)\nEddie Vedder - I Believe in Miracles (The Ramones cover)\nEditors - Feel Good, Inc. (Gorillaz cover)\nEllen Page and Michael Cera - Anyone Else But You (The Moldy Peaches cover)\nEverclear - The Boys are Back in Town (Thin Lizzy cover)\nFace to Face - Whip It (Devo cover)\nFaith No More - War Pigs (Black Sabbath cover)\nFall Out Boy - Love Will Tear Us Apart (Joy Division cover)\nFall Silent - Sesame Street (TV theme cover)\nFanmail - I Want it That Way (Backstreet Boys cover)\nFatboy Slim - The Joker (Steve Miller Band cover)\nFear Factory (feat. Danzig) - Enter Sandman (Metallica cover)\nFeist (feat. Ben Gibbard) - Train Song (Vashti Bunyan cover)\nFinal Fantasy - No Cars Go (Arcade Fire cover)\nFive Iron Frenzy - Everywhere I Go (Amy Grant cover)\nFive Iron Frenzy - Hello There (Cheap Trick cover)\nThe Flaming Lips - (Just Like) Starting Over (John Lennon cover)\nThe Flaming Lips - Bohemian Rhapsody (Queen cover)\nThe Flaming Lips - Knives Out (Radiohead cover)\nThe Flaming Lips - Seven Nation Army (The White Stripes cover)\nThe Flaming Lips - War Pigs (Black Sabbath cover)\nFlash Hawk Parlor Ensemble - The Tourist (Radiohead cover)\nFlatliners - Rebel Yell (Billy Idol cover)\nFlight 180 - The Devil is Bad (The W's cover)\nFlight 180 - Vacation (The Go-Gos cover)\nFlyweight - Girls (Beastie Boys cover)\nFoo Fighters - Danny Says (The Ramones cover)\nFoo Fighters - Darling Nikki (Prince cover)\nFoo Fighters - Drive Me Wild (Vanity 6 cover)\nFoo Fighters - Gas Chamber (Angry Samoans cover)\nFoo Fighters - Have a Cigar (Pink Floyd cover)\nFoo Fighters - Keep the Car Running (Arcade Fire cover)\nFoo Fighters - Ozone (Ace Frehly cover)\nFoo Fighters - Born On The Bayou (CCR cover)\nFoo Fighters - I'm In Love With a German Filmstar (The Passions cover)\nFoo Fighters - Kiss the Bottle (Jawbreaker cover)\nFoo Fighters - Never Talking to You Again (Husker Du cover)\nFoo Fighters - Life of Illusion (Joe Walsh cover)\nFoo Fighters - Sister Europe (Psychedelic Furs cover)\nFoo Fighters - Iron and Stone (Obsessed cover)\nFoo Fighters - Baker Street (Gerry Rafferty cover)\nFoo Fighters - Requiem (The Killing Joke cover)\nFoo Fighters - I Feel Free (Cream cover)\nForbidden Doughnut - Yub-Nub (Star Wars song cover)\nThe Format - Do You Believe in Magic? (The Lovin' Spoonful cover)\nThe Format - For You (Bruce Springsteen cover)\nThe Format - Apeman (The Kinks cover)\nThe Format - 1000 Umbrellas (XTC cover)\nThe Format - Glutton of Sympathy (Jellyfish cover)\nThe Format - The Lottery Song (Harry Nilsson cover)\nFranz Ferdinand - Call Me (Blondie cover)\nFurther Seems Forever - Say it Ain't So (Weezer cover)\nFurther Seems Forever - Bye Bye Bye (N*Sync cover)\nFurtherMore - Fall on Me (R.E.M. cover)\nThe Futureheads - Let's Dance (David Bowie cover)\nGarbage - I Just Wanna Have Something to Do (The Ramones cover)\nThe Get Up Kids - Suffragette City (David Bowie cover)\nThe Get Up Kids - On WIth The Show (Motley Crue cover\nThe Get Up Kids - Alec Eiffel (Pixies cover)\nThe Get Up Kids - Beer For Breakfast (The Replacements cover)\nThe Get Up Kids - Regret (New Order cover)\nThe Get Up Kids - Close To Me (The Cure cover)\nGob - Paint it Black (The Rolling Stones cover)\nGoldfinger - 99 Red Balloons (Nena cover)\nGoldfinger - Just Like Heaven (The Cure cover)\nGoldfinger - Man in the Suitcase (The Police cover)\nGoldfinger - You Say You Don't Love Me (Buzzcocks cover)\nGoldfinger - Feel Like Making Love (Bad Company cover)\nGoldfinger - Is She Really Going Out With Him? (Joe Jackson cover)\nThe Gourds - Gin &amp; Juice (Snoop Dogg cover)\nGreen Day - I Fought The Law (The Crickets cover)\nGuns 'N Roses - Live and Let Die (Paul McCartney cover)\nGuns 'N Roses - Sympathy for the Devil (The Rolling Stones cover)\nGus - (Don't Fear) The Reaper (Blue Oyster Cult cover)\nH.I.M. - (Don't Fear) The Reaper (Blue Oyster Cult cover)\nH.I.M. - Solitary Man (Neil Diamond cover)\nHot Chip - Transmission (Joy Division cover)\nThe Hold Steady - Atlantic City (Bruce Springsteen cover)\nIke &amp; Tina Turner - Come Together (The Beatles cover)\nIncubus - Turning Japanese (The Vapors cover)\nIndigo Girls - Clampdown (The Clash cover)\nInternal Roster Error - Land Down Under (Men at Work cover)\nInternal Roster Error - God Must Have Spent a Little More Time On You (N*Sync cover)\nIron &amp; Wine - Such Great Heights (The Postal Service cover)\nIsaac Hayes - Lay Lady Lay (Bob Dylan cover)\nJack Johnson - Badfish/Boss DJ (Sublime cover)\nJack Johnson - Rocky Raccoon (The Beatles cover)\nJason &amp; The Scorchers - Take Me Home, Country Roads (John Denver cover)\nJeff Buckley - Hallelujah (Leonard Cohen cover)\nThe Jimi Hendrix Experience - All Along the Watchtower (Bob Dylan cover)\nJoe Cocker - With a Little Help From My Friends (The Beatles cover)\nJoe Strummer and the Mescaleros - Redemption Song (Bob Marley cover)\nJoey Ramone - 1969 (Iggy Pop cover)\nJoey Ramone - What a Wonderful World (Louis Armstrong cover)\nJohn Mayer - Kid A (Radiohead cover)\nJohn Vanderslice - Karma Police (Radiohead cover)\nJohnny Cash - Bridge Over Troubled Water (Simon and Garfunkel cover)\nJohnny Cash - Desperado (The Eagles cover)\nJohnny Cash - Hurt (Nine Inch Nails cover)\nJohnny Cash - I Won't Back Down (Tom Petty cover)\nJohnny Cash - In My Life (The Beatles cover)\nJohnny Cash - Personal Jesus (Depeche Mode cover)\nJohnny Cash - Solitary Man (Neil Diamond cover)\nJonna Lee - The District Sleeps Alone Tonight (The Postal Service cover)\nJose Gonzalez - Heartbeats (The Knife cover)\nJosie Cotton - Sheena is a Punk Rocker (The Ramones cover)\nJoy Electric - I'm OK, You're OK (Mxpx cover)\nKeane - With or Without you (U2 cover)\nKen Laszlo - Video Killed the Radio Star (The Buggles cover)\nKrokus - Ballroom Blitz (Sweet cover)\nKronos Quartet - Dark Was The Night (Blind Willie Johnson cover)\nThe Leather Nun - Gimme Gimme Gimme (A Man After Midnight) (ABBA cover)\nThe Lemonheads - Mrs. Robinson (Simon &amp; Garfunkel cover)\nLess Than Jake - 500 Miles (The Proclaimers cover)\nLess Than Jake - Gilligan's Island (TV theme cover)\nLess Than Jake - I Think I Love You (The Partridge Family cover)\nLess Than Jake - Jenny (867-5309) (Tommy Tutone cover)\nLess Than Jake - Summer Nights (Grease cover)\nLess Than Jake - You're The One That I Want (Grease cover)\nLess Than Jake - Greased Lightning (Grease cover)\nLess Than Jake - We Go Together (Grease cover)\nLetters to Cleo - I Want You To Want Me (Cheap Trick cover)\nLindsey Pool - Phantom (Phantom of the Opera cover)\nLindsey Pool - Time is Running Out (Muse cover)\nMad Caddies - S.O.S. (ABBA cover)\nThe Magic Numbers - Crazy in Love (Beyonce cover)\nManchester Orchestra - Brother (Annuals cover)\nMarilyn Manson - Another Brick in the Wall (Pink Floyd cover)\nMarilyn Manson - Tainted Love (Soft Cell cover)\nMarilyn Manson - Personal Jesus (Depeche Mode cover)\nMarilyn Manson - Sweet Dreams (Are Made of This) (Eurythmics cover)\nMatisyahu - Watching the Wheels (John Lennon cover)\nMatisyahu - Message in a Bottle (The Police cover)\nMe First and the Gimme Gimmes - I'll Be There (Jackson Five cover)\nMe First and the Gimme Gimmes - You've Got a Friend (James Taylor cover)\nMe First and the Gimme Gimmes - I Get Around (Beach Boys cover)\nMe First and the Gimme Gimmes - Country Roads (John Denver cover)\nMe First and the Gimme Gimmes - Hats Off to Larry (Del Shannon cover)\nMe First and the Gimme Gimmes - Hello (Lionel Richie cover)\nMeat Puppets - Everybody Hurts (R.E.M. cover)\nMeco - Star Wars theme (Star Wars cover)\nMeco - The Phantom Menace (Star Wars cover)\nMeco - Ewok Celebration (Star Wars cover)\nMeco - Lapti Nek (Star Wars cover)\nMeco - Wizard of Oz (Wizard of Oz cover)\nThe Meteors - Bad Moon Rising (CCR cover)\nMichael Franti, Spearhead and Gift of Gab - What I Got (Sublime cover)\nMidtown - Susanne (Weezer cover)\nThe Mighty Mighty Bosstones - Sweet Emotion (Aerosmith cover)\nMika - Sweet Dreams (Are Made of This) (Eurythmics cover)\nMike Ness - Don't Think Twice, It's All Right (Bob Dylan cover)\nMike Ness - I Fought The Law (The Crickets cover)\nMisfits - Monster Mash (Bobby (Boris) Pickett cover)\nMotorhead - Enter Sandman (Metallica cover)\nMurderdolls - White Wedding (Billy Idol cover)\nMustard Plug - The Freshman (The Verve cover)\nMxpx - No Action (Elvis Costello cover)\nMxpx - The KKK Took My Baby Away (The Ramones cover)\nNada Surf - Where is My Mind? (Pixies cover)\nNeil Young - All Along the Watchtower\nNekromantix - Light My Fire (The Doors cover)\nThe New Pornographers - Hey, Snow White (Destroyer cover)\nNick Cave and Shane Macgowan - It's a Wonderful World (Louie Armstrong cover)\nNirvana - The Man Who Sold The World (David Bowie cover)\nNo Doubt - DJs (Sublime cover)\nNo Doubt - It's My Life (Talk Talk cover)\nOf Montreal - Know Your Onion! (The Shins cover)\nThe Offspring - I Wanna Be Sedated (The Ramones cover)\nOrgy - Blue Monday (New Order cover)\nOutkast - My Favorite Things (Sound of Music cover)\nOzma - Across the Sea (Weezer cover)\nOzzy Osbourne - All The Young Dudes (David Bowie cover)\nPanda Riot - Paper Planes (M.I.A. cover)\nPat Boone - Enter Sandman (Metallica cover)\nPat Boone - Paradise City (Guns 'N Roses cover)\nPato Banton - Rock the Casbah (The Clash cover)\nPatti Smith - Here I Dreamt I Was An Architect (The Decemberists cover)\nPeaches - Search and Destroy (Iggy Pop cover)\nThe Peacocks - Ballroom Blitz (Sweet cover)\nThe Phantom Rockers - Tainted Love (Soft Cell cover)\nPhilmore - Livin' On a Prayer (Bon Jovi cover)\nPiebald - No One Else (Weezer cover)\nPlasmatics - Stand By Your Man (Tammy Wynette cover)\nThe Postal Service - Against All Odds (The Police cover)\nThe Postal Service - Grow Old With Me (John Lennon cover)\nThe Postal Service - Suddenly Everything Has Changed (The Flaming Lips cover)\nThe Presidents of the United States of America - Video Killed the Radio Star (The Buggles cover)\nRadiohead - Wish You Were Here (Pink Floyd cover)\nThe Ramones - Have You Ever Seen The Rain? (CCR cover)\nRed Hot Chili Peppers - Havana Affair (The Ramones cover)\nRed Hot Chili Peppers - Subterranean Homesick Blues (Bob Dylan cover)\nRedbird - You Are The Everything (R.E.M. cover)\nRedd Kross - Dancing Queen (ABBA cover)\nReel Big Fish - Take On Me (A-Ha cover)\nReel Big Fish - Boys Don't Cry (The Cure cover)\nReel Big Fish - Boss DJ (Sublime cover)\nReel Big Fish - We Hate it When Our Friends Become Successful (Morrissey cover)\nReel Big Fish - Gigantic (Pixies cover)\nReel Big Fish - Unity (Operation Ivy cover)\nReel Big Fish - Hungry Like The Wolf (Duran Duran cover)\nReel Big Fish - New York, New York (Frank Sinatra cover)\nReel Big Fish - Kiss Me Deadly (Lita Ford cover)\nRelient K - The Pirates Who Don't Do Anything (Veggie Tales cover)\nThe Reverend Horton Heat - Folsom Prison Blues (Johnny Cash cover)\nRevolting Cocks - Do Ya Think I'm Sexy? (Rod Stewart cover)\nRicky Lee Jones - Rebel Rebel (David Bowie cover)\nRico and the Prosthetics - Take Me Out (Franz Ferdinand cover)\nRico and the Prosthetics - Vindicated (Dashboard Confessional cover)\nRico and the Prosthetics - Clint Eastwood (Gorillaz cover)\nRiddlin' Kids - It's The End of The World As We Know It (And I Feel Fine) (R.E.M. cover)\nRight Away, Great Captain! - Me and Julio Down By The Schoolyard (Paul Simon cover)\nRob Zombie - Blitzkrieg Bop (The Ramones cover)\nRod Stewart - Just Like a Woman (Bob Dylan cover)\nRodrigo y Gabriela - Stairway to Heaven (Led Zeppelin cover)\nRoper - You're Still The One (Shania Twain cover)\nRufus Wainwright - Smile (Brian Wilson cover)\nRyan Adams - Dead Leaves and the Dirty Ground (The White Stripes cover)\nRyan Adams - Wonderwall (Oasis cover)\nSave Ferris - Come On Eileen (Dexy's Midnight Runners cover)\nScarling - Creep (Radiohead cover)\nSentenced - Creep (Radiohead cover)\nSheryl Crow - Sweet Child of Mine (Guns 'N Roses cover)\nShinehead - Billie Jean (Michael Jackson cover)\nThe Shins - Suffragette City (David Bowie cover)\nThe Shins - We Will Become Silhouettes (The Postal Service cover)\nShout Out Louds - Man On The Moon (R.E.M. cover)\nSid Vicious - My Way (Frank Sinatra cover)\nSister Double Happiness - Holiday in Cambodia (Dead Kennedys cover)\nSkid Row - T.N.T. (AC/DC cover)\nSlaraffenland - Paranoid Android (Radiohead cover)\nSmashing Pumpkins - Landslide (Fleetwood Mac cover)\nSnuff - I Will Survive (Gloria Gaynor cover)\nSocial Distortion - Ring of Fire (Johnny Cash cover)\nSolarisis - Nothing Else Matters (Metallica cover)\nSoul Asylum - School's Out (Alice Cooper cover)\nSoundgarden - Come Together (The Beatles cover)\nSpiderbait - Black Betty (Ram Jam cover)\nStereophonics - Nothing Compares 2 U (Sinead O'Connor cover)\nStereophonics - Positively 4th Street (Bob Dylan cover)\nStevie Wonder - Redemption Song (Bob Marley cover)\nSufjan Stevens - The One I Love (R.E.M. cover)\nSufjan Stevens - You Are The Blood (Castanets cover)\nSun Kil Moon - Tiny Cities Made of Ashes (Modest Mouse cover)\nSun Kil Moon - Neverending Math Equation (Modest Mouse cover)\nSun Kil Moon - Ocean Breathes Salty (Modest Mouse cover)\nSupersuckers - Hey Ya! (Andre 3000 cover)\nSusanna and the Magical Orchestra - Love Will Tear Us Apart (Joy Division cover)\nT.A.T.U. - How Soon is Now? (The Flaming Lips cover)\nTed Leo - Since U Been Gone / Maps (Kelly Clarkson / Yeah Yeah Yeahs cover)\nThom Yorke - After the Gold Rush (Neil Young cover)\nTom Jones - Kiss (Prince cover)\nTom Jones - Black Betty (Ram Jam cover)\nTom Jones - Burning Down The House (Talking Heads cover)\nTori Amos - Losing My Religion (R.E.M. cover)\nTori Amos - Love Song (The Cure cover)\nTori Amos - Smells Like Teen Spirit (Nirvana cover)\nTrust Company - Rock the Casbah (The Clash cover)\nTulus - Space Oddity (David Bowie cover)\nTV On The Radio - Heroes (David Bowie cover)\nThe Twilight Sad - Climbing Up The Walls (Radiohead cover)\nU2 - Beat on the Brat (The Ramones cover)\nThe Used / My Chemical Romance - Under Pressure (David Bowie &amp; Queen cover)\nVampire Weekend - Exit Music (For a Film) (Radiohead cover)\nVan Halen - Pretty Woman (Roy Orbison cover)\nViolent Femmes - Do You Really Want to Hurt Me? (Culture Club cover)\nViolent Femmes - Positively 4th Street (Bob Dylan cover)\nVitamin C - Last Nite (The Strokes cover)\nVroom - Leave the Biker (Fountains of Wayne cover)\nVroom - Suspect Fled the Scene (Pedro the Lion cover)\nThe W's - Country Roads (John Denver cover)\nWailing Souls - Like a Rolling Stone (Bob Dylan cover)\nWall of Voodoo - Ring of Fire (Johnny Cash cover)\nWarp Brothers - Smells Like Teen Spirit (Nirvana cover)\nThe Watson Twins - Just Like Heaven (The Cure cover)\nWe Are Scientists - Hoppipolla (Sigur Ros cover)\nWeezer - If I Fell (The Beatles cover)\nWeezer - Uptown Girl (Billy Joel cover)\nWeird Al Yankovic - Bohemian Polka (Queen cover)\nThe White Stripes - I Just Don't Know What to Do With Myself (Bob Dylan cover)\nThe White Stripes - One More Cup of Coffee (Bob Dylan cover)\nThe White Stripes - Walking With a Ghost (Tegan and Sara cover)\nThe Whitlams - Tangled Up In Blue (Bob Dylan cover)\nThe Who - Summertime Blues (Eddie Cochran cover)\nWilly Porter - Whip It (Devo cover)\nWilson Pickett - Hey Jude (The Beatles cover)\nThe Wrens - Nightswimming (R.E.M. cover)\nXiu Xiu - Fast Car (Tracy Chapman cover)\nYeah Yeah Yeahs - Sheena is a Punk Rocker (The Ramones cover)\nYo La Tengo - Gentle Hour (Snapper cover)\nYou Say Party! We Say Die! - Nightswimming (R.E.M. cover)\n\n...and so much more!","torrent":{"xt":"urn:btih:8003864e9c02e2e49808e3cdf03029d0f7d06951","amp;dn":"853+cover+songs+by+various+artists","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8003864e9c02e2e49808e3cdf03029d0f7d06951","infoHashBuffer":{"type":"Buffer","data":[128,3,134,78,156,2,226,228,152,8,227,205,240,48,41,208,247,208,105,81]},"announce":[],"urlList":[]}}