{"title":"Mister Miracle (Complete) (No ads)","uid":7822381,"size":679918966,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8114ba1f43a8613de27ff8747b869ece8a2cfe43&amp;dn=Mister+Miracle+%28Complete%29+%28No+ads%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1352853583,"description":"Mister Miracle, aka Scott Free, is a fictional superhero published by DC Comics.  He was created by the King, Jack Kirby and first appeared in Mister Miracle 1, in April, 1971.  The character was inspired by the early illusionist career of comic book artist, Jim Steranko, while the character's relationship with the wife, Big Barda, is based on Kirby's relationship with his own wife.\n\nLike all of The New Gods, Mister Miracle is functionally immortal, having stopped aging around the age of 30, also he has developed an immunity to toxins and diseases. Mr. Miracle has superhuman strength, agility, speed, coordination and reflexes, along with incredible stamina and endurance. Due to his exhausting and rigorous life on Apokolips, Mister Miracle is able to revive with only a minimum amount of rest and sustenance.\n\nScott has genius-level intellect, and possesses much knowledge about the Fourth World and our universe. During his life on Apokolips, he was instructed by Himon in the science and use of advanced technology of Fourth World. Scott became an ingenious inventor that has designed most of the equipment in his costume, including his mother box.\n\nMr. Miracle was trained in Apokolips like an aero-trooper being a formidable combatant and weapon master. Also, he is a master escapologist and acrobat. Scott is considered better at escapes than Batman, and much of his skill is the result of his advanced physiology.\n\nThis torrent was created to honor a request and contains ALL issues mentioned above.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and authors/artists/publishers,) please.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:8114ba1f43a8613de27ff8747b869ece8a2cfe43","amp;dn":"Mister+Miracle+%28Complete%29+%28No+ads%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8114ba1f43a8613de27ff8747b869ece8a2cfe43","infoHashBuffer":{"type":"Buffer","data":[129,20,186,31,67,168,97,61,226,127,248,116,123,134,158,206,138,44,254,67]},"announce":[],"urlList":[]}}