{"title":"Office 2013 SP1 English Collections - MSDN Untouched","uid":9847597,"size":16814268377,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:819979fd2bf858ded68d7cbd9e91b6d9819352f3&amp;dn=Office+2013+SP1+English+Collections+-+MSDN+Untouched&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prathaprabhu","files":20,"time":1396104531,"description":"Office Professional Plus 2013 SP1\nMicrosoft Office Professional Plus 2013 with SP1 provides access to your familiar Office applications, email, calendar, HD video conferencing, and most up-to-date documents.\n\nOffice Multi-Language Pack 2013 with SP1 is for multilingual individuals creating or editing documents in different languages, as well as organizations using applications in environments where PCs are shared by speakers of different languages. It provides the flexibility to switch the user's PC experience; including menus and help, proofing tools, dictionary and thesaurus to any of 40 different languages.\n\nProject Pro 2013 SP1\nCollaborate with others to easily start and deliver winning projects. Call or instant message team members from your project with Lync 2013 with SP1. Improved synchronization with SharePoint 2013 with SP1 helps you effectively track status from virtually anywhere. Lync 2013 wtih SP1 and SharePoint 2013 with SP1 are sold separately.\n\nVisio Professional 2013 with SP1\nVisio Professional 2013 with SP1 makes it easy for teams to work together, with new collaboration capabilities that allow multiple team members to work on a single diagram at the same time, without having to worry about version conflicts. Visio Professional 2013 with SP1 also has a variety of new and updated shapes, an improved ability to change the look of your diagrams and shapes.\n\nExchange Server 2013 SP1\nSharePoint Server 2013 SP1\nSharePoint Designer 2013 SP1.\n\nThanks :)","torrent":{"xt":"urn:btih:819979fd2bf858ded68d7cbd9e91b6d9819352f3","amp;dn":"Office+2013+SP1+English+Collections+-+MSDN+Untouched","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"819979fd2bf858ded68d7cbd9e91b6d9819352f3","infoHashBuffer":{"type":"Buffer","data":[129,153,121,253,43,248,88,222,214,141,124,189,158,145,182,217,129,147,82,243]},"announce":[],"urlList":[]}}