{"title":"The.Runaways.2010.Dvd5.NL.Sub.Optional","uid":10394665,"size":4647545236,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:81ea440f898280adc707c1186a56059d3249541f&amp;dn=The.Runaways.2010.Dvd5.NL.Sub.Optional&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hendriknld","files":40,"time":1403248852,"description":"Los Angeles, 1975. Joan Jett en Cherie Currie, twee tieners met punk in hun bloed, ontmoeten elkaar en worden hart en ziel van 'The Runaways'. De meidenrockband, een verzameling buitenbeentjes, zal veel invloed krijgen op toekomstige generaties vrouwelijke muzikanten. Gitariste Joan is pure rock &amp; roll. Blondine Cherie, die oogt als Brigitte Bardot, is de sexy leadzangeres van The Runaways. Onder leiding van de duivelse impresario Kim Fowley en met hun image van sterke vrouwen worden de ongepolijste talenten een wereldwijd succes.\n\nThe Runaways is a 2010 American drama film about the 1970s all-girl rock band of the same name written and directed by Floria Sigismondi. It is based on the book Neon Angel: A Memoir of a Runaway by the band's original lead vocalist Cherie Currie. The film stars Dakota Fanning as Currie, Kristen Stewart as rhythm guitarist and vocalist Joan Jett, and Michael Shannon as record producer Kim Fowley. The Runaways depicts the formation of the band in 1975 and focuses on the relationship between Currie and Jett until Currie's departure from the band. The film grossed about $4.7 million worldwide and received generally favorable reviews from critics.\n","torrent":{"xt":"urn:btih:81ea440f898280adc707c1186a56059d3249541f","amp;dn":"The.Runaways.2010.Dvd5.NL.Sub.Optional","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81ea440f898280adc707c1186a56059d3249541f","infoHashBuffer":{"type":"Buffer","data":[129,234,68,15,137,130,128,173,199,7,193,24,106,86,5,157,50,73,84,31]},"announce":[],"urlList":[]}}