{"title":"White Papers (Skull &amp; Bones) by Goldstein &amp; Steinberg","uid":4601640,"size":146130,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82bb13c06e241cf9174e08f0b4ebd9e933f698ad&amp;dn=White+Papers+%28Skull+%26+Bones%29+by+Goldstein+%26+Steinberg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Protocol22","files":2,"time":1230240949,"description":"This special report is intended to assist the Japanese audience in more fully understanding the present policies of the United States under the administration of President George Bush. It explains the thinking behind America's military adventure in the Persian Gulf and its current attitudes toward the Middle East region.\n\nIn so doing, we provide a glimpse into the most powerful organization in America--the Order of Skull &amp; Bones. This secret fraternity is based at Yale University in New Haven, Connecticut, where many of the leading members of the U.S. government and the American intelligence community received their formal education. \n\nThe Order, as it is referred to by its members, is a bastion of White Anglo Saxon Protestant (WASP) culture, which is at the core of the American 20th century outlook.\n\nThe reader will learn that President George Herbert Walker Bush's concept of the New World Order is an old idea, one which has its origins in the philosophy and beliefs of the secret Skull &amp; Bones fraternity. Today in particular, this is the prevailing outlook of the U.S. government, many of whose most influential members, like the president himself, are part of the Skull &amp; Bones network. These men seek to recreate the American imperium of the immediate post-World War II period, an era which President Bush frequently refers to as &quot;the American Century.&quot;\n\nThe powerful men of Skull &amp; Bones genuinely believe that they have a strategic and\nmoral &quot;right&quot; to control world affairs. Consequently, they take upon themselves the\nauthority to crush any rivalrous threat to U.S. imperial leadership, whether by current allies, such as Japan, Germany or Great Britain, or by Cold War adversaries, like the Soviet Union. The members of the Order, due to their narrow WASP upbringing, view with particular suspicion the maneuverings of Zionist Israel and its affluent, influential lobby in the United States.\n\nBush, his fellow Bonesmen and their like-thinking elitist allies in the American\nEstablishment see themselves as New World Order warriors, an American samurai caste\nof sorts, whose mission is restoring American greatness. They intend to utilize the\ninstitutional networks of the U.S. government and key private agencies, such as the New York Council on Foreign Relations, to advance their purpose.\nThe Skull &amp; Bones members believe in the idea of &quot;constructive chaos.&quot; By keeping their true policy intentions secret, by constantly sending out mixed signals on all critical policy issues, they consciously seek to sow confusion among both their nominal &quot;friends&quot; and &quot;enemies&quot; alike.\n\nThe fulcrum for the policy of constructive chaos is, at present, the Middle East situation.\nAlthough U.S. military action in the region has for the time being subsided, America's military power will remain a critical determinant in the future of that vital zone of conflict. American military power is aimed at securing undisputed control over the vast reservoir of oil -- not at necessarily fostering any permanent alignment of local states or combinations of regional interests.\n\nIf President George Bush and his fellow true believers are successful, the United States will be first among equals in the New World Order. This is their goal. It is also the quest of the Bonesmen of the Order of Skull &amp; Bones -- America's warrior aristocracy.","torrent":{"xt":"urn:btih:82bb13c06e241cf9174e08f0b4ebd9e933f698ad","amp;dn":"White+Papers+%28Skull+%26+Bones%29+by+Goldstein+%26+Steinberg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82bb13c06e241cf9174e08f0b4ebd9e933f698ad","infoHashBuffer":{"type":"Buffer","data":[130,187,19,192,110,36,28,249,23,78,8,240,180,235,217,233,51,246,152,173]},"announce":[],"urlList":[]}}