{"title":"A Queer Romance - Lesbians, Gay Men and Popular Culture","uid":8923184,"size":7383981,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:841a0b7e3bbfc0fbd92acbc345ef569e5f4fcba7&amp;dn=A+Queer+Romance+-+Lesbians%2C+Gay+Men+and+Popular+Culture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"livhre","files":-1,"time":1379304728,"description":"It's here and it's queer - popular culture inhabits all our lives, whether it comes in the form of movies or magazines, TV or shopping. A Queer Romance brings together critics, writers and artists to debate the possibilites of popular culture for lesbians and gay men.\nIn a collection that is in-yer-face but never out-to-lunch, the contributors variously revisit debates about the gaze to provide a new theory of Queer viewing; discuss texts coded as queer - from lesbian vampires to Hollywood's use of gay codes in mainstream films such as Top Gun and Black Widow; consider the sexual and cultural narratives at play in the world of home shopping catalogues; explore the pleasures and perils of gay cultural production, from the radically queer film-making of Monika Treut to the wild world of homocore fanzines, and address the possibilities of texts claiming to be for the gay spectator - from pornography `by women, for women and about women' to `Out' TV.\nThe contributors to A Queer Romance don't all agree but, taken together, the collection argues strongly that everyone can have their queer moments","torrent":{"xt":"urn:btih:841a0b7e3bbfc0fbd92acbc345ef569e5f4fcba7","amp;dn":"A+Queer+Romance+-+Lesbians%2C+Gay+Men+and+Popular+Culture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"841a0b7e3bbfc0fbd92acbc345ef569e5f4fcba7","infoHashBuffer":{"type":"Buffer","data":[132,26,11,126,59,191,192,251,217,42,203,195,69,239,86,158,95,79,203,167]},"announce":[],"urlList":[]}}