{"title":"Megamagic Wizards of the Neon Age-HI2U","uid":14373168,"size":554374120,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:854ef56f1e8e79d3dc8b03c41f347f93c431b522&amp;dn=Megamagic+Wizards+of+the+Neon+Age-HI2U&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":5,"time":1461179787,"description":"\nAbout This Game\r\nPrepare to delve into a fascinating world where the forces of technology and magic are embroiled in a vicious struggle! Blurring the lines between the RPG and strategy genres, Megamagic recaptures the unmistakable flavour of the 80s in a game filled with pop culture references and magnified by the incredible music by Mitch Murder, composer of Kung Fury and Hotline Miami 2 soundtracks.\r\n\r\nMegamagic features a deep combat system that put five different schools of magic at your command, challenging you to unveil the secrets hidden in monster-infested wastelands, neon-bathed cities and shady dungeons alike. Learn new spells and summon the creatures you have beaten, leading a powerful army of grims on your own style. You will need to rely on your ever-growing grimoire, developing your own playstyle as you become the greatest wizard in the world... and the last hope to discover what the sacred institution of the Order is hiding behind their unsullied facade.\r\nFeatures\r\n\r\n    Action RPG meets Real Time Strategy in a totally new way.\r\n    Explore an open world and venture into the depths of perilous dungeons.\r\n    Master 5 different magical alignments: Neonmancy, Vegemancy, Sanctumancy, Fulgomancy and Necromancy.\r\n    Research and craft 20 spells + 16 grims, each with their own passive and active unique skills.\r\n    Beat 9 hair-raising bosses.\r\n    Local multiplayer co-op mode: have up to 4 player companions controlling your grims in battle!\r\n    Original soundtrack by 80's synth-surfer Mitch Murder","torrent":{"xt":"urn:btih:854ef56f1e8e79d3dc8b03c41f347f93c431b522","amp;dn":"Megamagic+Wizards+of+the+Neon+Age-HI2U","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"854ef56f1e8e79d3dc8b03c41f347f93c431b522","infoHashBuffer":{"type":"Buffer","data":[133,78,245,111,30,142,121,211,220,139,3,196,31,52,127,147,196,49,181,34]},"announce":[],"urlList":[]}}