{"title":"S.P.BALASUBRAHMANIAM Hindi Magical Vocalist.(2 CDS)@Mastitorrent","uid":5654831,"size":376603190,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:856a7448263bb379f054bedbdb8684f435d786b5&amp;dn=S.P.BALASUBRAHMANIAM+Hindi+Magical+Vocalist.%282+CDS%29%40Mastitorrent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"amanrulz","files":-1,"time":1277755591,"description":"mastitorrents.com &lt;a href=&quot;\nhttp://mastitorrents.com/forums/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mastitorrents.com/forums/index.php&lt;/a&gt;\n\n\nVocal music is one of the oldest and most universal art forms. A discovery and celebration of one such voice is Sripathi Panditharadhyula Balasubramaniam. His music transcends all barriers - linguistic, geographical and chronological. He is a phenomenal success and incredibly talented. He is S.P. BALASUBRAMANIAM, popularly known as Balu.\n\nSPB took the Indian film music scene by storm in 1979 with his phenomenally successful rendition for the movie SHANKARABHARANAM. He won his first National Award for the same and came the international fame. After this, there was no looking back. He consistently topped the Indian musical charts.\n\nBalu was born on June 4, 1946, in Konetampet, then in Andhra Pradesh, now in Tamil Nadu. His father, Sri. S.P. Sambhamurthy was a fine musician and an excellent exponent of &quot;Harikatha&quot; (a fine art form of entertainment combined with music and story telling).\n\nBlessed with an adorable voice and impeccable musical skills, SPB was never trained to be a singer. A young, Telugu-speaking lad from Andhra Pradesh, like any other boy his age was studying to pursue a career in Engineering. He had a natural flair for singing and participated in most of the singing contests from college. In one such contest, was spotted by his mentor the late, Sri. S.P. Kodandapani. Balu won the first prize and walked out with his first break to sing in the film &quot;SRI SRI SRI MARYADA RAMANNA&quot; in 1966. Thus began a legendary career which became history.\n\nBalus first break in Hindi films was EK DUJE KE LIYE. Subsequently, he created history by bagging the National Award for his first song in the first Hindi movie.\nSo far, Balu has sung over a record 36,000 plus songs in a span of 39 years, in all languages which include several albums of contemporary Indian music, private albums for devotional songs and movies. It is amazing to see the ease with which Balu can render his voice for any language namely, Telugu, Tamil, Kannada, Malayalam, Hindi, Tulu, Oriya, Assamese and Punjabi.\n\nALBUM..................: THE LEGEND - S.P.BALASUBRAMANIAM - MAGICAL VOCALIST\nARTIST....................: S.P.BALASUBRAMANIAM\nSOURCE................: ORIGINAL CD\nRIPPER...................: EAC (SECURED)\nCODEC..................: LAME 3.98\nFORMAT................: MPEG 1 LAYER III\nQUALITY................: INSANE (BITRATE - 320 KBPS)\nCHANNELS............: JOINT STEREO - 44100 HZ","torrent":{"xt":"urn:btih:856a7448263bb379f054bedbdb8684f435d786b5","amp;dn":"S.P.BALASUBRAHMANIAM+Hindi+Magical+Vocalist.%282+CDS%29%40Mastitorrent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"856a7448263bb379f054bedbdb8684f435d786b5","infoHashBuffer":{"type":"Buffer","data":[133,106,116,72,38,59,179,121,240,84,190,219,219,134,132,244,53,215,134,181]},"announce":[],"urlList":[]}}