{"title":"Savage Magic by Lloyd Shepherd","uid":11092267,"size":874387,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:859d9a4693745f3def0769d5937d29974d8027f9&amp;dn=Savage+Magic+by+Lloyd+Shepherd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":2,"time":1411541526,"description":"\nIt's 1814 and the streets of London's Covent Garden are at the centre of a dark trade, enticing rich and poor alike with a cocktail of gin and beer and sex. Behind their own fashionable private doors in the surrounding parishes a group of aristocratic young men are found murdered, all of them wearing the mask of a satyr, all of them behind locked doors with no signs of entry.\n\nConstable Charles Horton's investigation into these violent crimes begins, quite by chance, at Thorpe Lee House in Surrey, where accusations of witchcraft have swept the village. What connects these broken London men, savage with the pursuit of pleasure, and a country village awash with folklore and talk of burning witches?\n\nThe answers lie, yet again, under lock and key, in a madhouse for the deranged, where Horton's wife Abigail seeks refuge from her disordered mind. In this world of witchcraft and madhouses, whores and aristocrats, it's a savage magic indeed that holds its victims in its thrall.\n\nLloyd Shepherd's most ambitious novel to date is a triumph of the imagination. His rich cast of characters weaves a hugely satisfying story of depth, insight and exquisite drama.\n\nGenre: Historical Fiction, Fantasy, Crime, Mystery","torrent":{"xt":"urn:btih:859d9a4693745f3def0769d5937d29974d8027f9","amp;dn":"Savage+Magic+by+Lloyd+Shepherd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"859d9a4693745f3def0769d5937d29974d8027f9","infoHashBuffer":{"type":"Buffer","data":[133,157,154,70,147,116,95,61,239,7,105,213,147,125,41,151,77,128,39,249]},"announce":[],"urlList":[]}}