{"title":"Beyond Belief by V. S. Naipaul","uid":9621800,"size":2812958,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8765dd80d1258374838b7b9554c747c991cdc4a4&amp;dn=Beyond+Belief+by+V.+S.+Naipaul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":3,"time":1392509768,"description":"\nFourteen years after the publication of his landmark travel narrative Among the Believers, V. S. Naipaul returned to the four non-Arab Islamic countries he reported on so vividly at the time of Ayatollah Khomeini's triumph in Iran. Beyond Belief is the result of his five-month journey in 1995 through Indonesia, Iran, Pakistan, and Malaysia--lands where descendants of Muslim converts live at odds with indigenous traditions, and where dreams of Islamic purity clash with economic and political realities.\n\nIn extended conversations with a vast number of people--a rare survivor of the martyr brigades of the Iran-Iraq war, a young intellectual training as a Marxist guerilla in Baluchistan, an impoverished elderly couple in Teheran whose dusty Baccarat chandeliers preserve the memory of vanished wealth, and countless others--V. S. Naipaul deliberately effaces himself to let the voices of his subjects come through. Yet the result is a collection of stories that has the author's unmistakable stamp. With its incisive observation and brilliant cultural analysis, Beyond Belief is a startling and revelatory addition to the Naipaul canon.\n\nGenre: Non Fiction | History | Religion","torrent":{"xt":"urn:btih:8765dd80d1258374838b7b9554c747c991cdc4a4","amp;dn":"Beyond+Belief+by+V.+S.+Naipaul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8765dd80d1258374838b7b9554c747c991cdc4a4","infoHashBuffer":{"type":"Buffer","data":[135,101,221,128,209,37,131,116,131,139,123,149,84,199,71,201,145,205,196,164]},"announce":[],"urlList":[]}}