{"title":"Scanner - 4 Albums","uid":4433456,"size":450218046,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:876b21523fbe17fe3e7c7e289432214eb617a8c1&amp;dn=Scanner+-+4+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"m4lvolio","files":29,"time":1223413109,"description":"Battersea-based ambient composer Robin Rimbaud, aka Scanner, takes his curious pseudonym from his compositional tool of choice; the cellphone scanner. Although only recording and releasing music since the early &amp;#039;90s, Rimbaud has already earned a reputation as a boundary pushing experimentalist, wedding scanned vocal samples with sparse electronics and other textural elements that underscore the degree of strain and isolation often associated with modern telecommunications technology. Though working increasingly toward other, more musical compositional devices, his first several releases went heavy on the lifted convo, attracting as often the comment of postgrad pocket theorists interested in the critical implications of Rimbaud&amp;#039;s work as the music critics. Although admitting to a certain voyeuristic fixation even in his childhood, Rimbaud&amp;#039;s began exploring it through music only recently, acquiring a police scanner from the Brixton Hunt and Saboteurs group (a sort of wargames/survivalist collective) at a surprising discount. He&amp;#039;s since recorded a number of albums and completed remixes for Oval, Scorn, and others. Thought not as varied or complex in his approach as some of his peers in the European electronic music avant-garde, Rimbaud&amp;#039;s probing experimentalism and developing focus has won him high praise among the more cerebral of the emusic set, resulting in a number of commissioned performance and composition opportunities that have brought him in contact with the likes of David Shea, Bill Laswell, Oval&amp;#039;s Markus Popp, and Karlheinz Stockhausen (the latter of which Rimbaud counts among his admirers). He also worked on the score for the film The Garden Is Full of Metal, about late film director Derek Jarman. In 2001 Scanner returned with the album Wave of Light by Wave of Light, using the name Scannerfunk.\n\n","torrent":{"xt":"urn:btih:876b21523fbe17fe3e7c7e289432214eb617a8c1","amp;dn":"Scanner+-+4+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"876b21523fbe17fe3e7c7e289432214eb617a8c1","infoHashBuffer":{"type":"Buffer","data":[135,107,33,82,63,190,23,254,62,124,126,40,148,50,33,78,182,23,168,193]},"announce":[],"urlList":[]}}