{"title":"Aloes - The genus Aloe","uid":4857639,"size":27666828,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:877442895d972d00532b0ba35d8c2d8a337f020a&amp;dn=Aloes+-+The+genus+Aloe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philmccrevice","files":1,"time":1240130549,"description":"Aloes are a large genus of plants, about 450 species, from sub-Saharan Africa, Madagascar, and parts of Arabia. Many species are widespread in warm or tropical semi-arid regions, yet the distribution of others is limited to a few living in desert or wet mountainous regions. While some species have been adopted as medicinal plants since ancient times and others are used locally in folk medicine, scientists have yet to discover the full biological activity of the many aloe compounds. In order to realize the vast potential of the genus, it is essential to gather the knowledge acquired over the last fifty years into one comprehensive compilation. A landmark publication, Aloes: The genus Aloe reviews all botanical, chemical, biochemical, and medical information as well as commercial applications of aloes. The first part of the book features information on the habitat and taxonomy of aloes, followed by a section on aloe constituents. Part 3 focuses on therapeutic activity and includes chapters on aloe's role in wound healing, skin cancer, and the immune system. The final section is devoted to aloe biology. Chapters are written by accomplished contributors who share their expertise and insight from all areas of academia and industry.Providing a solid foundation for future research, this volume brings together a wealth of information on aloes from a variety of sources, including seldom-recorded folk customs. It is a valuable guide for researchers and professionals in the areas of botany, natural product chemistry, pharmacology, dermatology, and immunology. \n","torrent":{"xt":"urn:btih:877442895d972d00532b0ba35d8c2d8a337f020a","amp;dn":"Aloes+-+The+genus+Aloe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"877442895d972d00532b0ba35d8c2d8a337f020a","infoHashBuffer":{"type":"Buffer","data":[135,116,66,137,93,151,45,0,83,43,11,163,93,140,45,138,51,127,2,10]},"announce":[],"urlList":[]}}