{"title":"Joe Harriott - Swings High [1967]","uid":9487400,"size":104431162,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:878c6683111ad41e9f026dfcf1f1593386a299f4&amp;dn=Joe+Harriott+-+Swings+High+%5B1967%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1389925747,"description":"mp3 320\n\n\n\nThe Jamaica-born alto saxophonist Joe Harriott is one the greatest legends of British modern jazz's first wave. There weren't many, but Harriott's searing sound would have stood out anywhere - and did, even on New York's 52nd Street in Charlie Parker's day.\n\nThe Parker connection is particularly pertinent to this set, which has the tinny recording qualities of a 1940s Dial or Savoy Bird classic, with the same fierce attack - as if the player were about to burst out of your speakers.\n\nHarriott had already made his pioneering free-form recordings years before this 1967 date, and it represented an odd throwback to the standard- and song-based repertoire the saxophonist's hard-bop group was playing a decade before. An alert and sympathetic band - including pianist Pat Smythe, bassist Coleridge Goode and a scalding Phil Seamen on drums - holds the line, while an obscure trumpet player, Stu Hamer, delivers some taut and telling bop solos.\n\nThe compositions are striking, too, in a deviously extended way. But Harriott himself is absolutely enthralling: delicate as teardrops on A Time for Love, almost as wilful and raw-nerved as Parker on Blues in C, razor-sharp and urgent on the uptempo Shepherd's Serenade. A real gem.\n","torrent":{"xt":"urn:btih:878c6683111ad41e9f026dfcf1f1593386a299f4","amp;dn":"Joe+Harriott+-+Swings+High+%5B1967%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"878c6683111ad41e9f026dfcf1f1593386a299f4","infoHashBuffer":{"type":"Buffer","data":[135,140,102,131,17,26,212,30,159,2,109,252,241,241,89,51,134,162,153,244]},"announce":[],"urlList":[]}}