{"title":"Coast to Coast AM - May 01 2011 - Death of bin Laden","uid":6365224,"size":55663901,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:87904998a28d8a34de011ebd8ceb41e1376f18e9&amp;dn=Coast+to+Coast+AM+-+May+01+2011+-+Death+of+bin+Laden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mscowlove","files":5,"time":1304480109,"description":"Coast to coast AM 2011-05-01 \nDeath of Bin Laden\n\nDate: 05-01-11 \nHost: George Noory \nGuests: Maureen Hancock, Douglas Hagmann \nIn the first half of the show, intelligence expert Douglas Hagmann reacted to the news of the US' successful mission in killing Osama bin Laden, which was announced by Pres. Obama late on Sunday night. Since 2002, there's been no substantial proof that bin Laden was still alive, yet there had been some intel he might be living in Afghanistan or Pakistan. To that end, &quot;it would make sense...that he would be found where he was-- a heavily guarded compound,&quot; he noted, adding that he thought some type of back-deal arrangement was made between the US and Pakistan in regard to the mission. \n\nPeople are going to want to see the body, and there should be independent forensic testing of the body to ensure that it is bin Laden, and his death occurred as reported, Hagmann suggested. (Later in the morning, the surprising news broke that bin Laden's body had already been &quot;buried at sea&quot; in &quot;accordance with Muslim tradition.&quot;) \n\nHagmann also pointed out the curious timing of an article that ran in The Telegraph on April 25th, warning that if bin Laden was captured, al-Qaeda would unleash a &quot;nuclear hellstorm,&quot; and that they had already hidden a nuclear bomb in Europe. \n\nConversations with a Medium\nAppearing during the third hour, spirit medium Maureen Hancock discussed her psychic impressions and communications with the dead. Interestingly, she sometimes incorporates humor in her readings, and is known as the &quot;comedian medium.&quot; She described working with law enforcement on missing person cases, and said that while teamed up with a detective, they've brought home five living children and adults in the last six months. Her latest adventures include working with Hollywood producers on developing a TV show (she just finished shooting the pilot, &quot;Ghost Town&quot; for the Style Channel). \n\nThe last hour of the show featured Open Lines, with a number of callers reacting to the news about bin Laden. \n\nNews segment guests: Richard C. Hoagland, Dr. Robin Falkov \n\nWebsite(s): \nmaureenhancock.com\nhomelandsecurityus.com\nBook(s): \nThe Medium Next Door\n","torrent":{"xt":"urn:btih:87904998a28d8a34de011ebd8ceb41e1376f18e9","amp;dn":"Coast+to+Coast+AM+-+May+01+2011+-+Death+of+bin+Laden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87904998a28d8a34de011ebd8ceb41e1376f18e9","infoHashBuffer":{"type":"Buffer","data":[135,144,73,152,162,141,138,52,222,1,30,189,140,235,65,225,55,111,24,233]},"announce":[],"urlList":[]}}