{"title":"HISTORY OF POP AND ROCK MUSIC - part 377","uid":7188527,"size":610273660,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:87b5c28a71f4dba950fcbcdb8cd0b023756619f5&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+377&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pupovaczlatko","files":-1,"time":1334533759,"description":"  \n\n                PART  377\n\n\n           TRAVIS  - Why Does It Always Rain on Me? (1999)\n           TRAVIS  - Sing  (2001)\n           TRAVIS  - Sing   (Top Of The Pops)  (2001)\n           TRAVIS  - Side  (2001)\n\n\n     &quot;Why Does It Always Rain on Me?&quot; is a song by Scottish band Travis, released as the third single from their second studio album, &quot;The Man Who&quot;. The song became the group's international breakthrough single, receiving recognition around the world. It was their first Top 10 hit on the UK Singles Chart, peaking at #10. The song also peaked at #11 on the ARIA Chart, and achieved success in Japan and America. The song was written by frontman Fran Healy.When Travis started to perform this song at the 1999 Glastonbury Festival, after being sunny for several hours, it began to rain exactly when the first line was sung.\n    &quot;Sing&quot; is the lead single from Indie band Travis's third studio album, &quot;The Invisible Band&quot;. It was released in the United Kingdom on May 28, 2001, following an extensive five-week promotional campaign. The song reached a peak position of number three on the UK Singles Chart. &quot;Sing&quot; was a worldwide success, reaching top ten in several countries in Europe and Latin America.The music video features the band visiting a large country house for dinner and getting into a massive food fight with the residents. The video premiered in on April 20, 2001, on Top of the Pops. When the single reached number three, the band were invited on to Top Of The Pops, where they re-enacted the food fight for a live performance. This performance is sometimes used instead of the main video.\n     &quot;Side&quot; is the second single taken from Indie band Travis' third studio album, &quot;The Invisible Band&quot;. The single peaked at #14 on the UK Singles Chart. The video for the song has a UFO theme, similar to The X-Files television series. The video begins with three boys looking for UFOs through their bedroom skylight. When one hovers overhead, they go outside and follow it, only for it to land in a cavern in the desert, where they find Travis performing the song. At the end of the video, the band are abducted by aliens while they are performing out in the desert. Fittingly, the clip ends with a newspaper article regarding their disappearance, which coincides with the sightings.","torrent":{"xt":"urn:btih:87b5c28a71f4dba950fcbcdb8cd0b023756619f5","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+377","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87b5c28a71f4dba950fcbcdb8cd0b023756619f5","infoHashBuffer":{"type":"Buffer","data":[135,181,194,138,113,244,219,169,80,252,188,219,140,208,176,35,117,102,25,245]},"announce":[],"urlList":[]}}