{"title":"Autosport Magazine UK 09/12/2010","uid":6026537,"size":82028252,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:884b52385231b0d484e99be457491a20c388c752&amp;dn=Autosport+Magazine+UK+09%2F12%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"thorhammer2000","files":-1,"time":1291948616,"description":"NEWS\n10 Green light for black/gold. Lotus buy-in to Renault F1 team means famous name can challenge for victories\n15 1600cc turbos for F1. Todt pushes through 'small is beautiful' regulations as F1 enters new 'green' age in 2013\n18 Nasr joins Carlin. Highly-rated Brazilian joins British F3's leading team\n20 Brundle/Blundell revival. Ex-Brabham and Ligier co-equipiers join forces for Daytona 24 Hours attack\n22 Fords for Motorbase. BTCC team switches its Focus from trusty BMWs\n25 Loeb needs to earn it. Citroen tells seven-time champion that he'll need to assert himself over Ogier\n\nREPORTS\n70 World GT1 San Luis. French Aston Martin duo dominate the races, as Italo-German line-up clinches crown in Maserati\n72 World of Sport. Australian V8 Supercars; Argentinian TC2000; Brazilian V8 Stock Cars\n\nFEATURES\n26 The greatest cars - by the great designers. What the brains of motorsport loved, from Lotus 79 to Alpine A110\n34 AUTOSPORT Awards. Full coverage of readers' poll-toppers, plus 22nd McLaren AUTOSPORT BRDC Award victor\n52 Farewell Bridgestone. The history of a motorsport legend as it pulls out of F1\n58 World Rally review. Loeb shows them all how to do it - as usual\n64 Two-litres over and out. Looking back at 15 years of the last breed of WRC cars\n66 Pastor Maldonado. The new GP2 champion got it all right - at last\n68 GP2 review. Rivals fail to keep constant pressure on Maldonado\n\nSPORTS EXTRA\n85 24-hour historics. New club plans twice-round-the-clock race for touring and GT cars of 1950s and '60s\n86 SLS for British GT. Bearded Jones twins to race stunning new SLS in bid to regain UK crown\n90 Ginetta TOCA reviews. Wrathall and Ingram win BTCC-supporting G50 and Junior championships\n\nREGULARS\n97 Photo finish. World Sports Cars, Buenos Aires, 1954\n98 Race of my life. David Brabham, Australian F2, Adelaide, 1987","torrent":{"xt":"urn:btih:884b52385231b0d484e99be457491a20c388c752","amp;dn":"Autosport+Magazine+UK+09%2F12%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"884b52385231b0d484e99be457491a20c388c752","infoHashBuffer":{"type":"Buffer","data":[136,75,82,56,82,49,176,212,132,233,155,228,87,73,26,32,195,136,199,82]},"announce":[],"urlList":[]}}