{"title":"Charles Dickens - Little Dorrit (Unabridged)","uid":4480301,"size":826594608,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:89d3588602aec1d3a3898fba0e32cf7679490dfa&amp;dn=Charles+Dickens+-+Little+Dorrit+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dougietrotter","files":65,"time":1225540672,"description":"Little Dorrit is a serial novel by Charles Dickens published originally between 1855 and 1857. It is a work of satire on the shortcomings of the government and society of the period.\n\nMost of the action of Little Dorrit takes place in and around the debtor's prison in London, known as the Marshalsea, where William Dorrit has been imprisoned for such a long time that his daughter Amy, also called Little Dorrit, has been born and raised up there. Due to his long period of incarceration he has been given the honary title of the Father of the Marshalsea. Amy has a snobbish sister Fanny, and a brother Edward also called Tip.\n\nThe novel starts in Marseilles, where in the local prison the villain Rigaud tells his fellow prisoner that he is there for murdering his wife. Also in Marseilles enduring a period of quarantine is Arthur Clennam on his way home to London to see his mother after spending many years in China with his now dead father.\n\nBack in London Arthur Clennam tells his mother that he has a gut feeling that his father has been guilty of dishonesty in business. However, she will not hear of it. Arthur meets his old passion Flora Finching, but she is now fat and silly, and she talks incessantly. Arthur also meets Little Dorrit, whom his mother employs. Arthur does not realize that Little Dorrit is falling in love with him, yet he does show some interest in her and tries to help her and her family. In this respect he investigates William Dorrit's debt at the exceedingly inefficient Circumlocution Office. There, however, he meets Daniel Doyce, an inventor and engineer and the two men go into partnership with each other.\n\nLater with the help of Pancks, the rent-collector, he discovers that William Dorrit is the heir to a fortune, and the Dorrits are finally able to leave the Marshalsea. However, they all, with the exception of Little Dorrit, become arrogant and conceited. Fortunes are now reversed when Arthur Clennam himself is ruined due to an unfortunate speculation in the fraudulent banker Merdle's financial empire. Merdle commits suicide, and Arthur Clennam now finds himself imprisoned in the Marshalsea. In the debtor's prison Arthur Clennam sickens, but Little Dorrit nurses him back to health, and he is finally released from prison through the help of Daniel Doyce. After Little Dorrit's fortune is lost too, also through Merdle, she and Arthur marry.\n\nIt appears that old Mrs. Clennam is not Arthur's mother, and that it is she who has suppressed the will which benefited the Dorrits. This subplot involves Rigaud, who has come from Marseilles to London, and Mrs. Clennam's old servant and business partner, Jeremiah Flintwich.\n\n\n","torrent":{"xt":"urn:btih:89d3588602aec1d3a3898fba0e32cf7679490dfa","amp;dn":"Charles+Dickens+-+Little+Dorrit+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89d3588602aec1d3a3898fba0e32cf7679490dfa","infoHashBuffer":{"type":"Buffer","data":[137,211,88,134,2,174,193,211,163,137,143,186,14,50,207,118,121,73,13,250]},"announce":[],"urlList":[]}}