{"title":"Doctor Who Confidential - 2006 - Season 02 - 13 Episodes + 1 Spe","uid":10662956,"size":3079858812,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8a28dd1e5069399ae058b736f200303e09db91ce&amp;dn=Doctor+Who+Confidential+-+2006+-+Season+02+-+13+Episodes+%2B+1+Spe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bnaron","files":-1,"time":1406751184,"description":"Doctor Who Confidential - Season 02 (2006) - 13 Episodes + 1 Special\n\n\nSeries Description Courtesy:\n\nWikipedia, the free encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Doctor_Who_Confidential&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Doctor_Who_Confidential&lt;/a&gt;\n\nA second season of Doctor Who Confidential was commissioned to accompany the 2006 series. Mark Gatiss replaced Pegg as narrator. A special episode of the program was produced for BBC's Doctor Who Night on 9 April 2006. Due to a wide range of schedule changes that either delayed or altered transmission of Doctor Who, the series aired at various times during its run. Unlike the first series, no episodes were webcast. These were also released on the DVD in edited-down format (once again subtitled Cut Down); the first episode of the season, &quot;One Year On&quot;, was not released to DVD. A documentary special was made for broadcast on BBC One on the day of the 2006 Christmas Special, &quot;The Runaway Bride&quot;. The special was broadcast with the Confidential title (albeit with &quot;Christmas Special&quot; attached), opening theme, and unique titles (with images from &quot;The Runaway Bride&quot;) - it was narrated by the series three narrator, Anthony Head, and followed the creation of the Doctor Who: A Celebration concert. This is noteworthy as being unrelated to its companion episode, although a brief preview of the episode appeared as part of the concert.\n\nNOTE: Although the description above mentions the special, &quot;One Year On,&quot; as part of Season 2, it naturally belongs as part of Season 1 and has been placed there instead. This leaves only a single special this season, &quot;Music and Monsters.&quot;\n\n\nEpisode Synopses courtesy of:\n\nThe On-line TV Database\nAn Open Database for Television Fans\nwww.thetvdb.com\n\n\n2006-04-15 - New, New Doctor (Video: 640x360, 984kbps, 25fps - Audio: 44.1kHz, 111kbps)\n\nBehind the scenes of &quot;New Earth&quot;. David Tennant is interviewed during his first few days playing the new Doctor. The process of regeneration is closely examined, as we learn all about the Doctor's regeneration at the end of The Parting of the Ways, follow him as he chooses his new outfit in The Christmas Invasion, then join the Doctor and Rose on their first adventure together on New Earth.\n\n\n2006-04-22 - Fear Factor (Video: 640x368, 1084kbps, 25fps - Audio: 44.1kHz, 97kbps)\n\nBehind the scenes of &quot;Tooth and Claw&quot;. On the back of Tooth and Claw, this episode examines just how scary Doctor Who can be. The episode looks at how state-of-the-art CGI is used to create some of the Doctor's scariest enemies, and revisits his bone-chilling fight with the Sycorax leader in The Christmas Invasion.\n\n\n2006-04-29 - Friends Reunited (Video: 416x236, 364kbps, 25fps - Audio: 44.1kHz, 97kbps)\n\nBehind the scenes of &quot;School Reunion&quot;. As well as going behind the scenes on School Reunion, this episode examines why former companions have decided to leave the TARDIS in the past, with interviews from the actors who played them. Also, the actors discuss what they think that their characters would be doing now, after leaving the Doctor and the TARDIS.\n\n\n2006-05-06 - Script to Screen (Video: 320x240, 472kbps, 30fps - Audio: 44.1kHz, 96kbps)\n\nBehind the scenes of &quot;The Girl in the Fireplace&quot;. This episode looks at the production process that turns an initial script into a completed episode of Doctor Who.\n\n\n2006-05-13 - Cybermen (Video: 320x240, 470kbps, 30fps - Audio: 44.1kHz, 93kbps)\n\nBehind the scenes of &quot;Rise of the Cybermen (1)&quot;. This episode examines the history of the dreaded Cybermen, with memorable clips from the original series, and looks at the design process that brought the new-look Cybermen to our screens in the episode Rise of the Cybermen.\n\n\n2006-05-20 - From Zero to Hero (Video: 624x352, 1102kbps, 25fps - Audio: 44.1kHz, 116kbps)\n\nBehind the scenes of &quot;The Age of Steel (2)&quot;. A look at the journey Mickey Smith has taken over the past two series. Featuring key backstage scenes in his final episode, actor Noel Clarke provides an insight to life on set and beyond.\n\n\n2006-05-27 - The Writer's Tale (Video: 624x352, 1108kbps, 25fps - Audio: 44.1kHz, 118kbps)\n\nBehind the scenes of &quot;The Idiot's Lantern&quot;. Mark Gatiss, writer of The Idiot's Lantern takes us through the writing process, and explains the thrill a writer feels as his words come to life on set.\n\n\n2006-06-03 - You've Got the Look (Video: 624x352, 1101kbps, 25fps - Audio: 44.1kHz, 111kbps)\n\nBehind the scenes of &quot;The Impossible Planet&quot;. The design team is responsible for the look of Doctor Who, building sets and redressing locations to create the different time periods and alien worlds to which the Doctor travels.\n\n\n2006-06-10 - Myths and Legends (Video: 624x352, 1095kbps, 25fps - Audio: 44.1kHz, 108kbps)\n\nBehind the scenes of &quot;The Satan Pit&quot;. This episode looks at the various religious and mythical figures that the Doctor has come across on his travels.\n\n\n2006-06-17 - New World of Who (Video: 640x368, 1092kbps, 25fps - Audio: 44.1kHz, 103kbps)\n\nBehind the scenes of &quot;Love and Monsters&quot;. This episode looks in detail at the development of the Doctor's latest foe from its origin as the winning entry in a &quot;design a monster&quot; competition on Blue Peter. New technology has allowed the expansion of the Doctor Who universe, through the interactive The Attack of the Graske episode and &quot;TARDISode&quot; downloads.\n\n\n2006-06-24 - The Fright Stuff (Video: 640x360, 1094kbps, 25fps - Audio: 44.1kHz, 105kbps)\n\nBehind the scenes of &quot;Fear Her&quot;. This program looks at some of the scariest moments in the history of Doctor Who.\n\n\n2006-07-01 - Welcome to Torchwood (Video: 624x368, 1108kbps, 25fps - Audio: 44.1kHz, 119kbps)\n\nBehind the scenes of &quot;Army of Ghosts&quot;. In a break from the normal programming, this episode takes a look behind the scenes of next year's spin-off series Torchwood.\n\n\n2006-07-08 - Finale (Video: 624x368, 1093kbps, 25fps - Audio: 44.1kHz, 112kbps)\n\nBehind the scenes of &quot;Doomsday&quot;. This episode takes a look back at the second series of Doctor Who and goes behind the scenes of the epic season finale.\n\n\nSeason 2 - Special\n\n\n2006-12-25 - Special - Music and Monsters (Video: 640x368, 1090kbps, 25fps - Audio: 44.1kHz, 102kbps)\n\nThis Christmas special goes behind the scenes of Doctor Who - A Celebration, a one-off concert featuring the BBC National Orchestra of Wales and staged at the Welsh Millennium Center on 19 November 2006 in aid of Children In Need.\n","torrent":{"xt":"urn:btih:8a28dd1e5069399ae058b736f200303e09db91ce","amp;dn":"Doctor+Who+Confidential+-+2006+-+Season+02+-+13+Episodes+%2B+1+Spe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a28dd1e5069399ae058b736f200303e09db91ce","infoHashBuffer":{"type":"Buffer","data":[138,40,221,30,80,105,57,154,224,88,183,54,242,0,48,62,9,219,145,206]},"announce":[],"urlList":[]}}