{"title":"Cannibal - Marian Dora","uid":8548651,"size":734169088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8a5aa06d875345e1483094e5f02027ad55114bbf&amp;dn=Cannibal+-+Marian+Dora&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Barovian","files":-1,"time":1370585365,"description":"Cannibal is a 2006 German direct-to-video horror film written, directed and produced by Marian Dora.\n\n\nIn the intro, a young boy is read the story of Hansel and Gretel by his mother. The setting then moves to the present day, where The Man goes about his day to day routines, occasionally chatting with others on his computer, looking for someone who shares his cannibalistic fantasies. The Man meets with several people he had chatted with, but he either rejects them or is rejected (and in one case attacked) by them, except for The Flesh, a suicidal man who volunteers to be killed and eaten by The Man. The Flesh travels to The Man from Berlin, and the two bond, having sex and frolicking in the nude in and around The Man's home.\nWhen The Flesh decides that it is time for him to die and be devoured, he tries to coerce The Man into biting off his penis, but The Man is unable to go through with it, even when The Flesh uses drugs to knock himself out in an attempt to make things easier. Disappointed, The Flesh chastises The Man, but decides to give him another chance when The Man begs him to stay just as he is about to board a train back to Berlin. Returning to The Man's home, The Flesh ingests a large amount of alcohol and pills, then instructs The Man to castrate him with a kitchen knife, which The Man succeeds at doing. The two then fry and attempt to eat the severed penis, before The Flesh seemingly dies of blood loss in a bath The Man places The Flesh in.\nThe Man drags The Flesh's inert body (which vomits and defecates repeatedly) to a room he has readied for slaughter. Before he can begin taking The Flesh apart, The Man is shocked to discover The Flesh is still alive, so he stabs him in the throat. The Man then beheads, guts and dismembers The Flesh, buries the inedible parts, and cooks and eats the rest at a table which he places The Flesh's severed head at the end of. The Man then masturbates to video footage of what he has done, and leaves.","torrent":{"xt":"urn:btih:8a5aa06d875345e1483094e5f02027ad55114bbf","amp;dn":"Cannibal+-+Marian+Dora","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a5aa06d875345e1483094e5f02027ad55114bbf","infoHashBuffer":{"type":"Buffer","data":[138,90,160,109,135,83,69,225,72,48,148,229,240,32,39,173,85,17,75,191]},"announce":[],"urlList":[]}}