{"title":"Cooke-Dialogue&amp;Betrayal(Vatican christian charlatans)(1988)","uid":4645160,"size":191969,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ac80dd8309007b31d68ce16ab6b535b03baf3bb&amp;dn=Cooke-Dialogue%26Betrayal%28Vatican+christian+charlatans%29%281988%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"red_gonzo","files":1,"time":1231856140,"description":"This is Ronald Cooke's amazing book Dialogue and Betrayal (1988) which exposes various christian ecumenical movements as pure charlatans on the payroll of Vatican. This generation thrives on entertainment. The Christian &quot;gurus&quot; of our times have combined entertainment and their brand of religion to produce a lukewarm monstrosity which they dare to call the church. This religious nonentity then is set up as the norm for all Christians. From this religious conglomerate flows the highly praised moves of modern ecumenism such as the Promise Keepers, and those who recently signed their accord with Rome. When a faithful minister then tries to expose the rampant error in these modern ecumenical compromises he is called a hatemonger or worse. Sound doctrine is nowhere to be seen on the modern ecumenical landscape. In fact, it is almost unreal to listen to some men today as they exultantly cry out when they invite others to come to their ecumenical potpourri: &quot;people of all denominations and faiths are working together and doctrine is not important. So come and join with us.&quot; The fact that doctrine is not important is put forth as a plus instead of the gross minus which it really is. Such antics make the student of the Scriptures aware of just how little sound doctrine is out there today in the western world. The fact that sound doctrine can be jettisoned so exultantly is just another proof of the apostate condition of &quot;Christendom'' today. John Bunyan wrote that the reason antichrist came into the world was that the true church might be tried and made white by suffering under his tyranny and by bearing witness against his falsehoods. Antichristianity has certainly tyrannized for centuries and in some areas of the world still tries to tyrannize. However, Satan uses many devices to try to accomplish his ends; ecumenism is one of his main devices in this generation. The tragic thing today is that those who would class themselves as evangelicals have in many ways joined the bandwagon of ecumenism. The centerpiece of ecumenism is the Vatican which has three main elements going for it in its attempt to completely capture the visible &quot;church:&quot; attraction, substitution, and deception. Dialogue and Betrayal attempts to give the witness Bunyan spoke of against these three devices of the papacy today. 70 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:8ac80dd8309007b31d68ce16ab6b535b03baf3bb","amp;dn":"Cooke-Dialogue%26Betrayal%28Vatican+christian+charlatans%29%281988%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ac80dd8309007b31d68ce16ab6b535b03baf3bb","infoHashBuffer":{"type":"Buffer","data":[138,200,13,216,48,144,7,179,29,104,206,22,171,107,83,91,3,186,243,187]},"announce":[],"urlList":[]}}