{"title":"LizardSystems Find MAC Address Enterprise 5.0.157 Portable","uid":13708078,"size":913979,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8ad35a3e06eb371ddcf9b1d5555525f738209e64&amp;dn=LizardSystems+Find+MAC+Address+Enterprise+5.0.157+Portable&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jovo_bih","files":1,"time":1456844328,"description":"LizardSystems Find MAC Address Enterprise 5.0.157 Portable (Registered)\r\n\r\nRelease date: 29/02/2016\r\n\r\nFind MAC Address is a tool for finding the MAC address of computers on the network\r\n\r\nThis tool is an easy way to find the MAC address of a local or remote computer on the network. Select the target and method and find the MAC address of a remote computer on the network.\r\n\r\nWith Find MAC Address, you can find the MAC address of not only their local or remote computer, but also of any other computer that fits within the specified range of IP addresses. Unlike similar softwares, Find MAC Address can find the MAC addresses of computers using five methods (ARP, NetBios, NetAPI, WMI, SNMP).\r\n\r\nThe software can not only find the MAC address of a computer, but also lookup the manufacturer of its network card. After selecting one of the four methods and specifying the target, users will obtain all possible information about the MAC addresses. \r\n\r\nKey features\r\n\r\n- Getting the MAC address of the local computer.\r\n- Getting the MAC address of one remote computer either by its name or IP address.\r\n- Getting the MAC addresses of all computers on the network.\r\n- Getting the MAC addresses of all computers within the specified range of IP addresses.\r\n- Getting the MAC addresses of all computers from the specified computer list.\r\n- Five methods for finding MAC addresses (ARP, NetBIOS, NetAPI, WMI, SNMP).\r\n- Detecting the manufacturer of the network card by its MAC address.\r\n- Detecting the names of network cards (only if WMI or SNMP is used).\r\n- Searching the scan results.\r\n- Saving the scan results to and loading them from a file in the XML format.\r\n- Exporting the network scan results to text files or a Web document. \r\n\r\nHomepage http://lizardsystems.com/find-mac-address/","torrent":{"xt":"urn:btih:8ad35a3e06eb371ddcf9b1d5555525f738209e64","amp;dn":"LizardSystems+Find+MAC+Address+Enterprise+5.0.157+Portable","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ad35a3e06eb371ddcf9b1d5555525f738209e64","infoHashBuffer":{"type":"Buffer","data":[138,211,90,62,6,235,55,29,220,249,177,213,85,85,37,247,56,32,158,100]},"announce":[],"urlList":[]}}