{"title":"Who the Devil Made it? Peter Bogdanovich","uid":9711148,"size":3347825,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8bf51f2a9f261f6e14840814d66380187fa5b690&amp;dn=Who+the+Devil+Made+it%3F+Peter+Bogdanovich&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"tonythehorse","files":1,"time":1394114014,"description":"This was purchased as a DRM protected epub and has been converted to a pdf. I couldn't find it anywhere so thought I'd share. \n\nI first heard of the book when Quentin Tarantino mentioned it on Charlie Rose. He said after he read it, he got together with Bogdanovich to tell him he didn't feel like a professional director. Bogdanovich told him nobody does.\n\nFrom the Inside Flap:\n\nIn this fascinating chronicle of Hollywood and the grand art of making movies, Peter Bogdanovich--director, screenwriter, actor, and critic--interviews sixteen legendary directors of the first hundred years of film:\n\nRobert Aldrich  George Cukor  Allan Dwan  Howard Hawks  Alfred Hitchcock  Chuck Jones  Fritz Lang  Joseph H. Lewis  Sidney Lumet  Leo McCartey  Otto Preminger  Don Siegel  Josef von Sternberg  Frank Tashlin  Edgar G. Ulmer  Raoul Walsh\n\n\nFrom Roger Ebert: \n\n'In his introduction to ''Who the Devil Made It,'' Peter Bogdanovich remembers Orson Welles saying, ''You told me about all these old directors . . . people in Hollywood say are 'over the hill,' and it made me so sick, I couldn't sleep.'' It is a mark of his humanity that Mr. Bogdanovich -- even in his glory years in the 1970's when ''The Last Picture Show'' received eight Oscar nominations and ''What's Up, Doc?'' was a blockbuster -- cared passionately about those ''old directors'' and was sometimes the only active industry figure who still sought them out.\n\nThis is a huge and valuable book, a collection of interviews that Mr. Bogdanovich has conducted since 1960 with 16 great Hollywood directors. For many, it was their last chance to leave a record: Leo McCarey was dying of emphysema, Raoul Walsh and Fritz Lang were blind, Alfred Hitchcock was near the end and drinking heavily. Mr. Bogdanovich includes everything: history, technique, gossip, minutiae. This book is also a form of autobiography: we're told of the card file Mr. Bogdanovich kept from age 12 to 30, recording 3,661 films, 1,066 of them seen at least twice.\n\nThe movies are so young that until recently their origins were held in living memory. Allan Dwan, born in 1885 and the oldest of the directors here, invented the mercury vapor lamps that replaced klieg lights and their clouds of carbon dust. He recalls filming while hiding from the posses of competitors. ''They sent snipers out with long-range rifles,'' Dwan told Mr. Bogdanovich, but nobody ever got killed. ''They always shot at the cameras.''\n\nMr. Bogdanovich's other subjects also claim to have made history. ''Did you know that I invented the countdown?'' Fritz Lang asked. He said that when he filmed a rocket takeoff in ''Woman in the Moon,'' he realized that ''if I count one, two, three, four . . . an audience doesn't know when it will go off. But if I count down . . . five, four, three, two, one, ZERO -- then they will know.'' And here is Leo McCarey, who directed at least 100 Laurel and Hardy pictures, responding to Mr. Bogdanovich's suggestion that he was instrumental in shaping their personas: ''I feel I had a lot to do with it, but modesty prevents me from saying that I gave them their breath and blood.'' Josef von Sternberg has no modesty at all: ''Miss Dietrich is me -- I am Miss Dietrich.''\n\nIn the book's most bizarre story, McCarey tells of piecing together an ending for ''My Son John.'' The film's star, Robert Walker, tape-recorded a big speech on a Saturday and then died over the weekend. The tape enabled McCarey to finish the picture by having the Walker character tell the F.B.I. that ''he was coming over with a confession that he had recorded.'' Next, McCarey wrote a death scene, and asked Alfred Hitchcock for help. Hitchcock found a piece of film from ''Strangers on a Train'' showing Walker dead under a merry-go-round; McCarey removed the merry-go-round and matted the shot into the wreckage of a taxicab. The movie, he cheerfully recalled, received an Oscar nomination for best screenplay.\n\nPerformers in the earliest days were mostly actors who had failed elsewhere. ''No self-respecting actor would come near us at first,'' Dwan remembered. But the movies quickly turned actors into stars. ''You realize the greatest stars in the picture business were made during an era when they didn't have one single thing to say about what they did,'' Howard Hawks tells Mr. Bogdanovich. Hitchcock famously storyboarded every scene without consulting his actors: ''I didn't enjoy working with Montgomery Clift. . . . I asked him to look up, so that I could cut to his point of view of the building across the street. He said, 'I don't know if I would look up.' Well, imagine.''\n\nThe book includes first-person accounts of famous Hollywood anecdotes. Raoul Walsh tells of stealing John Barrymore's body from a morgue and leaving it for a drunken Errol Flynn to discover on his couch. With an empty eye socket, Walsh had little sympathy for John Ford's complaints about his own bad eye: ''I picked up my fork and I says, 'Well, come on, Jack, let me pop it out for you and then you'll be O.K.' '' And Hawks was an eyewitness to the famous meeting of Clark Gable and William Faulkner on a hunting trip. Gable asked Faulkner to name his favorite authors. Faulkner included himself. ''Gable said, 'Oh, do you write, Mr. Faulkner?' And Bill said, 'Yes. And what do you do, Mr. Gable?' ''\n\nHawks, the architect of some of the greatest screen personas, remembers telling Humphrey Bogart his idea for the unknown model who would become Lauren Bacall: ''We are going to try an interesting thing. You are about the most insolent man on the screen and I'm going to make the girl a little more insolent than you are.'' Of Jane Russell and Marilyn Monroe, he says flatly: ''Neither of them were very sexy in real life. . . . Monroe couldn't get anybody to take her out -- nobody.''\n\nBut George Cukor understood Monroe's appeal. Talking about censorship, he says: ''I'll tell you what they cannot censor: thought. . . . And that's what I think of all the great ones: I mean Elvis Presley -- whom I consider great -- and Marilyn Monroe; their brains were uncensored. They could imagine all kinds of things and there was really nothing immoral about it.''\n\nSome of the most harrowing stories in the book involve great movies that were nearly ruined. Hitchcock on David O. Selznick's idea for the last shot in ''Rebecca'': ''He wanted the house to go up in flames, and for the smoke to form the letter R!'' And Otto Preminger recalls how Darryl F. Zanuck changed the ending of ''Laura'' until Walter Winchell, of all people, intervened to change it back.\n\nMany readers will not have heard of a lot of the films discussed, but the stories stand on their own. They are an oral history of an art form created out of pragmatism, experimentation, instinct and luck. Lurking beneath was the soul of the individual film maker. As Howard Hawks says to Mr. Bogdanovich about his favorite directors, ''I liked almost anybody that made you realize who in the devil was making the picture.''","torrent":{"xt":"urn:btih:8bf51f2a9f261f6e14840814d66380187fa5b690","amp;dn":"Who+the+Devil+Made+it%3F+Peter+Bogdanovich","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bf51f2a9f261f6e14840814d66380187fa5b690","infoHashBuffer":{"type":"Buffer","data":[139,245,31,42,159,38,31,110,20,132,8,20,214,99,128,24,127,165,182,144]},"announce":[],"urlList":[]}}