{"title":"Buzz Concurso De Bolsillo[EUR][MULTi2][PSP].ISO","uid":4330029,"size":1501067264,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:8c6bbf8d795d2df8d0b6a83520a715470ce7f797&amp;dn=Buzz+Concurso+De+Bolsillo%5BEUR%5D%5BMULTi2%5D%5BPSP%5D.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":1,"time":1217989701,"description":" DescripciÃƒÂ³n\n\nMiles de preguntas sobre mÃƒÂºsica, famosos, televisiÃƒÂ³n, deportes, ciencia, naturaleza, pelÃƒÂ­culas y conocimientos generales; todo en tu PSP. Buzz!: Concurso de Bolsillo se ha creado especialmente para PSP, con seis rondas nuevas, entre las que encontrarÃƒÂ¡s: Apunta y dispara, donde la clave es la velocidad; Imagina, el rompecabezas con imÃƒÂ¡genes; y DesafÃƒÂ­o vÃƒÂ­rico, que te dejarÃƒÂ¡ boquiabierto. Puedes jugar hasta con seis amigos en un solo sistema PSP en el modo PÃƒÂ¡sala. AdemÃƒÂ¡s del concurso habitual, en algunas rondas podrÃƒÂ¡s sacar partido de los puntos dÃƒÂ©biles de tus rivales cuando decidas a quiÃƒÂ©n se la pasas teniendo en cuenta el tema de la pregunta. En otro sorprendente modo multijugador, Ronda final, aspirarÃƒÂ¡s al trono de Buzz y tomarÃƒÂ¡s las riendas del juego, seleccionando las preguntas y otorgando puntos. TambiÃƒÂ©n se pueden usar varios sistemas PSP. Solo necesitas una copia del juego para divertirte con hasta cuatro amigos en Compartir juego. Buzz!: Concurso de Bolsillo tambiÃƒÂ©n presenta partidas para un jugador con 15 desafÃƒÂ­os diferentes diseÃƒÂ±ados para poner a prueba tu cultura general en todos los ÃƒÂ¡mbitos.\nOtras CaracterÃƒÂ­sticas\n\nDisfruta de las opciones multijugador con tres modos nuevos. Para jugar se necesita un solo sistema PSP o una sola copia del juego. Pon a prueba tus conocimientos en el amplio modo para un jugador, Ã‚Â¿estÃƒÂ¡s a la altura de los desafÃƒÂ­os de Buzz? Con mÃƒÂ¡s de 3000 preguntas, ilustradas con mÃƒÂ¡s de 1000 imÃƒÂ¡genes y vÃƒÂ­deos, hay para todos en Buzz!: Concurso de Bolsillo.\n","torrent":{"xt":"urn:btih:8c6bbf8d795d2df8d0b6a83520a715470ce7f797","amp;dn":"Buzz+Concurso+De+Bolsillo%5BEUR%5D%5BMULTi2%5D%5BPSP%5D.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c6bbf8d795d2df8d0b6a83520a715470ce7f797","infoHashBuffer":{"type":"Buffer","data":[140,107,191,141,121,93,45,248,208,182,168,53,32,167,21,71,12,231,247,151]},"announce":[],"urlList":[]}}