{"title":"Live From New York - Tom Shales.epub","uid":6813483,"size":1143473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d7aa7f6421e1d83862d2ec3e81f0bfb6d86efe8&amp;dn=Live+From+New+York+-+Tom+Shales.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jakcreed2","files":1,"time":1321113633,"description":"WHEN A YOUNG WRITER named Lorne Michaels talked NBC executives into taking a chance on a new weekend late-night comedy series, nobody really knew what to expect-not even Michaels. But Saturday Night Live, launched in 1975 and still thriving today, would change the face of television. It introduced brash new stars with names like Belushi, Radner, Chase, and Murray; trashed taboos that had inhibited TV for decades; and had such an impact on American life, laughter, and politics that even presidents of the United States had to take notice. Now, Pulitzer Prize-winner Tom Shales and bestselling author James Andrew Miller bring together stars, writers, guest hosts, contributors, and craftsmen for the first-ever oral history of Saturday Night Live, from 1974, when it was just an idea, through 2002, when it has long since become an institution. In their own words, dozens of personalities recall the backstage stories, behind-the-scenes gossip, feuds, foibles, drugs, sex, struggles, and calamities, including personal details never before revealed. Shales and Miller have interviewed a galaxy of stars, including Mike Myers, Chris Rock, Bill Murray, Tom Hanks, Adam Sandler, Chevy Chase, Will Ferrell, Dan Aykroyd, Steve Martin, Jon Lovitz, Jane Curtin, Billy Crystal, Martin Short, Dana Carvey, Tina Fey, Jimmy Fallon, Chris Kattan, Julia Louis-Dreyfus, Garrett Morris, Molly Shannon, Damon Wayans, Chris Elliott, Julia Sweeney, Norm Macdonald, and Paul Simon-plus writers like Al Franken, Conan O'Brien, Larry David, Rosie Shuster, Jack Handey, Robert Smigel, Don Novello, and others who got their big breaks as part of the SNL team. The Coneheads, the Blues Brothers, Buck-wheat, Wayne and Garth, Hans and Franz, the Cheerleaders, Todd DiLaMuca and Lisa Loopner, &quot;Cheeseburger cheeseburger,&quot; Mango, the Church Lady, Ed Grimley-they're all here. And for every fabulous character on-screen there was an outrageous maverick, misfit, or rebel behind the scenes. Live from New York does what no other book about the show has ever done: It lets the people who were there tell the story in their own words, blunt and loving and uncensored.\nEnjoy and seed","torrent":{"xt":"urn:btih:8d7aa7f6421e1d83862d2ec3e81f0bfb6d86efe8","amp;dn":"Live+From+New+York+-+Tom+Shales.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d7aa7f6421e1d83862d2ec3e81f0bfb6d86efe8","infoHashBuffer":{"type":"Buffer","data":[141,122,167,246,66,30,29,131,134,45,46,195,232,31,11,251,109,134,239,232]},"announce":[],"urlList":[]}}