{"title":"Security in an IPv6 Environment","uid":4818730,"size":6626086,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d7b7df41948bcda7000b9692bac10ce3a8c68ae&amp;dn=Security+in+an+IPv6+Environment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1238657794,"description":"Analyze Key Security Mechanisms and Approaches with this practical primer, the first book on the market to cover critical IPv6 security considerations.\n\nDan Minoli, author of over 50 books on telecommunications and networks, and Jake Kouns, Chairman, CEO and CFO of the Open Security Foundation, discuss IPv6 security vulnerabilities, considerations, and mechanisms, and survey approaches for ensuring reliable and controlled IPv6 migration. The authors pool knowledge from industry resources, RFCs, and their own considerable security experience, discussing key IPv6 features, security issues, and potential exploitation of IPv6 protocol. They examine use of firewalls and encryption, and the fundamental topic of IPSec in IPv6 environments.\n\nProtect Networks from New and Growing Threats\n\nAn increasing amount of mission-critical commercial and military operations are supported by distributed, mobile, always-connected, hybrid public-private networks, especially IPv6-based networks. The number of attackers or inimical agents continues to grow, and all computing environments must feature high-assurance security mechanisms. Even administrators in pure IPv4 environments require at least a rudimentary understanding of IPv6 security principles to safeguard traditional networks. This comprehensive book explains why security savvy approaches are indispensible and includes considerations for mixed IPv4 and IPv6 migration environments. More than an exhaustive treatment of IPv6 and security topics, this text is a point of departure for anyone adjusting to this technological transition and subtending security considerations.\n","torrent":{"xt":"urn:btih:8d7b7df41948bcda7000b9692bac10ce3a8c68ae","amp;dn":"Security+in+an+IPv6+Environment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d7b7df41948bcda7000b9692bac10ce3a8c68ae","infoHashBuffer":{"type":"Buffer","data":[141,123,125,244,25,72,188,218,112,0,185,105,43,172,16,206,58,140,104,174]},"announce":[],"urlList":[]}}