{"title":"Twain, Mark - Autobiography of Mark Twain, Vol. 1","uid":6123055,"size":10227764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8da1011db47e3d4cefe3cad862dae4bcd3e7a7a2&amp;dn=Twain%2C+Mark+-+Autobiography+of+Mark+Twain%2C+Vol.+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"phreak33","files":-1,"time":1295826190,"description":"eBook in 2 formats. epub, pdf\n\n\nReview\n&quot;Dip into the first enormous volume of Twain's autobiography that he had decreed should not appear until 100 years after his death. And Twain will begin to seem strange again, alluring and still astonishing, but less sure-footed, and at times both puzzled and puzzling in ways that still resonate with us, though not the ways we might expect.&quot;--New York Times\n\n&quot;This is a book for dipping, not plunging. Read, as Twain might put it, until interest pales, and then jump. It feels like a form of time travel.&quot;--New York Times/The Opinion Pages\n\n&quot;Twain generously provides the 21st century aficionado a marvelous read. His crystalline humor and expansive range are a continuous source of delight and awe. . . . [He] has given us 'an astonishment' in his autobiography with his final, beautifully unorganized genius and intemperate thoughts. Pull up a chair and revel.&quot;--Los Angeles Times Book Review\n\n&quot;Twain's autobiography, finally available after a century, is a garrulous outpouring--and every word beguiles.&quot;--Wall Street Journal\n\n&quot;Promises a no-holds barred perspective on Twain's life, and will be rich with rambunctious, uncompromising opinions.&quot;--Herald Scotland\nProduct Description\n&quot;I've struck it!&quot; Mark Twain wrote in a 1904 letter to a friend. &quot;And I will give it away--to you. You will never know how much enjoyment you have lost until you get to dictating your autobiography.&quot; Thus, after dozens of false starts and hundreds of pages, Twain embarked on his &quot;Final (and Right) Plan&quot; for telling the story of his life. His innovative notion--to &quot;talk only about the thing which interests you for the moment&quot;--meant that his thoughts could range freely. The strict instruction that many of these texts remain unpublished for 100 years meant that when they came out, he would be &quot;dead, and unaware, and indifferent,&quot; and that he was therefore free to speak his &quot;whole frank mind.&quot; The year 2010 marks the 100th anniversary of Twain's death. In celebration of this important milestone and in honor of the cherished tradition of publishing Mark Twain's works, UC Press is proud to offer for the first time Mark Twain's uncensored autobiography in its entirety and exactly as he left it. This major literary event brings to readers, admirers, and scholars the first of three volumes and presents Mark Twain's authentic and unsuppressed voice, brimming with humor, ideas, and opinions, and speaking clearly from the grave as he intended. ","torrent":{"xt":"urn:btih:8da1011db47e3d4cefe3cad862dae4bcd3e7a7a2","amp;dn":"Twain%2C+Mark+-+Autobiography+of+Mark+Twain%2C+Vol.+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8da1011db47e3d4cefe3cad862dae4bcd3e7a7a2","infoHashBuffer":{"type":"Buffer","data":[141,161,1,29,180,126,61,76,239,227,202,216,98,218,228,188,211,231,167,162]},"announce":[],"urlList":[]}}