{"title":"The Aquabats! Super Show! Season 1","uid":7378476,"size":3835237110,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8e8b35b80dba080f9ce8df156b736deef7e7acbb&amp;dn=The+Aquabats%21+Super+Show%21+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CadetJay","files":-1,"time":1340434602,"description":"Here it is on TPB, the entire first season of The Aquabats! Super Show! Go forth, Aquacadets, and spread The Aquabats! to as many of the uninitiated as possible! Then buy some Aquabats merchandise and attend one of their concerts! The world NEEDS The Aquabats!, so seed for as long as possible!\n\n\nDetails:\n\nHeight and Width: 480 x 854 pixels\nQuality: The episodes were taken off iTunes and then stripped of their DRM, so while it's not HD, the quality is still pretty good.\n\nDescription off Wikipedia:\n\n&quot;The Aquabats! Super Show! is an American action-comedy television series which premiered on March 3, 2012 on the United States cable network The Hub. The series was created by Christian Jacobs and Scott Schultz, both the creators of the Nick Jr. series Yo Gabba Gabba!, and Jason deVilliers.\nA mix of live-action and animation, The Aquabats! Super Show! is based on the superhero mythology of The Aquabats, a real-life Californian rock band which series co-creator Jacobs fronts. Styled similarly to the campy aesthetic of the 1960s Batman series, each episode follows the comic adventures of The Aquabats, a musical group of amateur superheroes, as they continually defend the world from a variety of villains and monsters.&quot;","torrent":{"xt":"urn:btih:8e8b35b80dba080f9ce8df156b736deef7e7acbb","amp;dn":"The+Aquabats%21+Super+Show%21+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e8b35b80dba080f9ce8df156b736deef7e7acbb","infoHashBuffer":{"type":"Buffer","data":[142,139,53,184,13,186,8,15,156,232,223,21,107,115,109,238,247,231,172,187]},"announce":[],"urlList":[]}}