{"title":"The Eye From Which Nothing is Hidden","uid":10535470,"size":1102897,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8eeaf88d42ab7d24d36705ac663ccf8fe62a740c&amp;dn=The+Eye+From+Which+Nothing+is+Hidden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"storm45","files":2,"time":1405162192,"description":"The scope of this work is immense. It includes not only a detailed, subjective report of very advanced states of spiritual consciousness traditionally called enlightenment, but, for the first time, correlates and recontextualizes spiritual information in such a manner as to make it comprehensible to reason and the intellect.\nThis correlation between science and spirituality represents a cohesive integration between the linear and the nonlinear dimensions. By &quot;transcending the opposites&quot;, the author resolves the ages-old, seemingly irresolvable conflict and impasse between science and religion, between materiality and spirituality, and between ego and spirit. This resolution then clarifies unresolved mysteries and dilemmas which have been with mankind throughout history. With the expansion of consciousness afforded by this work, questions answer themselves and truth becomes self-evident.\nThe style of presentation takes the reader back and forth from the linear to the nonlinear domains until, to one's surprise, the incomprehensible becomes not only comprehensible but actually obvious.\nThe calibrated level of consciousness of those who have been exposed to this material has been experimentally documented and has shown considerable elevation and advancement. Power accomplishes without effort what force cannot do for it goes where force cannot follow.\nThis book is written for both the self and the Self of the reader. Although the traditional great obstacle to enlightenment called &quot;transcending the opposites of duality and nonduality&quot; may sound obscure, by the time one has finished the book, this critical awareness is self-resolving.","torrent":{"xt":"urn:btih:8eeaf88d42ab7d24d36705ac663ccf8fe62a740c","amp;dn":"The+Eye+From+Which+Nothing+is+Hidden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8eeaf88d42ab7d24d36705ac663ccf8fe62a740c","infoHashBuffer":{"type":"Buffer","data":[142,234,248,141,66,171,125,36,211,103,5,172,102,60,207,143,230,42,116,12]},"announce":[],"urlList":[]}}