{"title":"Great Books. Part Two.","uid":9628204,"size":252981678,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fd45239e7d3f9e973e51f8dea6f4d07e46478c3&amp;dn=Great+Books.+Part+Two.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tscosj","files":51,"time":1392629609,"description":"We need to take information, wherever it is stored, make our copies and share them with the world. We need to take stuff that's out of copyright and add it to the archive. We need to buy secret databases and put them on the Web. We need to download scientific journals and upload them to file sharing networks. We need to fight for Guerilla Open Access.\n---\nAaron Swartz\nJuly 2008, Eremo, Italy\n\n\n---\n\nI'm doing all this stuff under the idea from Guerilla Open Access Manifesto. \n\nR.I.P Swartz!\n\n\nLIST:\n\n1. Adam Feinstein Pablo Neruda- A Passion for Life  2004.epub\n2. Bertolt Brecht Der Gute Mensch von Sezuan Twentieth Century Texts  1986.pdf\n3. Bertolt Brecht Der Kaukasische Kreidekreis  GERMAN  1998.pdf\n4. Bertolt Brecht Geschichten vom Herrn Keuner  1971.pdf\n5. Bertolt Brecht, Reinhold Grimm editor Poetry and Prose Bertolt Brecht  2003.djvu\n6. Christopher Innes The Cambridge Companion to George Bernard Shaw Cambridge Companions to Literature  1998.pdf\n7. David Cannadine Admiral Lord Nelson His Context and Legacy  2005.pdf\n8. David Cannadine Making History Now and Then Discoveries, Controversies and Explorations  2008.pdf\n9. David Cannadine The Undivided Past- Humanity Beyond Our Differences  2013.epub\n10. David Cannadine What Is History Now  2002.pdf\n11. David Cannadine, David Reeder Exploring the Urban Past Essays in Urban History by H. J. Dyos  1982.pdf\n12. Dr. Azher Suleiman Henrik Ibsen  .pdf\n13. Dr.Azher Suleiman George Bernard Shaw  .pdf\n14. Einar Haugen Ibsens Drama author to audience  1979.pdf\n15. Franz-Josef Payrhuber LektuÌˆreschluÌˆssel Bertolt Brecht - Leben des Galilei  2002.pdf\n16. Gareth Griffith Socialism and Superior Brains The Political Thought of George Bernard Shaw  1992.pdf\n17. George Bernard Shaw Major Barbara Websters German Thesaurus Edition  2006.pdf\n18. George Bernard Shaw,   John A. Bertolini Pygmalion and Three Other Plays (Barnes &amp; Noble Classics Series)  Â   .epub\n19. Gilberto Freyre Casa-Grande y Senzala  .pdf\n20. Gilberto Freyre The Masters and the Slaves (Casa-Grande &amp; Senzala)- A Study in the Development of Brazilian Civilization    1986.pdf\n21. Harold Bloom George Bernard Shaw Blooms Modern Critical Views  2010.pdf\n22. Henrik Ibsen Hedda Gabler  2005.pdf\n23. Henrik Ibsen The Dolls House Websters German Thesaurus Edition  2006.pdf\n24. Henrik Ibsen The Works of Henrik Ibsen  2004.pdf\n25. Irina Ruppo Malone Ibsen and the Irish Revival  2010.pdf\n26. Ivan Turgenev Home of the Gentry  .pdf\n27. Ivan Turgenev Virgin Soil  2003.pdf\n28. Ivan Turgenev, Michael R. Katz Translator Fathers and Sons Norton Critical Editions  1995.pdf\n29. James McFarlane The Cambridge Companion to Ibsen Cambridge Companions to Literature  1994.pdf\n30. James Nolan Poet-Chief The Native American Poetics of Walt Whitman and Pablo Neruda  1994.epub\n31. Maxim Gorky And the Others  .pdf\n32. Maxim Gorky Creatures That Once Were Men  0.pdf\n33. Maxim Gorky The City of the Yellow Devil Pamphlets, Articles and Letters About America 1906  1977.pdf\n34. Meg Mumford Bertolt Brecht  2009.pdf\n35. Mikhail Sholokhov And Quiet Flows the Don  1967.pdf\n36. Noorbakhsh Hooti.pdf\n37. Pablo Neruda , Ben Belitt Selected Poems of Pablo Neruda [Bilingual Edition]  1961.pdf\n38. Pablo Neruda Canto General  1976.pdf\n39. Pablo Neruda The Book of Questions    1991.pdf\n40. Pablo Neruda The Captains Verses Love Poems New Directions Books  2009.pdf\n41. Pablo Neruda, Rene de Costa The Poetry of Pablo Neruda  1982.pdf\n42. T. C. W. Blanning, David Cannadine History and Biography Essays in Honour of Derek Beales  1996.pdf\n43. Tovah Yedlin Maxim Gorky A Political Biography  .pdf\n44. Vladimir Mayakovsky Mayakovsky Poems  1965.pdf\n45. Vladimir Mayakovsky Mayakovsky- Selected Verse (Volume 1)  1985.pdf\n46. Vladimir Mayakovsky What Shall I Be  1981.pdf\n47. WacÅ‚aw Lednicki (auth.) Bits of Table Talk on Pushkin, Mickiewicz Goethe, Turgenev and Sienkiewicz  1956.pdf\n48. Wilhelm Grosse, Bertolt Brecht ErlaÌˆuterungen Zu Bertolt Brecht, Leben Des Galilei  2008.pdf\n49. WILLIAM A. JOHNSEN Violence and Modernism Ibsen, Joyce, and Woolf  2003.pdf\n50. William Trevor Two Lives- Reading Turgenev &amp; My House in Umbria    2004.epub\n\n---\n\nThanks for all who gave me a feedbacks! I appreciate it :)\n\nP.S. Most books of Bertolt Brecht in original, a few not. There are some books about authors that will be interesting. Enjoy! If you have questions, don't hesitate to ask. ","torrent":{"xt":"urn:btih:8fd45239e7d3f9e973e51f8dea6f4d07e46478c3","amp;dn":"Great+Books.+Part+Two.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fd45239e7d3f9e973e51f8dea6f4d07e46478c3","infoHashBuffer":{"type":"Buffer","data":[143,212,82,57,231,211,249,233,115,229,31,141,234,111,77,7,228,100,120,195]},"announce":[],"urlList":[]}}