{"title":"Data Compression: The Complete Reference - 4th Edition","uid":12373807,"size":7563580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:922d2719a6b7425c5188239bf351e586baaea63f&amp;dn=Data+Compression%3A+The+Complete+Reference+-+4th+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Roqwell","files":1,"time":1441679993,"description":"Please seed if you enjoy this awesome book!\n &lt;a href=&quot;\nhttp://www.davidsalomon.name/DC4advertis/DComp4Ad.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.davidsalomon.name/DC4advertis/DComp4Ad.html&lt;/a&gt;\n\n\nThis edition of the book has the same chapters as the 3rd edition, with the following new topics added:\n\n1. RAR. This proprietary algorithm employs a checksum for increased reliability. It has recently become popular, and its main features (provided by its originator, Eugene Roshal) are described.\n\n2. FLAC (free, lossless audio compression). This is relatively new, free, not as good as mp3, but offers higher quality. Some documentation is available at &quot;http://flac.sourceforge.net/documentation.html&quot; and more was obtained from Josh Coalson, FLAC's developer.\n\n3. Advanced Audio Coding, AAC. This is an extension of mp3 and is also referred to as mp4. Contrary to popular belief, AAC does not stand for Apple Audio Compression.\n\n4. Tunstall code. This is a variation on variable-size, prefix codes.\n\n5. Differential compression (written by Giovanni Motta). Given a file before and after editing, encode just the differences between the files. This boils down to the principle of editing. Editing data is done by inserting, deleting, or modifying items. Thus, encoding the differences between files amounts to creating a sequence of symbols C, I, and D (for copy, insert, delete). A given string can be changed to another string by a sequence of C, I, and D commands. This is referred to as Edit Distance.\n\n6. WavPack, by David Bryant (who also wrote this section in the book). This is a complex, lossy/lossless audio compression algorithm and software that features several modes and a novel entropy encoder.\n\n7. LZMA, see http://www.7-zip.org/7z.html. This is a sophisticated dictionary compression method developed by Igor Pavlov, who provided me with much information.\n\n8. ALS. This is the audio lossless coding algorithm used in MPEG-4.\n\n9. H.264 is an advanced video codec, part of the huge MPEG-4 project.\n\n10. Dolby AC3. AC-3, also known as Dolby Digital, stands for Dolby's third-generation audio coder. AC-3 is a perceptual audio codec based on the same principles as the three MPEG-1/2 layers and AAC.\n\n11. Hyperspectral compression (partially written by Giovanni Motta). Each data item is an array. Examples are (1) a hyperspectral image. Each pixel consists of hundreds of numbers, each the intensity of the pixel at a given frequency. (2) weather data from many stations. Each station has two coordinates (longitude, latitude) and the data is an array of temperatures, air pressure, or precipitation).\n\n12. Monkey's audio. Monkey's audio is a fast, efficient, free, lossless audio compression algorithm and implementation that offers error detection, tagging, and external support.\n\n13. Recursive range reduction (3R). This is a simple coding algorithm due to Yann Guidon that offers decent compression, is easy to program, and its performance is independent of the amount of data to be compressed (see the auxiliary material at the end of this page).\n\n14. PDF. This is a common file format that uses both text and image compression. The compression algorithms used by PDF are not proprietary and most are already described in the book.\n\n\nA review:\n\nOverall, the book is an excellent reference on compression principles and methods for anyone with a general background in signal processing or computer science. Like its previous three editions this book can be expected to become popular among those who have an interest in data compression.\n - IEEE Signal Processing Magazine, March 2008, page 147.\n\n\nQuotation:\n\n&quot;You can't just start a new project in Visual Studio/Delphi/whatever, then add in an ADPCM encoder, the best psychoacoustic model, some DSP stuff, Levinson Durbin, subband decomposition, MDCT, a Blum-Blum-Shub random number generator, a wavelet-based brownian movement simulator and a Feistel network cipher using a cryptographic hash of the Matrix series, and expect it to blow everything out of the water, now can you?&quot;\n - (Anonymous)","torrent":{"xt":"urn:btih:922d2719a6b7425c5188239bf351e586baaea63f","amp;dn":"Data+Compression%3A+The+Complete+Reference+-+4th+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"922d2719a6b7425c5188239bf351e586baaea63f","infoHashBuffer":{"type":"Buffer","data":[146,45,39,25,166,183,66,92,81,136,35,155,243,81,229,134,186,174,166,63]},"announce":[],"urlList":[]}}