{"title":"Hip Hop Collection - Beyond Beats and Rhymes","uid":7556395,"size":3069130752,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:93695f239d5745841423f6ad9283b9d9af88345e&amp;dn=Hip+Hop+Collection+-+Beyond+Beats+and+Rhymes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GRNS3","files":-1,"time":1345624735,"description":"\nThe Hip Hop Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :)\n\n\nHip-Hop: Beyond Beats and Rhymes is a 2006 documentary film written, produced, and directed by Byron Hurt. The documentary explores the issues of masculinity, violence, homophobia and sexism in hip hop music and culture, through interviews with artists, academics and fans. Hurt's activism in gender issues and his love of hip-hop caused him to feel what he described as a sense of hypocrisy, and began working on the film. The premiere of the film took place at the Sundance Film Festival, being welcomed by a standing ovation. It has also won Best Documentary at the San Francisco Black Film Festival and the Audience Award at the Roxbury Film Festival. On February 20, 2007 the film aired on the PBS Emmy-winning documentary series, Independent Lens.\nThe film features interviews with many hip-hop artists including Busta Rhymes, Chuck D, Clipse, Doug E. Fresh, Fat Joe, Jadakiss, M-1, Mos Def, and Talib Kweli. Hip-Hop: Beyond Beats and Rhymes also features academics such as Dr. James Peterson of Pennsylvania State University, Professor William Jelani Cobb of Spelman College and Michael Eric Dyson of the University of Pennsylvania. Activists, journalists and poets such as Kevin Powell and Sarah Jones are also interviewed.\n","torrent":{"xt":"urn:btih:93695f239d5745841423f6ad9283b9d9af88345e","amp;dn":"Hip+Hop+Collection+-+Beyond+Beats+and+Rhymes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93695f239d5745841423f6ad9283b9d9af88345e","infoHashBuffer":{"type":"Buffer","data":[147,105,95,35,157,87,69,132,20,35,246,173,146,131,185,217,175,136,52,94]},"announce":[],"urlList":[]}}