{"title":"Untitled.2007.{Korn}full.album","uid":3845680,"size":77351104,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:947127756986a093775b10b825080b7f6a9c6a66&amp;dn=Untitled.2007.%7BKorn%7Dfull.album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uncommon.muse","files":13,"time":1192579325,"description":"The untitled[1] eighth studio album by Korn was released in the United States on July 31, 2007, through Virgin Records. The standard edition holds 13 tracks.The disc was intentionally released without a title, in what vocalist Jonathan Davis reasons as &quot;why not just let our fans call it whatever they wanna call it?&quot;\n\nThe untitled affair was the second studio album without former guitarist Brian &quot;Head&quot; Welch as well as the second studio disc to be co-written and produced by Atticus Ross and The Matrix. The album has been described as more atmospheric, heavy, and at times, progressive. Davis comments that the disc draws from influences by The Cure and The Beatles. It&amp;#039;s also the first album to not feature the group&amp;#039;s founding drummer David Silveria.\nMusical style\n\n&quot;We always wanted the atmospheres, and to really go deep,&quot; guitarist James &quot;Munky&quot; Shaffer told Billboard. &quot;It wasn&amp;#039;t until this record that we really felt comfortable to do that. As records progress, the urge to do that becomes greater. We feel like we&amp;#039;ve finally solidified ourselves in the rock world, and wanted to take this one a little deeper into that direction. It&amp;#039;s less pop, and it&amp;#039;s more experimental.&quot; Guitarist Munky said of the songs, &quot;I don&amp;#039;t want to say that it&amp;#039;s heavy, because that pisses the other band members off. It&amp;#039;s still the Korn sound, but it&amp;#039;s also very atmospheric.&quot;[3]\n\n[edit] Song rationales\n\n    * &quot;Starting Over&quot; ? A song where Jonathan Davis channels all of his feelings about the battles he&amp;#039;s overcome in the past few years: alcohol addiction, drug dependency, and a near-fatal blood disease. &quot;The album opens with the seemingly straightforward rocker &quot;Starting Over,&quot; but more than halfway through, the guitars drop and give way to a dreamy, psychedelic bridge, only to have the verses resurrected by gospel-inspired keys.&quot;[4]\n\n    * &quot;Bitch We Got a Problem&quot; ? Billboard journalist Todd Martens compares the song to &quot;Do What They Say&quot; as also sporting an almost dance vibe and industrial grooves.[4]\n\n    * &quot;Evolution&quot; ? Described by Jonathan as &quot;addressing global climate issues.&quot; Jonathan said, &quot;It&amp;#039;s not political Al Gore shit. I&amp;#039;m just wondering, are my kids&amp;#039; kids going to have a place to live?&quot; The song was also released as the lead single from the album.\n\n    * &quot;Kiss&quot; ? One of guitarist Munky&amp;#039;s favorite tracks on the new album. &quot;It has piano in it, and there&amp;#039;s a very melancholy tone to it,&quot; he describes the song. Billboard journalist Todd Martens comments the song has The Beatles&amp;#039; &quot;Strawberry Fields&quot; tones to it.[4]\n\n    * &quot;Do What They Say&quot; ? Billboard journalist Todd Martens comments the song &quot;sports almost dance-y, industrial grooves&quot; Jonathan Davis has also stated that this is his favorite song Korn has ever made. [4]\n\n    * &quot;Ever Be&quot; ? Munky describes the song as having &quot;this epic ending to it ? like, imagine 300 set to song.&quot;\n\n    * &quot;Love and Luxury&quot; ? Davis again addresses the departure of ex-guitarist Brian &quot;Head&quot; Welch. In an interview with Billboard.com, Davis says, &quot;I had to vent, it really irritated me that he&amp;#039;s putting out this book and profiting off of talking shit about us -- the guys who gave him everything in his life and put him where he&amp;#039;s at. If you don&amp;#039;t want to be in the band, fine, but don&amp;#039;t go out bad mouthing us.&quot; The intro of the song directly references Welch&amp;#039;s autobiography &quot;Save Me From Myself&quot;: &quot;I read your little book and, ha ha ha ha.&quot; [4]\n\n    * &quot;Innocent Bystander&quot; ? Features &quot;a little solo&quot; according to Munky.\n\n    * &quot;Killing&quot; ? Originally titled &quot;Trained Response&quot;. Features a more complex riff than Korn has been used to write. &quot;It&amp;#039;s a hard riff to play, and if you keep playing it for an hour, your arm hurts,&quot; Munky explained. &quot;[Frontman Jonathan Davis] was in writing the song with us, so he&amp;#039;s the one who came up with the riff ? because he&amp;#039;s not used to playing hours on end. He was kind of the second guitar player, filling in the blanks for me.&quot;\n\n    * &quot;Hushabye&quot; ? Shaffer plays a &quot;reverb-y&quot; mandolin. The definition of a hushabye is a lullaby used to soothe or lull babies to sleep.\n\n    * &quot;I Will Protect You&quot; ? Features an electronic bagpipe intro played by Jonathan Davis and a very progressive middle section showcasing Bozzio&amp;#039;s drumming.\n\n","torrent":{"xt":"urn:btih:947127756986a093775b10b825080b7f6a9c6a66","amp;dn":"Untitled.2007.%7BKorn%7Dfull.album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"947127756986a093775b10b825080b7f6a9c6a66","infoHashBuffer":{"type":"Buffer","data":[148,113,39,117,105,134,160,147,119,91,16,184,37,8,11,127,106,156,106,102]},"announce":[],"urlList":[]}}