{"title":"Tabitha Is On Fire [DVDRip]","uid":9688619,"size":433000641,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:94b83ecc088f271e56009e407a881395311157ac&amp;dn=Tabitha+Is+On+Fire+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":3,"time":1393822294,"description":"Tabitha Is On Fire [DVDRip]\n\nTabitha Stevens, Heather Lee, Farrah, Kyle Phillips, Dave Hardman\n\nSince a personal encounter a couple years back, I've kept tabs on the career of Tabitha Stevens. For one reason or another, I never saw any of her videos until recently. It seems that she was always starring in low-end productions that never found their way into my VCR or DVD player. When I saw that a compilation DVD was released featuring Tabitha, I figured this was my chance to get familiar with her work.\n\nTraditionally compilations aren't known for their high production values, but this is completely unforgivable. I wasn't expecting the video and audio to be top notch, but I was expecting it to look and sound a lot better than this. Not only was this disc transferred from a videotape, but some of the scenes were transferred from a damaged videotape. You can actually see video junk at the bottom of the screen. I innately reached for my remote before I remembered I was watching a DVD and that there was no tracking buttons that would improve the image quality. Not all of the scenes are this bad, but it only takes one to showcase the lack of workmanship that went into this disc.\n\nThe video isn't setup like a regular compilation where scenes play back to back. Instead, Tabitha introduces each scene by confessing her fantasies to the camera. Then the video cuts to a scene which is supposed to be visual representation of he fantasy. She must really have a thing for shoddy archive footage. I don't think it's really necessary to have an intro to each scene but it does tie things together. On the downside, these couch confessions are shot on extremely fuzzy looking video. It looks like it was taken from a third generation VHS copy. To hear what she was saying, I had to crank up the volume, and even then, deciphering the poor audio wasn't that easy. In all honesty, I've shot home videos that look and sound ten times better than this.\n\nSo what about the sex scenes? Since this disc is titled Tabitha is on Fire, I was expecting to get a ton of nasty sweaty sex scenes featuring Tabitha Stevens. Apparently I was wrong to assume the obvious. Tabitha does appear in the video but she only shows up in two scenes! What's up with that? She appears in the first scene where she gets it on in the great outdoors with some blonde girl...is this Farrah? Then she appears in the last scene which is so bizarrely edited that I must explain it.\n\nWhen the third scene ends, the video cuts back to Tabitha on the couch. She says it's time for some masturbation...ok I'll go along with that. The video cuts from the couch to a scene where she is on a bed fingering herself. The weird part is that this solo scene is intercut with about three different scenes showing Tabitha having sex. I think the intent is to once again enter Tabitha's mind and see what she is thinking. I can appreciate the concept, but the execution is terrible and very distracting. For example, in one scene Tabitha is getting fucked pretty hard and all of a sudden it cuts back to the solo scene. After showing Tabitha playing with her tits for a few minutes, it cuts to a different scene showing Tabitha giving head, then back to the masturbation scene. What's bad is that there is no gentle segue in the editing... it's all very abrupt and annoying. Unfortunately, this is the last and only scene where we glimpse Tabitha co-starring with a penis. Even though the scene is intercut with several sex scenes, we only get to see one pop shot. That's right, in this whole DVD Tabitha only takes one pop shot...and it's on her stomach.\n\nIt goes without saying that this is one of the most disappointing pornos I've ever seen. Even with the poor production values and lukewarm action, it still could have been saved if it simply delivered what it promises...Tabitha Stevens. Instead of making a compilation I think Explosive set out to make a feature using a bunch of archive clips. As a result, the disc fails on both fronts. There aren't many extras to speak of other than a photo gallery which shows more of Tabitha than the feature. Even if you're a huge Tabitha fan, I wouldn't waste your money on this garbage. I enjoyed what I saw of Tabitha, but it looks like I'll have to wait a bit longer before I'm really aquatinted with her work.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=gpk6trlbjv0t8482vzhn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=gpk6trlbjv0t8482vzhn.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=v5sbk3fwahhuqrkob8e5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=v5sbk3fwahhuqrkob8e5.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:94b83ecc088f271e56009e407a881395311157ac","amp;dn":"Tabitha+Is+On+Fire+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94b83ecc088f271e56009e407a881395311157ac","infoHashBuffer":{"type":"Buffer","data":[148,184,62,204,8,143,39,30,86,0,158,64,122,136,19,149,49,17,87,172]},"announce":[],"urlList":[]}}