{"title":"Weaponizing Cultural Viruses - Memetics - Hacking - 26C3 [MP4-EN","uid":5452334,"size":799490164,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:94bd7e57efaee9709c029f56df87facfcf950550&amp;dn=Weaponizing+Cultural+Viruses+-+Memetics+-+Hacking+-+26C3+%5BMP4-EN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"exportacc","files":1,"time":1269225363,"description":"[align=center]\n[URL=http://forum.tntvillage.scambioetico.org/tntforum/index.php?showforum=395][IMG]http://img21.imageshack.us/img21/8945/freeculture.gif[/IMG][/URL]\n[/align]\n\n26th Chaos Communication Congress - Here be dragons \n[IMG]http://events.ccc.de/congress/2009/wiki/skins/herebedragons/img/26C3_topbar.jpg[/IMG]\n[URL=http://events.ccc.de]http://events.ccc.de[/URL]\n\nSpeakers\tAaron Muszalski\nSchedule\nDay \tDay 3 - 2009-12-29\nRoom \tSaal2\nStart time \t23:00\nDuration \t01:00\nEvent type \tLecture\nTrack \tSociety\nLanguage used for presentation \tEnglish\n\n\n\nWeaponizing Cultural Viruses\n\nUn Manuale Per Resistenza Memetica Sul Fronte delle Guerre Culturali\n\nCosa significa combattere una guerra culturale? Come si propaga la cultura nella popolazione? Cosa e' un meme? E perche' alcuni meme culturali sono piu' virulenti di altri? Con la monocultura corporativa capitalista che sempre piu' afferma la sua egemonia culturale, e' vitale che gli individui diventino piu' esperti nell'opporvi resistenza.\nIn un mondo iper-connesso, il piu' potente vettore di resistenza e' quello della memetica, l'unita' centrale della &quot;belief&quot; culturale.\nUna guerra di cultura e', fondamentalmente, una guerra memetica.\n\nPer questo i moderni rivoluzionari devono imparare a costruire intenzionalmente memi che non solo possano sopravvivere in competizione con quelli della cultura dominante, ma &quot;thrive&quot;. Gli Hackers, gia' impegnati nell'identificare e &quot;leveraging&quot; le vulnerabilita' nei sistemi informatici, sono i candidati ideali per identificare e sfruttare le vulnerabilita' memetiche dei sistemi culturali.\n\nQuesta lettura esplorera' l'ingegneria virale memetica come meccanismo per un cambio culturale. Nello specifico, come tali virus culturali possono essere armati in maniera piu' effettiva confezionando il loro contenuto non solo per massimizzare il tasso di infezione, ma per durare ed integrarsi. Questa conversione del meme trasmesso in azione di massa e' l'ambizione primaria delle memetiche rivoluzionarie.\n\nViene presentata un' introduzione base ai memes e alla teoria memetica. Verra' chiarita la differenza fra un classico meme di Dawkins/Blackmore ed un meme di Internet, e viene esplorata la loro relazione nel contesto della resistenza memetica. Verra' introdotta anche la virologia base, che verra' usata come la metafora analitica primaria (ma non l'unica).\n\nI meccanismi chiave della trasmissione memetica verranno identificati e verra' introdotto un modello semplificato di valutazione della memetica. Vengono discussi vettori forti e deboli della infezione memetica, cosiccome i concetti di progenitori memetici e domain crossover. \nVengono analizzati i sistemi immuni alla memetica, e vengono esplorati potenziali exploits. Vengono introdotti i punti di infezione - luoghi in cui piccole spinte hanno largo impatto, assieme ai metodi per la loro identificazione. Viene spiegata la necesita' di meme-splitting, e vengono identificato i candidati memetici primari per &quot;metastasizing hacker/maker culture&quot;. Vengono discussi gli immediati benefici ed i vantaggi a lungo termine di tale sforzo. Viene esplorato l'uso dei sistemi di comunicazione digitale nella guerriglia memetica, sia come testbeds (e.g., Twitter come memetic petri dish memetico) che come vettori di infezione.\n\nViene dimostrato il potenziale della resistenza memetica contro le strutture di potere monolitico come il corporatismo globale ed il fondamentalismo religioso. Viene discussa la semantica della resistenza memetica, in particolare nel contesto dei sistemi della popaganda contemporanea, come la &quot;Guerra Globale al Terrore&quot; degli Usa. Vengono citati illuminanti riferimenti storici e culturali, aneddoti umoristici\n[...]\n\nFNORD.\n\n\n\nEN:\n\nWeaponizing Cultural Viruses\n\nA Manual For Engaged Memetic Resistance on The Front Lines of The Culture Wars\n\nWhat does it mean to fight a culture war? How does culture propagate through a population? What is a meme? And why are some cultural memes more virulent than others? As the capitalist corporate monoculture further asserts its global hegemony, it is vital that individuals become more skillful in their resistance to it. In a hyper-connected world, the most powerful vector of resistance is that of memetics, the core unit of cultural belief. A culture war is, fundamentally, a memetic war.\n\nThus the modern revolutionary must learn to intentionally engineer memes that can not only survive in competition with those of the dominant culture, but thrive. Hackers, already adept at identifying and leveraging vulnerabilities in computer systems, are the ideal candidates to identify and exploit the memetic vulnerabilities of cultural systems.\n\nThis talk will explore memetic viral engineering as a mechanism for cultural change. Specifically, how such cultural viruses can be most effectively weaponized by crafting their content not only to maximize the rate of infection, but subsequent retention and integration. This conversion of the transmitted meme into mass action is the primary aim of revolutionary memetics.\n\nA basic introduction to memes and memetic theory will be presented. The difference between a classic Dawkins/Blackmore meme and an Internet meme will be clarified, and their relationship in the context of memetic resistance will be explored. Basic virology will also be introduced, as it will be used as the primary (though not sole) analytical metaphor.\n\nKey mechanisms of memetic transmission will be identified and a simplified model of memetic valuation will be introduced. Strong and weak vectors of memetic infection will be discussed, as will the concepts of memetic progenitors and domain crossover. Memetic immune systems will be analyzed, and potential exploits explored. Inflection points - places where small pushes have large impacts - will be introduced, along with methods for their identification. The need for meme-splitting will be explained, and prime memetic candidates for metastasizing hacker/maker culture will be identified. The immediate benefits and the long-term advantages of such an effort will be discussed. The use of digital communication systems in memetic warfare will be explored, both as testbeds (e.g., Twitter as memetic petri dish) and as infection vectors.\n\nThe potential of memetic resistance against monolithic power structures such as global corporatism and religious fundamentalism will be assessed. The semantics of memetic resistance will be discussed, particularly in the context of contemporary propaganda systems, such as the United States' &quot;Global War on Terror&quot;. Illuminating historical and cultural references will be cited, humorous anecdotes will be told and, in the laughter that follows, a fleeting glance between two members of the audience will lead to a vigorous stand-up shag in the nearest IDF closet, and the two will go on to become iconic revolutionary agitators who bring down too-proud nations worldwide, as well as a significant portion of the network in the Congress Center.\n\nFNORD.\n\n\n[ Info sul file ]\n\nNome: 26c3-3570-en-weaponizing_cultural_viruses.mp4\nData: 9/01/2010 22:45:31\nDimensione: 799,490,164 bytes (762.453 MB)\n\n[ Info generiche ]\n\nDurata: 01:08:05 (4085 s)\nTipo di contenitore: MP4/MOV\nMajor brand: ISO Base Media version 512\nCompatible brands: JVT AVC\nData creazione: 1/01/1970 00:00:00 UTC\nData modifica: 1/01/1970 00:00:00 UTC\nStreams totali: 2\nTipo stream n. 1: video (avc1) {\fVideoHandler}\nTipo stream n. 2: audio (AAC Low complexity) {\fSoundHandler}\nAudio streams: 1\n\n[ Dati rilevanti ]\n\nRisoluzione: 720 x 576\nLarghezza: multipla di 16\nAltezza: multipla di 32\n\n[ Traccia video ]\n\nCodec: avc1\nRisoluzione: 720 x 576\nFrame aspect ratio: 5:4 = 1.25\nPixel aspect ratio: 25777493:23592960 = 1.092592\nDisplay aspect ratio: 25777493:18874368 = 1.365740\nFramerate: 25 fps\nFrames totali: 102125\nBitrate: 1497.451981 kbps\n\n[ Traccia audio ]\n\nCodec: AAC Low complexity\nBitrate: 63.996702 kbps\nCanali: 1\nFrequenza: 44100 Hz\n\n[ Info sulla codifica H.264 ]\n\nSPS id: 0\n  Profile: Baseline@L3\n  Num ref frames: 1\n  Aspect ratio: Custom pixel shape (59:54 = 1.092592)\n  Chroma format idc: YUV 4:2:0\nPPS id: 0 (SPS: 0)\n  Codifica entropica: CAVLC\n  Weighted prediction: No\n  Weighted bipred idc: No\n  8x8dct: No\n\n[ Profile compliancy ]\n\nProfilo da testare: MTK PAL 6000\nRisoluzione: Ok\nFramerate: Ok\nAvvertenza: Se vuoi un rapporto piÃƒÂ¹ completo e preciso clicca su &quot;Analisi DRF&quot;\n\nRapporto generato da AVInaptic (18-11-2007) in data 10 gen 2010, h 22:12:58\n\n\n\n\nBanda: 20kB/s 24/24 7/7 fino ad assestamento della release\n\nse vi piace questa release forse vi interesseranno anche le atre mie rel:\n[URL=http://forum.tntvillage.scambioetico.org/tntforum/index.php?act=allreleases&amp;st=0&amp;filter=gioacchino2&amp;sb=1&amp;sd=0&amp;cat=0&amp;mid=294618]http://forum.tntvillage.scambioetico.org/t...&amp;mid=294618[/URL]\n\nnota: in questi giorni il download e' abbastanza veloce (OLTRE 300kB/s ) siccome c'e' molta gente in DHT e su altri trackers\n\n\n[IMG]http://events.ccc.de/congress/2009/Fahrplan/images/conference-128x128.png[/IMG]\n\n[URL=http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=197651]link[/URL]\n","torrent":{"xt":"urn:btih:94bd7e57efaee9709c029f56df87facfcf950550","amp;dn":"Weaponizing+Cultural+Viruses+-+Memetics+-+Hacking+-+26C3+%5BMP4-EN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94bd7e57efaee9709c029f56df87facfcf950550","infoHashBuffer":{"type":"Buffer","data":[148,189,126,87,239,174,233,112,156,2,159,86,223,135,250,207,207,149,5,80]},"announce":[],"urlList":[]}}