{"title":"Crochet and Knitting patterns - babies and children (mega collec","uid":6667054,"size":1607976423,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95d64dde7862e1bb3aa2260dc93c3929ea341d0e&amp;dn=Crochet+and+Knitting+patterns+-+babies+and+children+%28mega+collec&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"whitecat2010","files":139,"time":1315729839,"description":"This is one of three torrents devoted to children patterns. One is knit only, the other is crochet only [which also includes lots of baby afghans and blankets], and the third, this one, is of books/booklets/magazines which have both knit and crochet patterns, thus couldn't be separated. \nThey have been painstakingly collected from all over the web (many times one by one, on obscure sites, as a free downloader with endless waiting times, or torrents with only one seed which took days to complete). \nThen sorted and organized. It's amazing to see some collections and the mess they're in, everything jumbled together, duplicates with different names, and really horrid quality things which no knitter can ever decipher. I have the sensation that sometimes people just reupload files they got from elsewhere without even opening to check!\nAll files were viewed or at least previewed (thank you, Windows 7!) and renamed for clarity and consistency, putting author name when available, or publisher, and real title exactly as in the front cover, so that duplicates became immediately visible, and then choosing the best, deleting the others. I often added on the title the sizes or ages of children involved. Jumbled page numbers were corrected where needed,pictures rotated where needed. Then patterns were divided into categories, folders and subfolders. The junior patterns were further separated into babies (0-2 years) and children, for ease of browsing, as babies' patterns, for some reason, are always much much more than for the remaining ages. \n\nAdditionally, in many cases of really bad scans (dark, crooked, barrelled/warped, faded, fuzzy, colours blueish, blotched, including extraneous background etc...), extensively edited with Photoshop (cropping, rotating, fixing colour shade, fine-tuning black/white contrast,dewarping, and many more delicate and advanced actions too lengthy to list here) to make the pictures and especially the instructions both presentable and easier to use. The torrent is not in .rar, so you can pick and choose, but if you already have one of those files, I strongly recommend that you compare file size to see if it's really the same. If it was a bad scan, chances are that I have edited it, so this version will be much clearer and more readable. After all, in knitting patterns, readability is even more important than in books - every little word or number counts, and we don't want to ruin our eyes, do we? \nMost files are either in .pdf or .jpg form or both. If you have any preference, just download from somewhere Acrobat pro, and it will easily convert from one to the other in minutes. \nI have also included a picture of a handy chart I made with child sizes by age and chest in cm and inches, so that you can immediately see which patterns are suitable for the child you have in mind. Presented with all my love to all knitters all over the world. I hope you enjoy these collections!","torrent":{"xt":"urn:btih:95d64dde7862e1bb3aa2260dc93c3929ea341d0e","amp;dn":"Crochet+and+Knitting+patterns+-+babies+and+children+%28mega+collec","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95d64dde7862e1bb3aa2260dc93c3929ea341d0e","infoHashBuffer":{"type":"Buffer","data":[149,214,77,222,120,98,225,187,58,162,38,13,201,60,57,41,234,52,29,14]},"announce":[],"urlList":[]}}