{"title":"Alto Riesgo - Kent Follett [Epub][Spanish]","uid":6842159,"size":694204,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9638d824501c9472d4465af42ae5ed8ee963fcc5&amp;dn=Alto+Riesgo+-+Kent+Follett+%5BEpub%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1322206500,"description":"Ken Follett -Alto riesgo\nÃ‚Â·\nAventuras Ã‚Â·\nBÃƒÂ©lico Ã‚Â·\n\nUna misiÃƒÂ³n de alto riesgo protagonizada por seis valientes mujeres dan cuerpo a esta apasionante novela. En ella Ken Follett quiere rendir un homenaje a todas aquellas mujeres que arriesgaron sus vidas para realizar peligrosas operaciones como agentes encubiertos durante la Segunda Guerra Mundial. Una acciÃƒÂ³n trepidante y unos personajes cautivadores son los principales ingredientes de esa historia destinada a convertirse en un clÃƒÂ¡sico del gÃƒÂ©nero bÃƒÂ©lico.\n\nHistoria de la Segunda Guerra Mundial\n\nAÃƒÂºn no se conoce el dÃƒÂ­a del desembarco de los aliados, pero los alemanes saben que serÃƒÂ¡ pronto. &quot;Flick&quot; es una de las agentes mÃƒÂ¡s valiosas de la unidad britÃƒÂ¡nica que realiza operaciones de sabotaje en el Norte de Francia con la colaboraciÃƒÂ³n de la Resistencia francesa.\n\n&quot;Flick&quot; es capaz de convencer a sus mandos de que el el ÃƒÂ©xito del desembarco aliado depende de que las lÃƒÂ­neas de comunicaciÃƒÂ³n con Alemania no funcionen.\n\nEl mayor centro de comunicaciones de la Francia ocupada se encuentra en Sainte-CÃƒÂ©cile, cerca de Reims, utilizando un antiguo palacio del siglo XVII. En un primer intento, &quot;Flick&quot; trara de realizar un asalto directo y la operaciÃƒÂ³n fracasa. El grupo de la Resistencia que utiliza es desmantelado y sus superiores empiezan a dudar de ella. Tras arduas negociaciones, le conceden una ÃƒÂºltima oportunidad de cumplir la misiÃƒÂ³n.\n\nEl nuevo plan requiere un grupo exclusivamente femenino y no profesional para poder entrar al palacio utilizando la identidad de las limpiadoras. Debe reclutar y entrenar al equipo en cuestiÃƒÂ³n de dÃƒÂ­as. IntentarÃƒÂ¡n infiltrarse en el castillo a la vista de los nazis tratando de resolver los problemas imprevistos que van ocurriendo a lo largo de la misiÃƒÂ³n.","torrent":{"xt":"urn:btih:9638d824501c9472d4465af42ae5ed8ee963fcc5","amp;dn":"Alto+Riesgo+-+Kent+Follett+%5BEpub%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9638d824501c9472d4465af42ae5ed8ee963fcc5","infoHashBuffer":{"type":"Buffer","data":[150,56,216,36,80,28,148,114,212,70,90,244,42,229,237,142,233,99,252,197]},"announce":[],"urlList":[]}}