{"title":"Mickey Jupp - Juppanese  1978  (mp3@320Kbps)","uid":4790831,"size":138894752,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:96da32d8a846ba0d2136bfd8385a327ebd923bd4&amp;dn=Mickey+Jupp+-+Juppanese++1978++%28mp3%40320Kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WindTrade","files":17,"time":1237713840,"description":"Michael 'Mickey' Jupp (born 6 March 1944, Worthing, Sussex) is a English musician and songwriter, mainly associated with the Southend music scene.\n\nJupp played in several Southend bands after leaving art college in 1962 and was in the R&amp;B group The Orioles (1963 - late 1965), which included Mo Witham (guitar, vocals) and Bob Clouter (drums), but the band were never recorded.\n\nAfter a break from music, Jupp formed Legend in 1968, who were signed to Bell Records. They released an eponymous album Legend playing a mix of pop, rockabilly and blues rock styles using no electric instruments. The original band: Nigel Dunbar (drums), Chris East (guitar, vocals &amp; harmonica) and Steve Geere (string bass &amp; vocals), who recorded this album with Jupp (guitar, piano &amp; vocals), split soon afterwards, so Jupp assembled a new line-up, with Mo Witham on guitar, John Bobin on bass and Bill Fifield on drums. A recording deal with Vertigo produced a second album, in 1970, using the same line up. Confusingly, this album was also called Legend, but is usually referred to as the &quot;Red Boot&quot; album, after the cover picture. Fifield left to join T. Rex (where he was re-named Bill Legend, after the band he had left, by Marc Bolan), and was replaced on drums by Bob Clouter who had played with Jupp in The Orioles. This line-up recorded the second Vertigo album Moonshine issued in 1971 (and re-released on CD in 2007), after which the band broke up.\n\nReturning to Southend, Jupp pursued a low-key existence until the pub-rock revolution (spearheaded by local bands such as Dr. Feelgood, for whom he wrote the hit single &quot;Down at the Doctors&quot;) created a fresh interest in rock and roll. He signed to Stiff Records in 1978, and they initially released a compilation album of the first three Legend albums, which was also called Legend, giving three albums with this title. This was followed by his first solo album Juppanese, an album in two different styles. The first half was recorded with Rockpile and produced by Nick Lowe, and is in a simple raw style, whereas the second half, produced by Gary Brooker of Procol Harum, is slicker.[2] (there was a long-standing connection with Procol Harum; their bassist David Knights produced the second Legend single).\n\nThe follow up album Long Distance Romancer was produced by Godley and Creme, and has a slick, highly produced, sound, which was generally seen as less successful.\n\nJupp went on to release a further seven solo albums, some appearing on Swedish and German labels. His songs have been recorded by Rick Nelson, Elkie Brooks, The Judds and Chris Farlowe, Delbert McClinton, Nick Lowe, Gary Brooker, The Hamsters, Dr. Feelgood and The Searchers.\n\nAt one time the Mickey Jupp Band had Joy Sarney as its vocalist.\n\nIn February 2009 the early Legend line up of Jupp, Chris East, Mo Witham, John Bobin and Bob Clouter self-released a new home-made album, Never Too Old To Rock, featuring a selection of Jupp/East songs written over the previous twenty years.\n\n- Wkipedia\n","torrent":{"xt":"urn:btih:96da32d8a846ba0d2136bfd8385a327ebd923bd4","amp;dn":"Mickey+Jupp+-+Juppanese++1978++%28mp3%40320Kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96da32d8a846ba0d2136bfd8385a327ebd923bd4","infoHashBuffer":{"type":"Buffer","data":[150,218,50,216,168,70,186,13,33,54,191,216,56,90,50,126,189,146,59,212]},"announce":[],"urlList":[]}}