{"title":"John Shuttleworth's Lounge Music 2/5","uid":10598957,"size":34744680,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9728054307b1fa70408615b826276c7eca184e45&amp;dn=John+Shuttleworth%27s+Lounge+Music+2%2F5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shardlow","files":1,"time":1405891874,"description":"Since the mid-1980s, aspiring singer/songwriter, John Shuttleworth has been posting audio cassettes of his &quot;finest songs to date&quot; to pop stars throughout the land, in the hope that someone would record his material. But all to no avail.\n\nHowever, the BBC has very kindly given John a series and asked him to invite pop starts to bring their music to his Sheffield home. So it is that Chas and Dave, Heaven 17, Toyah Wilcox and Leee John find themselves in John's lounge having tea with wife Mary, being flirted with by Mary's friend Joan and hassled by John's agent Ken Worthington, as they try and perform not only one their greatest hits but more importantly, one of John's.\n\nThis week John is in a fluster as Kirsty the scottie dog has eaten the tape with all John's jingles on it - so he's having to play them all live and is worried they may all go wrong.\n\nMary has been complaining that the music is too loud - although she doesn't seem to mind when Heaven 17 are playing. And is that a lemon drizzle cake she's brought for them?\n\nAs Glenn and Martyn settle down to play one of their songs, Come Live With Me, Joan Chitty arrives and quite likes the sound of the title. So while John is fretting that the maths in the song lyrics are all wrong, Joan asks if the boys can give her a massage to ease her sciatica. \nAll this, along with Tina Charles telling John how to sing very high in Top Tips on the Telephone, leaves time short for Ken in the Konservatory - will it happen?\n\nWritten and Performed by Graham Fellows with special guests Heaven 17 and Tina Charles.Episode 2 of 5","torrent":{"xt":"urn:btih:9728054307b1fa70408615b826276c7eca184e45","amp;dn":"John+Shuttleworth%27s+Lounge+Music+2%2F5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9728054307b1fa70408615b826276c7eca184e45","infoHashBuffer":{"type":"Buffer","data":[151,40,5,67,7,177,250,112,64,134,21,184,38,39,108,126,202,24,78,69]},"announce":[],"urlList":[]}}