{"title":"Brilliant Database 10.06 Professional/Server/Workplace/Ultimate ","uid":8470571,"size":111110144,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9798bc55551184d38085d55b81784ef22b05c8e5&amp;dn=Brilliant+Database+10.06+Professional%2FServer%2FWorkplace%2FUltimate+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"addad2011","files":-1,"time":1368473431,"description":" &lt;a href=&quot;http://www.brilliantdatabase.com/features.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.brilliantdatabase.com/features.html&lt;/a&gt;\n\nBrilliant Database allows you to create a database without any special knowledge or skills. According to its actual users' opinions and comments, Brilliant Database perfectly fits the purpose of maintaining a database, which can contain the information about the personnel, customers, goods, and important papers. Furthermore, with this program you can create a database working with completely different types of data. To accomplish these goals, the program consists of 7 powerful editors and many wizards, which will always be ready to help you.\n\nWhat can I create using Brilliant?\nYou can create both usual invoicing, inventory, people, projects management databases, CRM, and any specific databases, for example, the cost accounting system for a car.\n\nWhat features will my database have?\nBeside main functions, a database created by you will have additional options such as using mathematic formulas, sending e-mails, storing files and photos, possibility of simultaneous work of several people by the network, simple interface and much more.\n\nHow to develop my database?\n7 visual editors will help you create a full-fledged solution. These are: form editor, query editor, formula, script, timers, data exporting and importing editors.\n\nFeatures:\nBrilliant is a full-featured database software solution\nBrilliant Database is an out-of-the-box solution comprising all you need to create a database and work with it: an up-to-date engine, supporting databases up to 4 Gb and work via the network/internet, easy-to-use editors to create forms, reports, scripts, queries and so on, as well as a possibility to use a database of any structure.\n\nWhen working with the program, you will not need additional components - Brilliant Database has all you may require.\n\nClassic, but customizable Outlook Interface\nNeither you nor your users will experience any problems with the interface - we used a classic interface of Outlook. The tree of folders with your records on the left, a list of records in the selected folder at the top and the window for viewing the current record at the bottom.\n\nHowever, nothing can prevent you from changing a database if necessary - you can add a new field on the form, report, or automate some routine with a script - all editors are available at any time from the Designers menu.\n\nWork with Images, Formulas, Attachments\nBrilliant Database allows you to easily work with any data. If you store dates, you can enter them using a calendar; to work with pictures, you can use a possibility to get them directly from a scanner or a web camera and automatically scale them. For any record you can store an unlimited number of file attachments and links to other records.\n\nThere are more than 20 fields available in the program; you can change the behaviour of any of them by means of scripts.\n\nEasy Networking\nBrilliant Database allows several users to work with the same database simultaneously. At that, users may work with a remote database in the same manner as with a usual one - all options of the program will be available to them, including adding and deleting files in the database and executing scripts.\n\nAll users are divided into groups, for each of which it is possible to easily define access rights and neccessary tools.\n\nAutomate workflow using scripts\nAutomate routine operations using simple scripts that may be created by means of an easy-to-use visual editor - that is, there is no necessity to learn any computer language. Just select from the list of more than 40 actions the ones that you need.\n\nFor example, when a form is changed, select to send an e-mail notification; when a button is pressed - select to create a new record; or make a backup copy every 20 minutes.\n\nReports, E-mails, Ms Word Documents, Excel, Access, Web\nUsing Visual Query Editor and Report Style Editor, create queries to a database and print any documents - reports, invoices, catalogues, business cards.\n\nThanks to Custom Import and Custom Export tools, you can send e-mails, generate MS Word and Excel documents, web-pages, import data from Outlook and directly from web sites. For example, you can add to the program a possibility to automatically import currency rates or generate reports in the Excel format.\n\nscreenshots:\n &lt;a href=&quot;\nhttp://www.freenew.net/upload/pscreen/47/brilliant-database-sdk-51.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freenew.net/upload/pscreen/47/brilliant-database-sdk-51.gif&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i.udm4.com/screenshots_u4win/209/209735_2.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.udm4.com/screenshots_u4win/209/209735_2.gif&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i.udm4.com/screenshots_u4win/2769/2769676_1.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.udm4.com/screenshots_u4win/2769/2769676_1.gif&lt;/a&gt;\n\n\nKeyGen included &quot;low risk&quot;\n &lt;a href=&quot;\nhttp://www.symantec.com/security_response/writeup.jsp?docid=2011-122605-0918-99&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.symantec.com/security_response/writeup.jsp?docid=2011-122605-0918-99&lt;/a&gt;","torrent":{"xt":"urn:btih:9798bc55551184d38085d55b81784ef22b05c8e5","amp;dn":"Brilliant+Database+10.06+Professional%2FServer%2FWorkplace%2FUltimate+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9798bc55551184d38085d55b81784ef22b05c8e5","infoHashBuffer":{"type":"Buffer","data":[151,152,188,85,85,17,132,211,128,133,213,91,129,120,78,242,43,5,200,229]},"announce":[],"urlList":[]}}