{"title":"Part Time - PDA (2013) [FLAC]","uid":8692007,"size":287303458,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:995e2056b3e9cbdcc7b1fbc6563dfa4a873f6c6b&amp;dn=Part+Time+-+PDA+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1373901475,"description":"\n  Part Time - PDA (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Electronic, Chillwave\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 850 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 I Want to Go\n  02 How Do I Move On?\n  03 I Won't Be Your Little Secret\n  04 Living in the U.S.A.\n  05 Night Drive\n  06 Staring at a Gun\n  07 I Belong to You\n  08 Funny Moods\n  09 PDA\n  10 All My Love &amp; All Your Love (Together We Are Fine)\n  11 Sonando de Ti\n  12 Seashells\n\n  Part Time's second album, PDA, isn't much different from their first, What Would You Say? David Speck's bedroom-created, lo-fidelity synth pop is still incredibly woozy, off-kilter, and a little creepy. It's also remarkably catchy, sounding like classic Cure pop songs run happily through Ariel Pink's freak filter. PDA brings in a few new influences, dropping in a little disco, some Cars-meets-Suicide (especially on &quot;Living in the U.S.A.&quot;), and a touch more guitar in the cheapo synth/drum machine mix. Speck sounds a little more assured vocally, with more power and attitude on display throughout as he croons, cajoles, and calmly pleads. He even slips into Lawrence from Felt/Denim territory a few times. \n\n  The last album had one drop dead hit on it -- the heart-stoppingly good &quot;Cassie (Won't You Be My Doll)&quot; -- this one has a whole bunch of them. The rain-splattered &quot;Night Drive&quot; (which verges on Italians Do It Better territory), the smoothly slinky love ballad &quot;All My Love and Your Love (Together We Are Fine),&quot; the insistently melodic and super wistful &quot;Seashells,&quot; the melancholy, and the very mid-period Felt-inspired &quot;How Do I Move On&quot; all come close, and the rest of the album is a slight progression both in terms of songcraft and production. The only track that doesn't quite work is &quot;Funny Moods,&quot; where Speck's vocals are too affected and the array of sound effects that punctuate the herky-jerky melody and rhythm come off as too silly by half. It's a small blip, though, that doesn't wreck things too much. Maybe Speck was thinking that the rest of the album was too much of a piece and he needed to shake things up a bit. He shouldn't have worried, though, because PDA sets up a dreamily weird and heartfelt mood from the beginning and drives it deeper into the listener's consciousness with each song that follows.","torrent":{"xt":"urn:btih:995e2056b3e9cbdcc7b1fbc6563dfa4a873f6c6b","amp;dn":"Part+Time+-+PDA+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"995e2056b3e9cbdcc7b1fbc6563dfa4a873f6c6b","infoHashBuffer":{"type":"Buffer","data":[153,94,32,86,179,233,203,220,199,177,251,198,86,61,250,74,135,63,108,107]},"announce":[],"urlList":[]}}