{"title":"Barnes-Blasting Historical Blackout-Origins of Second World War(","uid":4551719,"size":187473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99a832489802d2ff8f365b8c563ab320c20581f6&amp;dn=Barnes-Blasting+Historical+Blackout-Origins+of+Second+World+War%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1228331304,"description":"This is Harry Elmer Barnes&amp;#039; amazing booklet with the full title Blasting the Historical Blackout - A.J.P. Taylor&amp;#039;s The Origins of the Second World War - Its Nature, Realibility, Shortcomings and Implications (1962) which analyses the breakthrough for revisionist history marked by A.J.P. Taylor&amp;#039;s book Origins of World War II. Barnes, who was one of America&amp;#039;s leading revisionist historians, describes historical blackout as an effort which has been made since the outbreak of the second World War to suppress the truth relative to the responsibility for this great conflict and the manner in which the United States entered the war. This has involved ignoring or suppressing the facts which run counter to wartime propaganda when writing books on these subjects and suppressing, ignoring or seeking to discredit those books which have taken account of such facts. After the first World War the defeated countries, such as Germany, Hungary and Austria presented such facts as they could bring forth to justify their case and demonstrate their innocence of sole or primary responsibility for the outbreak of war in August, 1914. This has not been the case since 1945. In neither Germany nor Italy has there been much activity in producing historical literature designed to present the case of these countries with respect to the events of 1939, and what is known as Revisionism - the effort to get at the truth on the second World War - has been sporadic and fragmentary in Japan. West Germany and Italy have almost outdone the victors in castigating their leaders of 1939 days and their alleged guilt and the East Germans have been additionally throttled by the intensely Germanophobe and anti-Hitler attitude of Soviet Russia. A whole generation has grown up which knows little or nothing beyond President Roosevelt&amp;#039;s &quot;Day of Infamy&quot; subterfuge and deception. No book has yet been published in the United States which is devoted primarily to telling the truth about the causes of the second World War, whereas American historians had fully and definitively covered the causes of war in 1914 within ten years after the Armistice of 1918. But in no country has the historical blackout been more intense and effective than in Great Britain. Virtually nothing has been written to reveal the truth about the British responsibility for the second World War or its disastrous results. Until the appearance of professor Taylor&amp;#039;s book in 1961, the only work which had been published in England that dealt specifically with the origins of the second World War was the Diplomatic Prelude by Sir Lewis B. Namier. His book on 1939, written in 1946, was vehemently pro-Polish and anti-German, and the author admitted that it was based chiefly on the severely censored wartime documents and the perhaps even more unreliable material presented as evidence in the Nuremberg Trials. Taylor was a renowned English historian of the 20th century and certainly one of the most controversial of its time as he sought the story behind the black and white picture that was offered as explanation of causes of war by cleverly made war propaganda that eventually became the official history of the whole period. Those who maintain the historical blackout have been able to keep most of the vital information from the public and out of the historical books which are used in the schools and colleges. An awareness of real history provides understanding about the great issues of the present and the future. Blasting the Historical Blackout is all the more relevant in these troubled times as the political-economic order imposed by the victorious powers of the Second World War breaks apart - and along with it a distorted and one-sided historical perspective. 45 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:99a832489802d2ff8f365b8c563ab320c20581f6","amp;dn":"Barnes-Blasting+Historical+Blackout-Origins+of+Second+World+War%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99a832489802d2ff8f365b8c563ab320c20581f6","infoHashBuffer":{"type":"Buffer","data":[153,168,50,72,152,2,210,255,143,54,91,140,86,58,179,32,194,5,129,246]},"announce":[],"urlList":[]}}