{"title":"FireStream 1.22 [MAC OS X]","uid":13878055,"size":34403541,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:99d37dcc19bb7f0adf67390563f300b44e5d1ffb&amp;dn=FireStream+1.22+%5BMAC+OS+X%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iAlexander","files":1,"time":1458134395,"description":"MADE IN UKRAINE\r\n\r\nFireStream 1.22 – UPnP/DLNA media server.\r\n\r\nIntroducing FireStream: the most advanced UPnP/DLNA media server for the Mac platform. FireStream is written for the Mac from scratch, so you can be sure it provides a true, seamless Mac experience. Enjoy all of your media, including videos, photos and music on all of your DLNA devices. FireStream natively supports music and videos from iTunes and the new Photos app as well as any user specified folders. The media is organized just like it is on your Mac and includes thumbnails and rich metadata. Its a snap to locate and stream your favorite content from the comfort of your couch.\r\n\r\nTranscoding allows you to play media files that would normally not be supported by a device by converting them on the fly. You can specify connection speed and quality settings to fit your network and device capabilities with ease or enable subtitles with a single click.\r\n\r\nWith automatic device detection and automatic transcoding configuration, FireStream makes streaming your media as easy as can be. Just power on your UPnP/DLNA media device and FireStream will instantly locate it. FireStream also has a built in authorization system allowing you to limit access to specific IP addresses/devices.\r\n\r\nUnique just-in-time indexing technology allows FireStream to instantly share your media without having to index your entire Mac first! Changes to your media libraries or folders are instantly reflected in the FIreStream content index.\r\n\r\nFireStream works great with Xbox One, PlayStation 4, PlayStation 3, Sony Bravia TVs, Harman/Kardon receivers, MediaMonkey, VLC for iOS and many, many other devices!\r\n\r\nWhat`s new in version 1.22:\r\n- Added iTunes &gt; All TV Shows group\r\n- Fixes iTunes TV Show browsing (broken by recent iTunes update) note: you must let iTunes organize your library for this fix to work\r\n- Stability improvements\r\n\r\nMADE IN UKRAINE","torrent":{"xt":"urn:btih:99d37dcc19bb7f0adf67390563f300b44e5d1ffb","amp;dn":"FireStream+1.22+%5BMAC+OS+X%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99d37dcc19bb7f0adf67390563f300b44e5d1ffb","infoHashBuffer":{"type":"Buffer","data":[153,211,125,204,25,187,127,10,223,103,57,5,99,243,0,180,78,93,31,251]},"announce":[],"urlList":[]}}