{"title":"Deep Purple - Made In Japan (1973) WMA320","uid":6039848,"size":192106599,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:99f4d0ce5228d205cbe29689e9b79280cc7c5313&amp;dn=Deep+Purple+-+Made+In+Japan+%281973%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1292344477,"description":"THE BAND: Ritchie Blackmore (guitars), Ian Gillan (vocals), Jon Lord (keyboards), Roger Glover (bass), Ian Paice (drums &amp; percussion). \n\nTHE DISC: (1973) 2 vinyl albums now on 1 disc. 7 songs clocking in at approximately 77 minutes. Included with the disc is a 6-page booklet with original artwork and black &amp; white photos, song titles, song times, and a brief 1-page intro. Songs recorded live in Tokyo and Osaka, Japan. A new '25th Anniversary Edition' 2-disc version is available as of 1998 - with digitally remastered sound and bonus tracks (and very much worth looking for)... an added 21 minutes featuring the songs &quot;Black Night&quot;, &quot;Speed King&quot; and &quot;Lucille&quot;. There is also a more complete (rare) 3-disc version availabe as well. Label - Warner Bros. \n\nCOMMENTS: &quot;Made In Japan&quot; is perhaps one of the best live recordings of a hard rock / heavy metal act ever. Think of the other classic acts that had great live albums from the past... Peter Frampton, Led Zeppelin, Kiss, Foghat, UFO, Lynyrd Skynyrd, Iron Maiden, etc. Outside of Kiss, I don't think any of these recordings offer the full package of excellent sound quality/production, emotion, excitement, audience participation, and a great selection of songs. The audience was respectfully quiet during the songs and really let it out in between them. The slower parts of &quot;Child In Time&quot; - you can hear a pin drop. It's interesting to listen, when &quot;Smoke On The Water&quot; is introduced by Gillan the crowd is silent... almost like they're not sure what they're about to hear. The 6 minute drum solo on &quot;The Mule&quot; was enthralling from Ian Paice - one of the best rock drummers EVER. Jon Lord's keyboard work is 2nd to none. His best work on this album is on the songs &quot;Lazy&quot; and &quot;Child In Time&quot;. Seems that Lord and Blackmore had some great fun dueling back and forth. Some of the tunes, like &quot;Strange Kind of Woman&quot; and &quot;Child In Time&quot; sound better here than on the studio album. Gillan's interaction with the audience at the end of &quot;Strange Kind Of Woman&quot; is priceless. Ritchie Blackmore's trademark guitar sound and blistering solo's are amazing. 7 total songs - short track list but 6 of the 7 songs are 9+ minutes or longer. Two songs (&quot;The Mule&quot;, Strange Kind Of Woman&quot;) from &quot;Fireball&quot;; one song (&quot;Child In Time&quot;) from &quot;In Rock&quot;; and four from &quot;Machne Head&quot;. The album closer is the marathon &quot;Space Truckin'&quot; clocking in at just under 20 minutes. &quot;Made In Japan&quot; is a highlight reel of two great shows on the &quot;Machine Head Tour&quot; in '73. The only thing wrong with this original issue is that it's just not long enough. Now, with the remastered &quot;25th Anniversary&quot; edition you can buy more of the show. Classic disc (5 stars). \n\nby R. Gorham &quot;RCG2&quot;\n\nTRACKLIST:\n\n01 - Highway Star.wma                                                           \n02 - Child In Time.wma                                                          \n03 - Smoke On The Water.wma                                                     \n04 - The Mule.wma                                                               \n05 - Strange Kind Of Women.wma                                                  \n06 - Lazy.wma                                                                   \n07 - Space Truckin'.wma\n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:99f4d0ce5228d205cbe29689e9b79280cc7c5313","amp;dn":"Deep+Purple+-+Made+In+Japan+%281973%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99f4d0ce5228d205cbe29689e9b79280cc7c5313","infoHashBuffer":{"type":"Buffer","data":[153,244,208,206,82,40,210,5,203,226,150,137,233,183,146,128,204,124,83,19]},"announce":[],"urlList":[]}}