{"title":"Alicia Keys - Un-thinkable (I'm Ready)  (2nafish)","uid":5670447,"size":123930628,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:99fbb10bcb48403e389e0c5bc3bf4757b44fa6f7&amp;dn=Alicia+Keys+-+Un-thinkable+%28I%5C%27m+Ready%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1278324145,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis videos has no logos or titles.\n\n\n&quot;Un-Thinkable (I'm Ready)&quot; is a song performed by American recording artist Alicia Keys and has backing vocals provided by Canadian rapper, Drake. According to Keys' official website is the next single from her 2009 album, The Element of Freedom. It was initially scheduled to be the fifth single but will now impact as the fourth single whilst &quot;Put It in a Love Song&quot; will impact Summer 2010. It was her first single to reach number one single R&amp;B chart in the United States after 2007's &quot;Like You'll Never See Me Again&quot;.\n\nThe official remix of the song featuring a verse by Drake was released on iTunes on May 28, 2010. It may also appear on a future re-release of the album.\n\nKeys filmed the music video in Los Angeles with director Jake Nava. Although Drake appears on background vocals Keys has stated that he won't appear in the video because she said &quot;that would be too obvious&quot;. The video will tackle issues of interracial dating and as Keys told Rap Up magazine, &quot;The promo clip will highlight the past and present stigmas surrounding the subject.&quot; Additionally Chad Michael Murray, best known for playing Lucas Scott in One Tree Hill, plays Keys' love interest. One of the scenes will depict a blood-stained Murray fighting a gang of men. The video made its world premiere on May 12, 2010 on Vevo and on BET's 106 &amp; Park.the video features 3 diffrent versions of years the 60's or 50's(black &amp; white color) the 90's or 80's in the orange color and the present day.\n\nThe Element of Freedom is the fourth studio album by American R&amp;B musician Alicia Keys, released December 11, 2009, on J Records. Recording sessions for the album took place during May to September 2009 at The Oven Studios in Long Island, New York. Production was handled by Keys, Jeff Bhasker, Swizz Beatz, Noah &quot;40&quot; Shebib, and Kerry &quot;Krucial&quot; Brothers.\n\nThe album debuted at number two on the U.S. Billboard 200 chart, selling 417,000 copies in its first week. It became Keys' first non-number one album in the United States and her first number one album in the United Kingdom. The Element of Freedom was certified platinum by the RIAA within its first month of release and produced five singles that attained chart success. Despite mixed criticism towards its low-key style and Keys' songwriting, the album received generally positive reviews from most music critics. As of June 8, 2010, it has sold 1,305,000 copies in the United States.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:99fbb10bcb48403e389e0c5bc3bf4757b44fa6f7","amp;dn":"Alicia+Keys+-+Un-thinkable+%28I%5C%27m+Ready%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99fbb10bcb48403e389e0c5bc3bf4757b44fa6f7","infoHashBuffer":{"type":"Buffer","data":[153,251,177,11,203,72,64,62,56,158,12,91,195,191,71,87,180,79,166,247]},"announce":[],"urlList":[]}}