{"title":"Jordan Maxwell 15hrs on-1-DVD5","uid":5813290,"size":4691890223,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9a0b9912bc3108c45ee3ec15655594596a897612&amp;dn=Jordan+Maxwell+15hrs+on-1-DVD5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":48,"time":1283734495,"description":"Before there was David Icke or Alex Jones, there was Jordan Maxwell. As much Jordan Maxwell as physically possible squashed onto one dvd, over 16hrs.\nJordan Maxwell continues as a preeminent researcher and independent scholar in the field of occult / religious philosophy. His interest in these subjects began as far back as 1959. He served for three and a half years as the Religion Editor of Truth Seeker Magazine, America's oldest Freethought Journal (since 1873). His work exploring the hidden foundations of Western religions and secret societies creates enthusiastic responses from audiences around the world.\n\nHe has conducted dozens of intensive seminars, hosted his own radio talk shows, guested on more than 600 radio shows, and written, produced and appeared in numerous television shows and documentaries (including three 2-hour specials for the CBS TV network, as well as the internationally acclaimed 5-part Ancient Mystery Series - all devoted to understanding ancient religions and their pervasive influence on world affairs today. \n\nHis work on the subject of secret societies, both ancient and modern, and their symbols, has fascinated audiences around the world for decades. Considering the rapidly moving events of today, and the very real part that hidden religious agendas play in our modern war-torn world, he feels these controversial subjects are not only interesting to explore, but too important to ignore! His extraordinary presentations includes documents and photographs seldom seen elsewhere. \n\nJordans areas of interest include:\n\n* Astro-Theology \n* Sexual Symbolism in World Religions\n* Foundations for Modern-Day Religion\n* Secret Societies and Toxic Religion\n* World Mysteries: Ancient and Modern\n* Ancient Symbols and Occult Emblems\n* Ancient Sciences and Technology\n* Hidden Bible Teachings and Mysteries\n* The Sun in the History of Politics and Religion\n* The Story Your Church Doesn't Want You to Know\n* Secret Societies and their Influence on World Events\nCustom Dvd with menus and 11 separate video tracks. Sourced from this torrent, thank you to that\n1.Jordan Maxwell - AstroTheology\n2.Jordan Maxwell - Basic Slide Presentation\n3.Jordan Maxwell - In Egypt\n4.Jordan Maxwell - Magic Dominates the World\n5.Jordan Maxwell - Matrix of Power\n6.Jordan Maxwell - On Religion and Politics\n7.Jordan Maxwell - Private Interview with Zecharia Sitchin\n8.Jordan Maxwell - Secret Societies and Word Meanings\n9.Jordan Maxwell - The Naked Truth\n10.Jordan Maxwell - Those Who From Heaven to Earth Came\n11.Jordan Maxwell - UFOs Past Present and Future\n\n\n\n\nPee","torrent":{"xt":"urn:btih:9a0b9912bc3108c45ee3ec15655594596a897612","amp;dn":"Jordan+Maxwell+15hrs+on-1-DVD5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a0b9912bc3108c45ee3ec15655594596a897612","infoHashBuffer":{"type":"Buffer","data":[154,11,153,18,188,49,8,196,94,227,236,21,101,85,148,89,106,137,118,18]},"announce":[],"urlList":[]}}