{"title":"Homegrown and Handmade: A Practical Guide to More Self-Reliant L","uid":7420205,"size":2103277,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9cbaf4a623b87533b45698860f987911c127fb9b&amp;dn=Homegrown+and+Handmade%3A+A+Practical+Guide+to+More+Self-Reliant+L&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DaRule762","files":-1,"time":1341643143,"description":"\n\nOur food system is dominated by industrial agriculture and has become economically and environmentally unsustainable. The incidence of diet-related diseases, including obesity, diabetes, hypertension, cancer, and heart disease, has skyrocketed to unprecedented levels. Whether you have forty acres and a mule or a condo with a balcony, you can do more than you think to safeguard your health, your money, and the planet.\n\nHomegrown and Handmade shows how making things from scratch and growing at least some of your own food can help you eliminate artificial ingredients from your diet, reduce your carbon footprint, and create a more authentic life. Whether your goal is increasing your self-reliance or becoming a full-fledged homesteader, it's packed with answers and solutions to help you:\n\n    Take control of your food supply from seed to plate\n    Raise small and medium livestock for fun, food, and fiber\n    Rediscover traditional skills to meet more of your family's needs than you ever thought possible\n\nThis comprehensive guide to food and fiber from scratch proves that attitude and knowledge is more important than acreage. Written from the perspective of a successful self-taught modern homesteader, this well illustrated, practical, and accessible manual will appeal to anyone who dreams of a simpler life.\n\nDeborah Niemann is a homesteader, writer, and self-sufficiency expert who presents extensively on topics including soapmaking, bread baking, cheesemaking, composting, and homeschooling. She and her family raise sheep, pigs, cattle, goats, chickens, and turkeys for meat, eggs, and dairy products, while an organic garden and orchard provides fruit and vegetables.\n","torrent":{"xt":"urn:btih:9cbaf4a623b87533b45698860f987911c127fb9b","amp;dn":"Homegrown+and+Handmade%3A+A+Practical+Guide+to+More+Self-Reliant+L","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cbaf4a623b87533b45698860f987911c127fb9b","infoHashBuffer":{"type":"Buffer","data":[156,186,244,166,35,184,117,51,180,86,152,134,15,152,121,17,193,39,251,155]},"announce":[],"urlList":[]}}