{"title":"Unsolved Mysteries Disc 13","uid":5884714,"size":4542632201,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9db30050e0cd65e1da500ba5824da75d2ee61b6b&amp;dn=Unsolved+Mysteries+Disc+13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"slasherman","files":3,"time":1287019039,"description":" &lt;a href=&quot;http://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_000-3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_000-3.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_001-5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_001-5.jpg&lt;/a&gt;\n\nOnly murder, wanted and unexplained deaths..real crime stuff.\nThe quality is very poor. Old vhs tapes which has been compressed into small file size. Typical vhs noise on most.\n\nTime: About 6 hours\n\nHow to burn:\nI have chosen .iso file.\nIf you use ImgBurn: WRITE IMAGE FILE TO DISC\nI tested it at 6x write speed and it worked perfectly...\nRemember to keep the .iso file on your pc so you can seed.\n\nDisc 13:\n- Gordon Collins went missing after his boat capsized. Numerous reports have him wandering the streets of Mexico disoriented.\n- &quot;Freedom 2&quot; - 2 couples embark on a cruise on a yacht. It is lost at sea but the two men resurface without the women. Police think it could be an insurance scam.\n- Curtis Pishon is found missing from his security guard job. Earlier that same night his car caught fire and he called the fire dept. Where could he be?\n- Special Alert: Grateful Dead fan - Police are trying to identify the victim of a car accident that they believe was hitchhiking.\n- Bobby Fuller - Famous rocker from the 60's found dead in his car under mysterious circumstances. Suicide or murder?\n- Maria Armstrong, a known schizophrenic, is wanted for the murder of her boyfriend Robert Argenti.\n- Anita Greene was killed in her car and her husband Melvin was convicted of hiring the hit man. Anita's friend has written a book about the case.\n- Bill Henderson, elderly man, was beat to death in his home. Police looking for the killer whom 2 hitchhikers think they accepted a ride from.\n- Jim Kimble, who had suffered from psychological problems in his young life, has disappeared. Family desperate to find him.\n- Morgan Nick/Jacqueline Castenada - Police investigate the abduction of Morgan from a baseball game and Jacqueline's abduction from a swap meet.\n- Philip Breen is wanted for embezzlement at the mortgage company where he worked. He has disappeared leaving his wife to take the fall.\n- Wild horses are being shot in Nevada. Police searching for those responsible.\n- Arthur Frankfurt is wanted for conning and stealing from elderly women.\n- Spanish Lotto scam - Police searching for the perpetrators who scam unsuspecting victims by doctoring lotto tickets.\n- Special Alert: Church Fires in Florida - Someone has set over 20 church fires in Florida. Looking for those responsible.\n- Special Alert: Pizza Bandits - Several pizza parlors in California have been robbed. Thought to be work of a gang and officials are searching for them.\n- Lost Love cases - RS quickly profiles lost loves cases. They have updates to them and he quickly profiles a few more.\n- Danny Williams was found dead of a bullet wound in his home. His father is convinced he was murdered but police think suicide.\n- Final Appeal: Frederick Young - He was convicted of robbery and sentenced to a very long prison term. He claims his twin Cedric is the actual robber.\n- Tony Lombardi found dead in his bed of a gunshot wound. Police say suicide but his mother says murder. (I realize this was on a previous volume but this one has a scene that Lifetime edited out).\n- NBC episode 5/3/89 - Cases on this complete episode include Julie Cross, - Ron Rushton, Bicycle bandit, Kathy Powers, French Aviators\n- Elmer Locker Jr. is wanted on drug related charges. He has skipped town and his elderly parents (who bailed him out) are in danger of losing their home.\n- Sheldon Weinberg and his sons perpetrated the largest Medicaid fraud in history. They were all convicted and now Sheldon is on the run.\n- Dale Williams went missing after receiving a call to help a stranded motorist. His truck was found 6 weeks later in the water but no sign of him.\n- Joey Moss, 6 years old, was abducted by his father. His mother is searching for him.\n- James White was driving drunk and hit John &amp; Virginia Constable, killing them both. He is now on the run.\n- Zodiac/Unabomber - Are they one and the same?\n- William Jordan has been on the run for many years. He was convicted of the murder of James Rouse Jr.\n- Final Appeal: Rick McCue - He was convicted of the murder of Aileen Corsheune. He claims he is innocent.\n- Leah Roberts - Leaves without telling her family or friends where she's going. Nine days later her wrecked car is found across the US but no sign of her.\n- Angela Maher was an advocate against drunk driving when she was hit and killed by drunk driver Gloria Shulz. She has disappeared and police are searching for her.\n- Jim Rice - wealthy businessman living on St. Croix has disppeared. His wife, Astarte Davis-Rice is a suspect.\n- Dr. Ian Browning predicts earthquakes.\n\nVideo Attributes:\n  Video compression mode: MPEG-1\n  TV system: 525/60 (NTSC)\n  Aspect Ratio: 4:3\n  Source picture resolution: 352x240 (525/60)\n  Frame Rate: 30.00\n  Bitrate: 4.11Mbps\t\t\n\nIf you need more information or want to discuss the cases you can do it on this excellent forum: http://www.sitcomsonline.com/boards/forumdisplay.php?f=322\nSpecial thanks to crystaldawn who is a UM genius.\n","torrent":{"xt":"urn:btih:9db30050e0cd65e1da500ba5824da75d2ee61b6b","amp;dn":"Unsolved+Mysteries+Disc+13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9db30050e0cd65e1da500ba5824da75d2ee61b6b","infoHashBuffer":{"type":"Buffer","data":[157,179,0,80,224,205,101,225,218,80,11,165,130,77,167,93,46,230,27,107]},"announce":[],"urlList":[]}}