{"title":"The Doctor's Pet by Loki Renard {BooksDeityTEAM}","uid":14454827,"size":447250,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9db9c4bec93e2d929c2fbddf57dbeacab5f2ae3a&amp;dn=The+Doctor%27s+Pet+by+Loki+Renard+%7BBooksDeityTEAM%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BooksD","files":2,"time":1461785574,"description":"Tessa is sick and tired of working both day and night shifts at her nursing job in order to keep up with not only her own bills, but those of her wildly irresponsible little brother as well. To make matters worse, when she has the opportunity to interview with the tall, handsome new surgeon at St. Heaths, Dr. Kirk Saunders, she is so stressed that she ends up treating him disrespectfully. Certain that she has blown her opportunity, Tessa is shocked when the doctor escorts her into his private office, bares her bottom, and gives her the first spanking of her life. During the painful, embarrassing punishment, Kirk informs her that if she is going to work under him, her insubordinate attitude isn’t going to be tolerated and she will be expected to submit to his guidance, control, and discipline. The doctor’s firm hand and stern chastisement satisfy a deeply buried need that Tessa has long sought to hide even from herself, and before she knows it she is agreeing not only to work for him, but to accept his particular form of dominance outside of the office as well. After bringing her to his home, Kirk explains that he plans to train her to be his obedient, well-loved pet, and soon she is wearing a leash—and even more embarrassingly, a tail—and learning to do exactly as she is told. Though the entire arrangement leaves her blushing with shame, Kirk’s absolute command of her body also excites Tessa far beyond anything she has ever experienced. But despite the pleasure and comfort Tessa finds in Kirk’s strong arms, her financial and family problems still exist, and she is convinced that telling him about her struggles will only cause him to leave her. When Kirk finds out that she has been lying to him, can he find a way to prove to Tessa that no matter how badly she behaves—and no matter how thorough and humiliating the resulting punishment may be—she will always be his cherished pet. \r\n\r\n\r\n                         ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n\r\n                          Visit us for more Awesome ebooks             \r\n\r\n                               http://booksdeity.com/\r\n \r\n                         **********************************","torrent":{"xt":"urn:btih:9db9c4bec93e2d929c2fbddf57dbeacab5f2ae3a","amp;dn":"The+Doctor%27s+Pet+by+Loki+Renard+%7BBooksDeityTEAM%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9db9c4bec93e2d929c2fbddf57dbeacab5f2ae3a","infoHashBuffer":{"type":"Buffer","data":[157,185,196,190,201,62,45,146,156,47,189,223,87,219,234,202,181,242,174,58]},"announce":[],"urlList":[]}}