{"title":"Tori Amos - Abnormally Attracted To Sin [Vinyl-180g]-nettz","uid":5970987,"size":1511418387,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9e29dd563b39000d41bac15834eb198961f1d691&amp;dn=Tori+Amos+-+Abnormally+Attracted+To+Sin+%5BVinyl-180g%5D-nettz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"insinuendo","files":27,"time":1290279938,"description":"Tori Amos - Abnormally Attracted to Sin (2009) 24-Bit/96-kHz Vinyl Rip\nPosted By : nettz | Date : 12 Nov 2010 06:45:34 |\n\n\n\nTori Amos - Abnormally Attracted to Sin\nVinyl Rip in 24-Bit/96-kHz | FLAC tracks | Full Scan Covers | MU, RS | 1.45 GB 3% recovery\n2009 | Genre: Pop/Rock, Alternative Rock | Label: Universal Republic | 1-522 | US pressing, double LP 180 gr\nReached #9 on The Billboard 200 (2009)\n\n\nAbnormally Attracted to Sin is the tenth studio album by singer-songwriter Tori Amos. It debuted on Billboard 200s top ten list, at #9, making it the artists seventh album to do so. It is also the artists first release under her deal with Universal Republic Records, following the end of her contract with Epic Records, and can be cited as the first non-conceptualized and self-proclaimed personal album by the singer-songwriter in over 10 years.\n(wikipedia)\n\nWhat Tori Amos has struggled to do over the past decade is strike a balance between her mile-wide self-indulgent streak and her equally boundless creative ambition, and that problem has diminished her reputation as one of her generations headiest artists. Since 1999s To Venus and Back, it has become difficult for anyone outside of her ever-diminishing cult following to endure her cloying wordplays, not to mention her obtuse, structurally unstable album concepts that require more ontological research than a philosophy students graduate dissertation. Still, even at her most fey and insufferable (her flat-out creepy recitation of 97 Bonnie and Clyde from Strange Little Girls or the entirety of the deadly-dull The Beekeeper), there has been something admirable about Amos willingness to challenge conventional notions of the types of ideas and expectations a pop artist can incorporate into his or her work.\nThat said, its a genuine relief that Abnormally Attracted to Sin lacks the cumbersome structural conceit of Scarlets Walk or the dissociative identity disorder of American Doll Posse. Rather than suffocating her songs under a pretentious broad construct, here Amos allows them to stand on their own merits and, in turn, demonstrates the superior craft upon which she first made her name. Sin simply offers the finest batch of songs she's written since 1997s extraordinary From the Choirgirl Hotel.\n\nWhat impresses most about the set is that, even without a formally defined concept, the album emerges as a thoughtful, dense exploration of matters of faith, sanctimony, and vice. From the sultry Strong Black Vine, on which Amos struggles to reconcile her love-hate relationship with her religious upbringing, to Maybe California, a frankly stunning plea from one mother to another who is contemplating suicide, the ideas and images in play are complicated and prickly. The subversion of traditional Christian iconography on opener Give, with its Some give blood/I give love refrain, favorably recalls some of the best known material from Little Earthquakes, while Flavor cribs its critical choice between fear and love from Donnie Darkos would-be evangelist.\n\nEven when Amos is writing songs as strong as Not Dying Today and Fast Horse, which boast two of the albums standout melodic hooks, Amoss self-indulgence does get the better of her. At 17 songs and well over 70 minutes, Sin reaffirms that the artist still desperately needs to develop an internal editor. Cutting a handful of songs would make for a less trying and more effective listen: Ophelia smacks of pandering to the angst-ridden teen girl demo that has long been one of Amoss main constituencies, while the break up/make up couplets from That Guy are obnoxious. But even with its bloated running time, Sin is more thematically satisfying and sonically adventurous than anything Amos has recorded in years.\n(Jonathan Keefe - Slant Magazine, May 2009)\n\nTrack Listing:\n\nA1. Give\nA2. Welcome to England\nA3. Strong Black Vine\nA4. Flavor\nA5. Not Dying Today\nB1. Maybe California\nB2. Curtain Call\nB3. Fire to Your Plain\nB4. Police Me\nC1. That Guy\nC2. Abnormally Attracted to Sin\nC3. 500 Miles\nC4. Mary Jane\nD1. Starling\nD2. Fast Horse\nD3. Ophelia\nD4. Lady in Blue\n\n\n\nTechnical Info\nTurntable: Roksan Radius III\nTonearm: Audioquest PT-9\nCartridge: Ortofon X5-MC (Moving Coil)\nPhono Cable: Van den Hul D-502 Hybrid\nPre-amplifier: Counterpoint SA 5.1 (vacuum tube Sovtek 6922)\nInterconnect: balanced, Belden 1813A cable with Neutrik XLR connectors\nAnalog to Digital Converter: EMU 1212M (configured for balanced input +4dBu, 0 dB Gain)\nCapture software: Goldwave 5.52\nPost processing: ClickRepair, setting: 10, reverse, wavelet x3\nRipping policy: I always rip good condition vinyl so that the amount of click/pop will be almost none","torrent":{"xt":"urn:btih:9e29dd563b39000d41bac15834eb198961f1d691","amp;dn":"Tori+Amos+-+Abnormally+Attracted+To+Sin+%5BVinyl-180g%5D-nettz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e29dd563b39000d41bac15834eb198961f1d691","infoHashBuffer":{"type":"Buffer","data":[158,41,221,86,59,57,0,13,65,186,193,88,52,235,25,137,97,241,214,145]},"announce":[],"urlList":[]}}