{"title":"Steph Sweeney - Your Favorite Girl (YFG Series)","uid":9013544,"size":530011,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1dcb7cd1e1f214458b1b43ca5f63247afb63b2f&amp;dn=Steph+Sweeney+-+Your+Favorite+Girl+%28YFG+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kiralou","files":2,"time":1381152200,"description":"Publication Date: May 13, 2013\n\nWARNING: This book contains explicit sexual content, violence, language, drug use, dark themes, and situations with non-consentual sex. It is intended for adults only.\n\nWhen Melissa Reed, a twenty-two-year-old housewife, discovers her millionaire husband Ted has been cheating on her with a recent high school graduate from down the street, she begins to investigate his private life. In his little black book, she finds a single address and phone number: that of Your Favorite Girl, Inc.\n\nAssuming it's an escort service, Melissa gives them a call, only to find she's stumbled upon a secret corporation dedicated to engineering the most erotic sexual creatures in the history of man. She makes an appointment. Then she makes a purchase.\n\nWhen her order arrives that evening, Melissa makes another bad decision that leaves her husband dead and the company out for her blood.\n\nNow she's being held captive by the company's executives, and she doesn't know what she'll have to do to stay alive.\n\nYour Favorite Girl is best described as an erotic romance thriller, the first in a three-part series.","torrent":{"xt":"urn:btih:a1dcb7cd1e1f214458b1b43ca5f63247afb63b2f","amp;dn":"Steph+Sweeney+-+Your+Favorite+Girl+%28YFG+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1dcb7cd1e1f214458b1b43ca5f63247afb63b2f","infoHashBuffer":{"type":"Buffer","data":[161,220,183,205,30,31,33,68,88,177,180,60,165,246,50,71,175,182,59,47]},"announce":[],"urlList":[]}}