{"title":"Maurice [Merchant and Ivory] [Gay Interest]","uid":4108331,"size":1467179008,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a1f0d4d2df50d45b175e46eb6a4cb0cc402de0ce&amp;dn=Maurice+%5BMerchant+and+Ivory%5D+%5BGay+Interest%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"TNK08","files":2,"time":1206917165,"description":"Summary:\n\nSet against the stifling conformity of pre-World War I English society, E.M. Forster&amp;#039;s Maurice is a story of coming to terms with one&amp;#039;s sexuality and identity in the face of disapproval and misunderstanding. Maurice Hall (James Wilby) and Clive Durham (Hugh Grant) find themselves in love at Cambridge. In a time when homosexuality was punishable by imprisonment, the two must keep their feelings for one another a complete secret, even though Clive refuses to allow their relationship to move beyond the boundaries of &quot;platonic&quot; love. After a friend is arrested and disgraced for &quot;the unspeakable crime of the Greeks,&quot; Clive abandons his forbidden love, marries, and enters into the political arena. Maurice, however, struggles with questions of his identity and self-confidence, even seeking the help of a hypnotist to rid himself of his undeniable urges. But while staying with Clive and his shallow wife, Anne, Maurice is seduced by the affectionate and yearning servant Alec Scudder, (Rupert Graves), an event that brings about profound changes in Maurice&amp;#039;s life and outlook. Sparking direction by James Ivory, a distinguished performance from the ensemble cast, and a charged score by Richard Robbins all combine to create a film of undeniable power, one that is both romantic and moving, and a story of love and self-discovery for all audiences.\n\n\nDon&amp;#039;t forget to seed when you are done!","torrent":{"xt":"urn:btih:a1f0d4d2df50d45b175e46eb6a4cb0cc402de0ce","amp;dn":"Maurice+%5BMerchant+and+Ivory%5D+%5BGay+Interest%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1f0d4d2df50d45b175e46eb6a4cb0cc402de0ce","infoHashBuffer":{"type":"Buffer","data":[161,240,212,210,223,80,212,91,23,94,70,235,106,76,176,204,64,45,224,206]},"announce":[],"urlList":[]}}