{"title":"TINTIN 2011 RMVB GLOBE","uid":6815786,"size":246628087,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a204c47b84d96a1b9ac51eaa81858dd6e10f8f2b&amp;dn=TINTIN+2011+RMVB+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1321197682,"description":"*  RMVB CAM  * 01h39m32S  * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* RECOMMENDED PLAYERS :\n\n\n- RMVB PLAYER or - MEDIACOPE \n\nor convert to your prefered video type for any other player\n\n\n* INTRO :\n\nThe Adventures of Tintin (also known as The Adventures of Tintin: The Secret of the Unicorn) is a 2011 American performance capture 3D film based on The Adventures of Tintin, a series of comic books created by Belgian artist HergÃƒÂ© (Georges Remi). Directed by Steven Spielberg, produced by Peter Jackson, and written by Steven Moffat, Edgar Wright and Joe Cornish, the film is based on three of the original comic books: The Crab with the Golden Claws (1941), The Secret of the Unicorn (1943), and Red Rackham's Treasure (1944).\n\n\n* Plot :\n\nTintin, a young journalist, and his dog Snowy, are browsing in an outdoor market in a European town. Tintin buys a model of a three-masted sailing ship, the Unicorn, for a good price, but is then immediately accosted by the sinister Ivan Ivanovitch Sakharine, and the mysterious figure of Barnaby, who both try to buy the model from Tintin, without success. Tintin takes the ship home, but it is broken during a fight between Snowy and a neighbour's cat. As it breaks, a parchment scroll slips out of the ship's mast. Snowy spots it but is unable to alert Tintin. Meanwhile, incompetent detectives Thomson and Thompson are on the trail of a pickpocket, Aristides Silk. Tintin visits Sakharine in Marlinspike Hall, where he learns that there are at least two model ships.\n\nLater, Tintin is shot at, then abducted by accomplices of Sakharine, and imprisoned on the SS Karaboudjan. On board, Tintin escapes and meets the ship's nominal captain, Haddock. Haddock has been supplied with whisky by first mate Allan, who is working for Sakharine, and the captain is permanently drunk, and doesn't know what's happening on board his ship. Tintin and Haddock (and Snowy) eventually escape from the Karaboudjan in a lifeboat. Sakharine sends a seaplane to find them, but Tintin is able to capture the plane, and fly towards the (fictitious) Moroccan port of Bagghar, but they crash in the desert.\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2011","torrent":{"xt":"urn:btih:a204c47b84d96a1b9ac51eaa81858dd6e10f8f2b","amp;dn":"TINTIN+2011+RMVB+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a204c47b84d96a1b9ac51eaa81858dd6e10f8f2b","infoHashBuffer":{"type":"Buffer","data":[162,4,196,123,132,217,106,27,154,197,30,170,129,133,141,214,225,15,143,43]},"announce":[],"urlList":[]}}