{"title":"An Introduction to Clinical Research [PDF] [StormRG]","uid":10198569,"size":1512343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a20a92a9e84daa9ba8586e1a0a4bfc3134306527&amp;dn=An+Introduction+to+Clinical+Research+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0xmovva","files":-1,"time":1400729380,"description":"Author: Piers Page, William Eardley, James Carr , David Chadwick, Keith Porter\nSeries: Success in Medicine\nPaperback: 224 pages\nPublisher: Oxford University Press; 1 edition (January 13, 2012)\nLanguage: English\nISBN-10: 0199570078\nISBN-13: 978-0199570072\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.\nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nThis practical book is written specifically for junior doctors by a team of highly experienced authors, as an introductory guide to clinical research. It covers all areas that a junior doctor needs to consider, including funding, study design, ethics, data analysis, disseminating findings, and furthering one's research career. It presents a balance view of clinical research and is written by authors actively involved in clinical research both at the 'coal-face' and at a more supervisory level.\n\nResearch can be a difficult process and it is essential to make sure that the project is set up in the correct way in order to get verifiable results. This easy-to-read guide is available to help junior doctors develop a good study design and present evidence of a sound academic practice, which will make obtaining funding more likely and be time-efficient. Getting started early in research and developing a solid, gradual understanding of clinical research through using this approachable book will be of huge benefit to junior doctors and their discipline.","torrent":{"xt":"urn:btih:a20a92a9e84daa9ba8586e1a0a4bfc3134306527","amp;dn":"An+Introduction+to+Clinical+Research+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a20a92a9e84daa9ba8586e1a0a4bfc3134306527","infoHashBuffer":{"type":"Buffer","data":[162,10,146,169,232,77,170,155,168,88,110,26,10,75,252,49,52,48,101,39]},"announce":[],"urlList":[]}}