{"title":"Signs of Life v0.25.1","uid":9585968,"size":270099154,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a2d8054fdd00198018410b717bd24f5696299679&amp;dn=Signs+of+Life+v0.25.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Betelo","files":1,"time":1391824357,"description":"About the Game \n\nSigns of Life is a sci-fi survival sandbox platformer with a combination of procedurally generated and hand-crafted content. You'll explore mysterious locations, Mine blocks for resources, and meet strange (and some familiar) creatures, some of which don't even want to kill you and eat your corpse. Along the way, you'll be able to craft armor, weapons, gadgets and more to assist you in surviving in an inhospitable environment. \n\nChange Log:\n\nVersion 0.25.1\n- Fixed a crash related to changing resolutions\n\nVersion 0.25\n- Upped drop rate of biofuel on pupa and saltpeter on larval eggs, increased the at-generation amount of pupa/larval eggs, and increased the spawn rate of pupa/larval eggs. We likely will need to do more with the way the pupa/eggs spawn as they are still too hard to find (they only spawn on mud).\n- Doubled the length of the spitter melee DoT, halved the damage.\n- Fixed a bug that was causing container positions to not persist\n- Possible fix for some graphics artifacting\n- Added new mob underground that floats over to ya and pops.\n\nVersion 0.24\n- Added Assault Rifle and recipe (Requires plastic and silver, better recipe eventually)\n- Added Rifle ammo (Requires lead, copper and plastic)\n- UI element positions are now saved between sessions\n- Ammo type/ammo in clip now saved between sessions\n- Added brick/mud brick smelting recipes\n- Added feedback effects for when melee weapons hit blocks\n- Misc work on weapon effects\n- Fixed an exploit/bug with crossbow ammo\n- Fixed minor artifacting on asteroids on main menu","torrent":{"xt":"urn:btih:a2d8054fdd00198018410b717bd24f5696299679","amp;dn":"Signs+of+Life+v0.25.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2d8054fdd00198018410b717bd24f5696299679","infoHashBuffer":{"type":"Buffer","data":[162,216,5,79,221,0,25,128,24,65,11,113,123,210,79,86,150,41,150,121]},"announce":[],"urlList":[]}}