{"title":"BoundGods--BG-40104 Sebastian Keys, JJ Knight and Brogan Reed Hi","uid":14646831,"size":2537648358,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:a3552b8099b9b7eedcc0c08755a7aced811c6e18&amp;dn=BoundGods--BG-40104+Sebastian+Keys%2C+JJ+Knight+and+Brogan+Reed+Hi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":2,"time":1463597158,"description":"\nPatient and Nurse Battered and Ass Fucked by Sadistic Doctor and His 10 inch Cock\r\n\r\nMay 12, 2016 - Performers: Sebastian Keys ,  JJ Knight  and  Brogan Reed \r\n\r\n\r\nHi and HD MP4.\r\n\r\n\r\nBrogan Reed is having problems with his cock, and decides to visit Dr. JJ Knight and his assistant Nurse Sebastian Keys. After rigorous testing, Dr. Knight concludes that the best solution is to attack Brogan's erection until it goes down. Nurse Keys grabs Brogan, while Dr. Knight beats Brogan's hard cock, using his hands, and a crop. Dr. Knight pulls out his ten inch cock and shoves it down Brogan's mouth. Dr. Knight's new patient takes all ten inches in his throat, until the doctor can't restrain himself, and fills Brogan's mouth with hot cum. Nurse Keys wants some sloppy seconds, and ties Brogan to the bed before sticking his stiff cock down Brogan's throat. Dr. Knight decides that only he can treat the patient, and proceeds to savagely beat Brogan and Nurse Keys with a crop. Nurse Keys dreams of the doctor in a maxcita sleep slack, while he and Brogan lick all over the doctor's luscious dick. Nurse Key's awakens from the sweet dream, and finds himself in a padded cell next to Brogan. Dr. Knight towers over his bound nurse and patient. The vengeful doctor paddles Nurse Keys and Brogan as they grovel on the floor. Dr. Knight then chains them to the ceiling, and brutally flogs them until they cry for mercy. Dr. Knight lets them down and then presses them against the wall. The three form a fuck train as Dr. Knight thrusts his massive cock in Nurse Keys' ass, while Nurse Keys butt fucks Brogan against the wall. Nurse Keys wants even more cock, and takes both Dr. Knight and Brogan's dicks up his ass simultaneously. The intense double penetration leads Nurse Keys to shoot his sticky cum all over Dr. Knight's chest. Dr. Knight pushes the nurse off his cock and bends Brogan over to fuck the cum out of him. Brogan takes Dr. Knights thick dick up his ass while Nurse Keys strokes the cum from his cock. Dr. Knight then pulls Nurse Keys and Brogan to the floor, where he showers their faces with his cum.\r\n\r\nScreens \nhttp://www.boundgods.com/site/shoot.jsp?shootId=40104\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttps://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:a3552b8099b9b7eedcc0c08755a7aced811c6e18","amp;dn":"BoundGods--BG-40104+Sebastian+Keys%2C+JJ+Knight+and+Brogan+Reed+Hi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3552b8099b9b7eedcc0c08755a7aced811c6e18","infoHashBuffer":{"type":"Buffer","data":[163,85,43,128,153,185,183,238,220,192,192,135,85,167,172,237,129,28,110,24]},"announce":[],"urlList":[]}}