{"title":"Sacred Formulas of the Cherokees-J Mooney(2010) pdf","uid":11167279,"size":996120,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a35ed9096dc33e8df4083f77549f37591738a893&amp;dn=Sacred+Formulas+of+the+Cherokees-J+Mooney%282010%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eboneezer","files":-1,"time":1412646429,"description":"Publisher: BiblioLife (April 30, 2009)\nISBN-10: 0559121326\nISBN-13: 978-0559121326 \nPages-164\n\n James Mooney (1861-1921) was an American ethnographer who lived for several years among the Cherokee. He worked on major studies of Southeastern Indians, as well as those on the Great Plains. In 1885 he began working with the Bureau of American Ethnology at Washington, D.C. The Sacred Formulas of the Cherokees Seventh Annual Report of the Bureau of Ethnology to the Secretary of the Smithsonian Institution, 1885-1886 contains selected from a collection of about six hundred, obtained on the Cherokee reservation in North Carolina. Subjects include medicine, love, hunting, fishing, war, self-protection, destruction of enemies, witchcraft, the crops, the council, the ball play. They formulas embody almost the whole of the ancient religion of the Cherokees.\n  \n This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally important and have elected to bring the book back into print as part of our continuing commitment to the preservation of printed works worldwide. This text refers to the Bibliobazaar edition.","torrent":{"xt":"urn:btih:a35ed9096dc33e8df4083f77549f37591738a893","amp;dn":"Sacred+Formulas+of+the+Cherokees-J+Mooney%282010%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a35ed9096dc33e8df4083f77549f37591738a893","infoHashBuffer":{"type":"Buffer","data":[163,94,217,9,109,195,62,141,244,8,63,119,84,159,55,89,23,56,168,147]},"announce":[],"urlList":[]}}