{"title":"My.Dream.Home.s03e01.PDTV.x264.Hector.mp4","uid":9672752,"size":389237173,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a58832d14790300b1da2c881c8b7afcb179dff99&amp;dn=My.Dream.Home.s03e01.PDTV.x264.Hector.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GaryBradbury2012","files":-1,"time":1393498215,"description":"This show is also called &quot;Property Brothers&quot; in some countries. In Australia it is called &quot;My Dream Home&quot;\n\nParalyzed by indecision and tired of renting, Kristi and Jay are desperate to buy a new house. The Property Brothers come to the rescue and help them find a budget-friendly dream home that can be renovated on time. With a budget that doesn't match their expectations, Drew and Jonathan struggle to sell the potential of a fixer-upper. The couple quickly decides between two major renovation projects, and Drew works fast to negotiate the deal. Jonathan gets right to work, but the couple wants everything done a mach-speed and pressures Jonathan to fast-track the renovation. When an ominous home inspection reveals terrible problems, Jonathan's budget takes a hit and he only has five weeks to complete the job. To make matters worse, he notices a ceiling sag that could mean big structural problems. A host of other serious issues threaten the budget and timeline. And while every nasty surprise makes frugal Jay's blood boil, Kristi still wants to spend, spend, spend!","torrent":{"xt":"urn:btih:a58832d14790300b1da2c881c8b7afcb179dff99","amp;dn":"My.Dream.Home.s03e01.PDTV.x264.Hector.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a58832d14790300b1da2c881c8b7afcb179dff99","infoHashBuffer":{"type":"Buffer","data":[165,136,50,209,71,144,48,11,29,162,200,129,200,183,175,203,23,157,255,153]},"announce":[],"urlList":[]}}