{"title":"The.Tangerine.Dream.DVDRip.XviD-Morphy[Ski Movie]","uid":4096812,"size":734179328,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a7fe6d2e7866fb4cf40a91089188e7d5da8bd681&amp;dn=The.Tangerine.Dream.DVDRip.XviD-Morphy%5BSki+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"carL^","files":1,"time":1206366150,"description":"JEEP presents a 16mm Ski &amp; Snowboard Film by Teton Gravity Research\nThe Tangerine Dream is a film that represents 10 years of broken down trucks, whiskey bottles, wanderlust and the most down and dirty skiing and boarding you have ever seen.\n\nThis rusty orange story is about the origins of TGR, outlaw athletes and the ragged lifestyle that has kept this posse?s dream and way of life alive. The movement is stronger than ever with Nobis accomplishing the impossible in Alaska, the Olenicks taking their park skills to AK, Jeremy Jones straight-lining 50 degree spine walls, Sage fusing style and big mountain and Dana Flahr emerging as a dominate force in s kiing. This vagabond tale will take you through the lifestyle of skiing and the passion that continues to change the face of the sport.\n\nTake a ride in the orange truck that started it all on a rowdy road trip through India, Turkey, Switzerland, France, Alaska, Aspen, Utah, Montana, California and Jackson Hole.\n\nStarring: Sage Cattabriga-Alosa, Jeremy Jones, Chris Collins, Micah Black, Marc-Andre Belliveau, Victoria Jealouse, Jeremy Nobis, Peter Olenick, Michel Olenick, Ryan Oakden, Dana Flahr, Dylan Hood, Dash Longe, Erik Roner, Skogen Sprang, Travis Rice, Candide Thovex, Karina Hollekim, Will Burks, many more...\n\nLocations: India, Turkey, Switzerland, France, Aspen, Utah, Montana, California, &amp; Jackson Hole.\n\n\nENJOY!","torrent":{"xt":"urn:btih:a7fe6d2e7866fb4cf40a91089188e7d5da8bd681","amp;dn":"The.Tangerine.Dream.DVDRip.XviD-Morphy%5BSki+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7fe6d2e7866fb4cf40a91089188e7d5da8bd681","infoHashBuffer":{"type":"Buffer","data":[167,254,109,46,120,102,251,76,244,10,145,8,145,136,231,213,218,139,214,129]},"announce":[],"urlList":[]}}