{"title":"Unlocking the Emotional Brain - Bruce Ecker","uid":14558248,"size":1805498,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a843201c58d2d5550c3d5681603619ae052073a1&amp;dn=Unlocking+the+Emotional+Brain+-+Bruce+Ecker&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1462710495,"description":"Psychotherapy that regularly yields liberating, lasting change was, in the last century, a futuristic vision, but it has now become reality, thanks to a convergence of remarkable advances in clinical knowledge and brain science. In Unlocking the Emotional Brain, authors Ecker, Ticic and Hulley equip readers to carry out focused, empathic therapy using the process found by researchers to induce memory reconsolidation, the recently discovered and only known process for actually unlocking emotional memory at the synaptic level. Emotional memory's tenacity is the familiar bane of therapists, and researchers have long believed that emotional memory forms indelible learning. Reconsolidation has overturned these views. It allows new learning to erase, not just suppress, the deep, unconscious, intensely problematic emotional learnings that form during childhood or in later tribulations and generate most of the symptoms that bring people to therapy. Readers will learn methods that precisely eliminate unwanted, ingrained emotional responses—whether moods, behaviors or thought patterns—causing no loss of ordinary narrative memory, while restoring clients' well-being. Numerous case examples show the versatile use of this process in AEDP, Coherence Therapy, EFT, EMDR and IPNB","torrent":{"xt":"urn:btih:a843201c58d2d5550c3d5681603619ae052073a1","amp;dn":"Unlocking+the+Emotional+Brain+-+Bruce+Ecker","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a843201c58d2d5550c3d5681603619ae052073a1","infoHashBuffer":{"type":"Buffer","data":[168,67,32,28,88,210,213,85,12,61,86,129,96,54,25,174,5,32,115,161]},"announce":[],"urlList":[]}}