{"title":"Joey Ramone","uid":4110895,"size":79189385,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a88c77df672c77d808a603a0a64ab1c2ecb2532f&amp;dn=Joey+Ramone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Ekv2000","files":16,"time":1207055240,"description":"Joey Ramone was one of the two original members of the Ramones who stay out in the band throughout there whole career. Originally the drummer of the band, while Dee Dee was supposed to be the singer and bass player he switched to singing when the band noticed Dee Dee couldnt play and sing at the same time. With an unorthodox singing style, he never had any musical schooling, he was able to influence and perhaps the main voice of how a punk band should sound. Maybe the best recognition to this came from Joe Strummer, the singer from The Clash, who on several occasion said it was Joeys singing that inspired his.\n\nJoey Ramone died of lymphoma on April 15 2001. He was listening to a U2 song, In a little while, while he passed away.\n\nAlthough never actually going solo as Dee Dee Ramone did, Joe still took time to make some solo projects in between and after Ramones. He made 3 EP and a couple of singles, mostly work with friends. After his deaths a full length CD was released as a celebration of his memory with several of this tracks on it. This is the solo record. \n\nAlthough Joey was the songwriter and the singer of Ramones this record is not even close to the sound of Ramones even if you can hear Ramones in the back so to say.\n\n   1. What a Wonderful World  Bob Thiele, George David Weiss\n   2. Stop Thinking About It  Joey Ramone, Andy Shernoff\n   3. Mr. Punchy  Joey Ramone\n   4. Maria Bartiromo  Joey Ramone\n   5. Spirit in My House  Joey Ramone\n   6. Venting (Its a Different World Today) Joey Ramone\n   7. Like a Drug I Never Did Before  Joey Ramone\n   8. Searching for Something  Joey Ramone, Al Maddy\n   9. I Got Knocked Down (But Ill Get Up)  Joey Ramone\n  10. 1969  Dave Alexander, James Iggy Pop Osterberg, Ron Asheton, Scott Asheton\n  11. Dont Worry About Me  Joey Ramone\n","torrent":{"xt":"urn:btih:a88c77df672c77d808a603a0a64ab1c2ecb2532f","amp;dn":"Joey+Ramone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a88c77df672c77d808a603a0a64ab1c2ecb2532f","infoHashBuffer":{"type":"Buffer","data":[168,140,119,223,103,44,119,216,8,166,3,160,166,74,177,194,236,178,83,47]},"announce":[],"urlList":[]}}