{"title":"Galaxy Admirals (Early Access)","uid":13034287,"size":92197569,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a9f0ae8cc0bad9c4e50203b1c2ce8f3c9bd23e5e&amp;dn=Galaxy+Admirals+%28Early+Access%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1450461505,"description":"GALAXY ADMIRALS\r\nis a multiplayer turn-based cosmic strategy. Improve your command skills with AI and conquer the whole universe by fighting with real players.\r\n\r\nMULTIPLAYER\r\n\r\nWhen you learn to run the game and learn all the types of the spaceships as well as their features, you can measure swords with other players. Only by playing against real adversaries, you can show all your talents and skills far and wide.\r\n\r\nGAMEPLAY\r\n\r\nOn a hexagonal field there are two military bases – one of yours and another of your adversary. By consuming a special kind of game resource in the base there are produces combat spaceships. The resource is renewable and being renewed along with each player’s move.\r\n\r\nAfter each move the field of play is rotated around the central cell. This fact influences the gameplay very much: the situation changes continuously and it is very difficult to foresee what will be the next.\r\nYour short-term goal is to destroy the enemy base.\r\n\r\nThat’s a real challenge for your brain training your ability for tactics and combinatorics.\r\n\r\nFEATURES\r\n\r\n- Specific gameplay. The situation changes constantly because of rotating the field of play. You have to adapt yourself to new circumstances permanently. Only he that can adapt himself to the ever-changing cosmos, will survive and come off victorious.\r\n\r\n- Unusual system of skills gives free scope to your imagination. By combining various skills and forming different combinations, you will get a wide range of tricks and tactical maneuvers.\r\n\r\n- Each mission has a plot. It’s very fascinating to replay them again and again. The initial whereabouts of objects on the playing field is generated randomly. You always get into a new battle situation which is unique.\r\n\r\n- The strong AI will not let you be bored during the whole game. It can be joyful, angry and get surprised showing this in its messages to you.\r\n\r\n- 1 race, each one have 10+ ships to build and even more special abilities to use","torrent":{"xt":"urn:btih:a9f0ae8cc0bad9c4e50203b1c2ce8f3c9bd23e5e","amp;dn":"Galaxy+Admirals+%28Early+Access%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9f0ae8cc0bad9c4e50203b1c2ce8f3c9bd23e5e","infoHashBuffer":{"type":"Buffer","data":[169,240,174,140,192,186,217,196,229,2,3,177,194,206,143,60,155,210,62,94]},"announce":[],"urlList":[]}}