{"title":"Arctic Monkeys - Leave Before the Lights Come On [promo].VOB","uid":9423918,"size":281370624,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:aa0d3be3e0cab8115171ae28ba555fe5427abb7c&amp;dn=Arctic+Monkeys+-+Leave+Before+the+Lights+Come+On+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1388647577,"description":"Arctic Monkeys - Leave Before the Lights Come On [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Leave Before the Lights Come On&quot; is a song by English indie rock band Arctic Monkeys. The song was released on 14 August 2006 as the band's third single in the United Kingdom. The song was not included on the band's debut album Whatever People Say I Am, That's What I'm Not, though Alex Turner has stated that it could have been on the album as it follows a similar theme to many of the album tracks. It was the band's final release before promotion began for their second album Favourite Worst Nightmare in Spring 2007. However, it was not included on their second album either. The single's release was confirmed on the band's website on 6 July 2006, and that the track would be released on Monday, 14 August, on 3 track CD and 2 track 7&quot; vinyl.\n\nThe video was released on the band's website on 3 August 2006. It was directed by John Hardwick, who was also at the helm for the video for &quot;M.O.R.&quot; for the band Blur. The video was filmed in Sheffield in the Cultural Industries Quarter in July 2006 and features actors Kate Ashfield of Shaun of the Dead fame and Paddy Considine of In America and Cinderella Man. The video starts off with Ashfield on the top of a building (the Showroom Cinema) about to jump off. She drops her shoe as Considine is walking in the street below. He sees Ashfield and immediately runs to the top of the building. He puts out his hand then he and Ashfield hug. The two walk to nearby cafe and sit down to have coffee. Ashfield makes an attempt to kiss Considine. He stops her, showing his wedding ring, then walks out of the cafe but she makes an attempt to follow him. He gets her up against a fence and threatens her before walking off. Ashfield then runs back up to the top of the building where she purposely drops her shoe in front of an unsuspecting Matt Helders, strolling along in a t-shirt with the words 'Bang, Bang' on it, a recording company for the Arctic Monkeys, implying the events to be repeated cyclically.\n\nArctic Monkeys are an English indie rock band formed in 2002 in High Green, a suburb of Sheffield. The band consists of Alex Turner (lead vocals, lead/rhythm guitar), Jamie Cook (rhythm/lead guitar), Nick O'Malley (bass guitar, backing vocals), and Matt Helders (drums, backing vocals). Former member Andy Nicholson (bass guitar, backing vocals) left the band in 2006 shortly after their debut album was released.\n\nThe band's debut album became the fastest-selling debut album in British music history, surpassing Elastica's self-titled album and remains the fastest-selling debut album by a group in the UK. The band have won five Brit Awards, winning Best British Group twice, and have twice been nominated for Grammy Awards. The band also won the Mercury Prize for their debut album, in addition to receiving two nominations in 2007 and 2013.\n\nArctic Monkeys were heralded as one of the first group of acts to come to the public attention via the Internet (fan-based sites rather than from the band), with commentators suggesting they represented the possibility of a change in the way in which new bands are promoted and marketed. The band are also regarded as one of the most prominent bands to be part of the post-punk revival in the UK, after achieving commercial success and spawning two number one singles with their debut album.\n(video has a 5 semi-transparent blue dots at the bottom right)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Leave_Before_the_Lights_Come_On&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Leave_Before_the_Lights_Come_On&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/gaFkeAAfl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/gaFkeAAfl&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:53\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.1\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:aa0d3be3e0cab8115171ae28ba555fe5427abb7c","amp;dn":"Arctic+Monkeys+-+Leave+Before+the+Lights+Come+On+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa0d3be3e0cab8115171ae28ba555fe5427abb7c","infoHashBuffer":{"type":"Buffer","data":[170,13,59,227,224,202,184,17,81,113,174,40,186,85,95,229,66,122,187,124]},"announce":[],"urlList":[]}}