{"title":"Fluid Mask3 (Plugin) for Photoshop.","uid":4337967,"size":27211580,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aad4f3ea1792ab93a093c33f8f39748488fba06c&amp;dn=Fluid+Mask3+%28Plugin%29+for+Photoshop.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ivantav","files":7,"time":1218426652,"description":"Photoshop plug-in. Works with CS2 and CS3(+ex)\n\nVertus' amazing cut-out app. Will cut out ANYTHiNG! Hair, shapes within a background of the same color, even cut out sky from behind a tree. All without any of those annoying white edges.\n\nFaster initial image processing\nFor multi-core machines, Fluid Mask 3 runs its initial image processing up to 40% faster. With ever growing image file sizes our everyday image editing tools need to catch up ? Fluid Mask 3 runs faster than ever.\n\nLocalised edge detection and blending\nIt?s a true-ism when cutting out objects from their backgrounds that often 90% of the time is spent on 10% of the image ? getting a difficult edge ?just right?. Fluid Mask 3 now has a set of easy to use tools to isolate a difficult area (in a Patch) and apply alternative edge finding and blending techniques - making easy the tricky parts of image cutting.\n\nIntelligent Edge Blending\nFluid Mask 3 not only finds edges but also understands the width and character of an edge.\n\nOn edges which are largely free of noise and where there is some contrast between foreground and background, Fluid Mask 3's intelligent blending is the only blending around to automatically extract the morphology (character) of an edge - remember there is no such thing as a 6 pixel feather on all edges in real life!\n\nUse feather blending where there is no contrast or lots of noise in an edge. Fluid Mask 3 will still find the correct edge width.","torrent":{"xt":"urn:btih:aad4f3ea1792ab93a093c33f8f39748488fba06c","amp;dn":"Fluid+Mask3+%28Plugin%29+for+Photoshop.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aad4f3ea1792ab93a093c33f8f39748488fba06c","infoHashBuffer":{"type":"Buffer","data":[170,212,243,234,23,146,171,147,160,147,195,63,143,57,116,132,136,251,160,108]},"announce":[],"urlList":[]}}