{"title":"Wilbur Smith - Gdy Poluje Lew (+bonus) [PL]","uid":14161198,"size":1120094227,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ab01a08bfa2910fdfbdcdd2348d037eaed84f470&amp;dn=Wilbur+Smith+-+Gdy+Poluje+Lew+%28%2Bbonus%29+%5BPL%5D+MP3%4048&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"everdarksoul","files":103,"time":1459720852,"description":"Audiobook PL - 36 części /   \r\nrozmiar: 379 MB / czas: 18:24:51\r\nczyta: Leszek Teleszyński\r\n\r\nAfryka Południowa, rok 1870. Wojna zuluska daje początek rodzinnej waśni: serdeczna przyjaźń braci Courtneyów przeradza się w śmiertelną nienawiść, w wyniku czego Sean opuszcza farmę. Po kilku latach jest najbogatszym człowiekiem w Johannesburgu, ale fortuna kołem się toczy...\r\nWojna, dramat i przygoda - groźna i piękna jak afrykański busz. Na tle niespokojnych czasów i w scenerii dzikiej przyrody Afryki, Wilbur Smith w mistrzowski sposób odmalowuje gwałtowną walkę namiętności.\r\n\r\nWydana w 1964 roku &quot;Gdy Poluje Lew&quot;, to powieść dzięki której czytelnicy po raz pierwszy poznali członków rodziny Courtneyów. Jednak na przestrzeni lat, jej pozycja w chronologii wydarzeń kilkukrotnie zmieniała miejsce. Obecnie, jako chronologicznie część pierwszą uznaje się powieść z 1997 - Drapieżne Ptaki.\r\nPonieważ nie została ona jak dotąd wydana w Polsce w wesji audio, jako bonus wstawka zawiera dodatkowo audiobook czytany przez lektora elektronicznego (IVO), oraz plik torrent do pobrania Sagi w e-book - więc wszyscy, którzy &quot;nie trawią&quot; IVO, będą mogli sobie przeczytać tą powieść w e-book, zapisany jako PDF.\r\n\r\nDrapieżne Ptaki:\r\nDruga połowa XVII wieku. Sir Francis Courtney - kapitan kaperskiego statku krążącego w okolicach Przylądka Dobrej Nadziei - zdobywa wyładowaną cennymi towarami fregatę Holenderskiej Kompanii Wschodnioindyjskiej. Wydarzenie to, choć przynosi mu fortunę, jest też początkiem niewoli i tortur prowadzących do śmierci...\r\nSpadkobiercą sir Francisa jest jego syn Henry - wychowany na statku, znający doskonale morskie rzemiosło, świetnie władający szpadą, mądry i szlachetny - już w wieku lat kilkunastu potrafiący wyjść z opresji i wyprowadzić z niewoli towarzyszy. Jest tak charyzmatyczny, że bez trudu zyskuje posłuch u starszych marynarzy i zostaje przywódcą w miejsce ojca. Jego przyjacielem i instruktorem walk jest Aboli - były czarnoskóry niewolnik, którego współplemieńcy pomogą Halowi w kluczowym momencie toczyć bitwę...\r\n\r\nDane: 688 MB / 63x MP3-VBR ~64Kbps / czas: 25:47:17 / czyta: syntezator mowy","torrent":{"xt":"urn:btih:ab01a08bfa2910fdfbdcdd2348d037eaed84f470","amp;dn":"Wilbur+Smith+-+Gdy+Poluje+Lew+%28%2Bbonus%29+%5BPL%5D+MP3%4048","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab01a08bfa2910fdfbdcdd2348d037eaed84f470","infoHashBuffer":{"type":"Buffer","data":[171,1,160,139,250,41,16,253,251,220,221,35,72,208,55,234,237,132,244,112]},"announce":[],"urlList":[]}}