{"title":"[NuruMassage / FantasyMassage] Alexis Adams (Our Favorite Weddin","uid":13907503,"size":407271387,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:abf826a5329fb85aaf822e4fb1818b9643f2f56c&amp;dn=%5BNuruMassage+%2F+FantasyMassage%5D+Alexis+Adams+%28Our+Favorite+Weddin&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"UniX","files":1,"time":1458278841,"description":"[NuruMassage / FantasyMassage] Alexis Adams (Our Favorite Wedding Gift) SD **NEW MARCH 18,2016**\r\n\r\nSCREENS;\r\n \nhttp://imgurx.net/share-AB28_56EB8318.html\r\n\r\nAlexis Adams has just started her new life as a young newlywed housewife. We meet up with her as she's arranging flowers in the kitchen. Her new husband Steven St. Croix is equally settling into their new home, and their new marriage. it's clear they are both a little bored. Steven opens fantasymassage.com and gets to work rubbing out his worries, but the doorbell rings, and Steven finds another wedding gift has finally found them. Alexis opens the box to find something she wasn't expecting. A Nuru Massage Kit specially packaged for couples. Alexis explores the kit and sets it up for Steven. Alexis explains the gift to him, hoping to spice things up a little bit. As things get started, Steven can't resist taking his wife's bra off and sucking on her giant boobs. Alexis strips off her panties, and gets started. she uses the gel to slick up her up her body and rubs it against him sensually, and pampers him and makes sure she gets what she needs at the same time. The gel makes both their sexual hungers rise to a point where they soon can't help but shove Stevens' cock into Alexis' warm mouth and her wet pussy, sliding their bodies and sexual organs together in the gel until they both are sexually exhausted from Alexis' multiple orgasms. Their marriage just got a whole lot more exciting","torrent":{"xt":"urn:btih:abf826a5329fb85aaf822e4fb1818b9643f2f56c","amp;dn":"%5BNuruMassage+%2F+FantasyMassage%5D+Alexis+Adams+%28Our+Favorite+Weddin","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abf826a5329fb85aaf822e4fb1818b9643f2f56c","infoHashBuffer":{"type":"Buffer","data":[171,248,38,165,50,159,184,90,175,130,46,79,177,129,139,150,67,242,245,108]},"announce":[],"urlList":[]}}