{"title":"Columba Marmion - Christ the Life of the Soul (pdf)","uid":10211120,"size":4923619,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac67f37f862797f6e57cf1e455ae4b776260f2c4&amp;dn=Columba+Marmion+-+Christ+the+Life+of+the+Soul+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1400911185,"description":"Dom Columba Marmion - Christ, the Life of the Soul (Zaccheus Press, 2005). \n\nFirst published in 1914. Translated from the French by Alan Bancroft.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nChrist, the Life of the Soul by Blessed Columba Marmion is a classic guide to the spiritual life that had a direct influence on several Popes, generations of priests and religious, and countless members of the laity. Firmly rooted in the Bible, the Liturgy, and the writings of the Saints and Doctors of the Church, Marmion explores every aspect of Catholic dogma -- with penetrating insight -- but his great emphasis is on the person of Christ, and the doctrine of Divine Adoption. Written for Christians in every walk of life, here are pages of practical knowledge and timeless wisdom -- a &quot;how to&quot; guide filled with rich insight, spiritual refreshment, inspiration and encouragement.\n\nabout the author:\n\nBlessed Columba Marmion, born Joseph Aloysius Marmion (April 1, 1858 - January 30, 1923) was an Irish monk, and the third abbot of Maredsous Abbey in Belgium. Beatified by Pope John Paul II on September 3, 2000, Marmion was one of the most popular and influential Catholic writers of the 20th century. His books are considered spiritual classics.","torrent":{"xt":"urn:btih:ac67f37f862797f6e57cf1e455ae4b776260f2c4","amp;dn":"Columba+Marmion+-+Christ+the+Life+of+the+Soul+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac67f37f862797f6e57cf1e455ae4b776260f2c4","infoHashBuffer":{"type":"Buffer","data":[172,103,243,127,134,39,151,246,229,124,241,228,85,174,75,119,98,96,242,196]},"announce":[],"urlList":[]}}