{"title":"Polymer Synthesis Theory and Practice 5th ed","uid":12432168,"size":5125303,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:acc25d53511cbc65292463b661d4e9102db697a7&amp;dn=Polymer+Synthesis+Theory+and+Practice+5th+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1442475843,"description":"Polymer Synthesis Theory and Practice 5th ed - Dietrich Braun et al. (Springer, 2013).pdf\n\nISBN 978-3-642-28979-8\n\nEmphasis is on a broad description of the general methods and processes for the synthesis, modification and characterization of macromolecules. These more fundamental chapters will be supplemented by selected and detailed experiments. In addition to the preparative aspects the book also gives the reader an impression on the relation of chemical constitution and morphology of Polymers to their properties, as well as on their application areas. Thus, an additional textbook will not be needed in order to understand the experiments. The 5th edition contains numerous changes: In recent years, so-called functional polymers which have special electrical, electronic, optical and biological properties, have gained more and more in interest. This textbook was therefore supplemented by recipes which describe the synthesis of these materials in a new chapter 'Functional polymers'. Together with new experiments in chapter 3,4 and 5 the book now contains more than 120 recipes that describe a wide range of macromolecules. From the reviews of recent editions:'This is an excellent book for all polymer chemists engaged in synthesis research studies and education. It is educationally sound and has excellent laboratory synthetic examples. The fundamentals are well done for the teaching of students and references are resonably up-to-date. As in previous issues, there are sections dealing with an introduction; structure and nomenclature; methods and techniques for synthesis, characterization, processing and modification of polymers.....The authors have noted the following changes from previous editions- a new section on correlations of structure, morphology and properties; revision and enlargement of other property and characterization procedures; additional new experiments such as controlled radical polymerization; enzymatic polymerizations; microelmulsions; and electrical conducting polymers.This is a high quality textbook at a reasonable price and should be considered as a suitable reference for all engaged in synthetic areas of polymer research.' (Eli M. Pearce, Polytechnic University, Brooklyn, NY, USA)","torrent":{"xt":"urn:btih:acc25d53511cbc65292463b661d4e9102db697a7","amp;dn":"Polymer+Synthesis+Theory+and+Practice+5th+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acc25d53511cbc65292463b661d4e9102db697a7","infoHashBuffer":{"type":"Buffer","data":[172,194,93,83,81,28,188,101,41,36,99,182,97,212,233,16,45,182,151,167]},"announce":[],"urlList":[]}}