{"title":"Consumption and Its Consequences","uid":8890926,"size":475462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ada6dc57f020a29dc419ee8a026e1fd682d1de46&amp;dn=Consumption+and+Its+Consequences&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"livhre","files":-1,"time":1378581498,"description":"This is a book for those looking for different answers to some of today's most fundamental questions. What is a consumer society? Does being a consumer make us less authentic or more materialistic? How and why do we shop? How should we understand the economy? Is our seemingly insatiable desire for goods destroying the planet? Can we reconcile curbs on consumption with goals such as reducing poverty and social inequality?\nMiller responds to these questions by proposing feasible and, where possible, currently available alternatives, drawn mainly from his own original ethnographic research. Here you will find shopping analysed as a technology of love, clothing that sidesteps politics in tackling issues of immigration. There is an alternative theory of value that does not assume the economy is intelligent, scientific, moral or immoral. We see Coca-Cola as an example of localization, not globalization. We learn why the response to climate change will work only when we reverse our assumptions about the impact of consumption on citizens. Given the evidence that consumption is now central to the way we create and maintain our core values and relationships, the conclusions differ dramatically from conventional and accepted views as to its consequences for humanity and the planet","torrent":{"xt":"urn:btih:ada6dc57f020a29dc419ee8a026e1fd682d1de46","amp;dn":"Consumption+and+Its+Consequences","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ada6dc57f020a29dc419ee8a026e1fd682d1de46","infoHashBuffer":{"type":"Buffer","data":[173,166,220,87,240,32,162,157,196,25,238,138,2,110,31,214,130,209,222,70]},"announce":[],"urlList":[]}}