{"title":"Neil Young - Comes A Time (1978/2014) 24 bit/192 kHz ","uid":11762731,"size":1369962649,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ae00d1092e0ee195d6606ad12aa63b1242112d51&amp;dn=Neil+Young+-+Comes+A+Time+%281978%2F2014%29+24+bit%2F192+kHz+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sidmal","files":13,"time":1426629574,"description":"\nNeil Young - Comes A Time (1978/2014)\n FLAC (tracks) 24 bit/192 kHz | Time - 37:00 minutes | 1,34 GB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Comes a Time is the ninth album by Neil Young, and a return to the country/folk rock sound of Harvest (1972). &quot;Comes a Time&quot; is also the title song and a single release from this album. Originally, it had started out as a solo record, but when Young played it for Reprise executives they asked him if he wouldn't mind adding rhythm tracks to what he already had. Young agreed to this, and the end product was the Comes a Time that was released. Two songs had Young backed by Crazy Horse, resulting in them having sound more raw than the smooth production of the rest of the album.\n\n\n Six and a half years later, Comes a Time finally was the Neil Young album for the millions of fans who had loved Harvest, an acoustic-based record with country overtones and romantic, autobiographical lyrics, and many of those fans returned to the fold, enough to make Comes a Time Young's first Top Ten album since Harvest. He signaled the album's direction with the leadoff track, &quot;Goin' Back,&quot; and its retrospective theme augmented with an orchestral backup and the deliberate beat familiar from his number one hit &quot;Heart of Gold.&quot; Of course, Young remained sly about this retrenchment. &quot;I feel like goin' back,&quot; he sang, but added, &quot;back where there's nowhere to stay.&quot; Doubtless he had no intention of staying with this style, but for the length of the album, melodies, love lyrics, lush arrangements, and steel guitar solos dominated, and Young's vocals were made more accessible by being paired with Nicolette Larson's harmonies. Larson's own version of Young's &quot;Lotta Love,&quot; released shortly after the one heard here, became a Top Ten hit single. Other highlights included the reflective &quot;Already One,&quot; which treats the unusual subject of the nature of a divorced family, the ironic &quot;Field of Opportunity,&quot; and a cover of Ian Tyson's folk standard &quot;Four Strong Winds&quot; (a country Top Ten hit for Bobby Bare in 1965).  \n\n\nTracklist:\n\n 01 - Goin' Back\n 02 - Comes A Time\n 03 - Look Out For My Love\n 04 - Lotta Love\n 05 - Peace Of Mind\n 06 - Human Highway\n 07 - Already One\n 08 - Field Of Opportunity\n 09 - Motorcycle Mama\n 10 - Four Strong Winds\n\n 2014 Remaster","torrent":{"xt":"urn:btih:ae00d1092e0ee195d6606ad12aa63b1242112d51","amp;dn":"Neil+Young+-+Comes+A+Time+%281978%2F2014%29+24+bit%2F192+kHz+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae00d1092e0ee195d6606ad12aa63b1242112d51","infoHashBuffer":{"type":"Buffer","data":[174,0,209,9,46,14,225,149,214,96,106,209,42,166,59,18,66,17,45,81]},"announce":[],"urlList":[]}}