{"title":"Vishnu Sahasranam - Maharishi Vedic University Library","uid":8972584,"size":448198828,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ae3a29b86c63e8b9e97a272a4f15a4ad18cffda6&amp;dn=Vishnu+Sahasranam+-+Maharishi+Vedic+University+Library&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"abajanga2","files":3,"time":1380361357,"description":"Shri Vishnu Sahasranam\n\nShri Maha-Vishnu Narayan is the Supreme Administrator of the Universe. One of his names is \nAnantakotibrahmandnayaka - The Administrator of innumerable number of universe. Lord Vishnu is \nOmnipresent-Sarvavyapi, Omniscient-Sarvashaktiman and Omnipotent-Sarvasamarth.\n\nShri Vishnu Sahasranam-1000 names describe 1000 qualities of Vishnu. Each name of Shri Vishnu \nrefers to a quality of consciousness. Listening Sahasranam enlivens these qualities of Shri Vishnu in \nthe consciousness of the listener and at the same time, these qualities are charged in the \nenvironment.\n\nShri Vishnu Ashtottar Shatnamavali has 108 names of Vishnu. These names are few of the most \nimportant qualities, which may be chanted while offering flowers to Shri Vishnu. Shri Achyutashtaka \nStotra is a Siddha Stotra of Shri Vishnu, which provides Achyutananda - perpetual bliss.\n\nAs described in phalshruti-benefits of chanting Shri Vishnusahasranam and stotras, Devotees are able \nto align their individual consciousness with the cosmic consciousness. They enjoy diving deep into \nthe ocean of consciousness, which is infinite source of knowledge, power and bliss, thereby achieving \nchaturvidh phal-dharma, arth, kam and moksha-all four goals of human life-righteousness, affluence \nin every area of life, fulfillment of all desires and finally-The enlightenment.\n\nWednesday and Saturday are days of Shri. It is recommended to listen Sahasranam and other stotras \nof Shri Vishnu on Wednesday and Saturday.","torrent":{"xt":"urn:btih:ae3a29b86c63e8b9e97a272a4f15a4ad18cffda6","amp;dn":"Vishnu+Sahasranam+-+Maharishi+Vedic+University+Library","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae3a29b86c63e8b9e97a272a4f15a4ad18cffda6","infoHashBuffer":{"type":"Buffer","data":[174,58,41,184,108,99,232,185,233,122,39,42,79,21,164,173,24,207,253,166]},"announce":[],"urlList":[]}}