{"title":"Coast to Coast AM January 15 2013","uid":8032560,"size":56290618,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:af66d70914be6aeefa2484e312130722db1d40e8&amp;dn=Coast+to+Coast+AM+January+15+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1358451055,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-15-13\nHost: \tGeorge Noory\nGuests: \tLinda Stasi, Paul Badde, Kristen Luman, Patrick Doyle\n\nColumnist for the New York Post and unlikely conduit to the paranormal, Linda Stasi, discussed her confounding and bizarre experiences researching and writing a book about the Veil of Veronica, a cloth related to the Shroud of Turin, which she believes may in fact contain the DNA of Jesus. Allegedly, St. Veronica wiped the face of Jesus with her veil as he was carrying the cross, and his image appeared on the veil. According to the Monks in Manoppello, Italy who guard the cloth, the Veil is a genuine relic, but the woman Veronica is a fabrication, Stasi recounted.\n\nStasi saw the Veil in person which she described as a thin, transparent cloth with an image of a man's face on it that did not appear to be the product of paint or dye. Curiously, in her photos, one image shows an open mouth with teeth, another with a closed mouth, suggesting that the Veil could change. Further, she said that when the Veil and the Shroud of Turin are put together they form a complete 3D face. Jewish burial would have dictated a shroud and cloth placed on the body, and Stasi conjectured that when Jesus rose from the dead, the images were transferred onto the fabrics.\n\nShe detailed a number of unusual occurrences that happened to her as she was writing her book, The Sixth Station, including the seeming appearance of a recently deceased friend at her home. Her book, a religious thriller, poses the question if Jesus' DNA exists on the Veil, what would happen if he was cloned? Historian/author Paul Badde joined the conversation for a segment talking about his research into the Veil of Veronica, which he found to be an inexplicable object that cannot be reproduced today.\nGhost Mine\n\nFirst hour guests, paranormal investigators Kristen Luman and Patrick Doyle talked about their new Syfy TV series Ghost Mine. The 6-episode show was filmed at an abandoned gold mine in Oregon, long considered to be haunted. Doyle described creating specific ghost hunting equipment such as the RIPA (Remote Investigator of Paranormal Activity) in order to deal with the difficult environment of the mine, while Luman revealed that as a female redhead, she was considered unlucky by the veteran miners, because of an old superstition that women only went to a mine to find out the fate of a loved one following a tragedy, and many of them had been redheads. The two also spoke about the phenomena of Tommyknockers, thought to be helpful entities who warn miners of impending dangers.\n\nNews segment guests: Gary Ridenour, Peter Davenport\nWebsite(s):\n\n    thesixthstation.com\n    syfy.com/ghostmine\n\nBook(s):\n\n    The Sixth Station\n    The Face of God\n\n","torrent":{"xt":"urn:btih:af66d70914be6aeefa2484e312130722db1d40e8","amp;dn":"Coast+to+Coast+AM+January+15+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af66d70914be6aeefa2484e312130722db1d40e8","infoHashBuffer":{"type":"Buffer","data":[175,102,215,9,20,190,106,238,250,36,132,227,18,19,7,34,219,29,64,232]},"announce":[],"urlList":[]}}