{"title":"Badgerlore - Stories For Owls [2005][EAC,log,cue. FLAC]","uid":8195368,"size":211043882,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b004c9141448de76273327794b0b44ce71c7f85c&amp;dn=Badgerlore+-+Stories+For+Owls+%5B2005%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dickspic","files":9,"time":1361903309,"description":"Artist: Badgerlore\nRelease: Stories For Owls\nDiscogs: 863049\nReleased: 2005\nLabel: Free Porcupine Society\nCatalog#: FPS 012\nFormat: FLAC / Lossless / Log (100%) / Cue / CD, Limited Edition\nCountry: US\nStyle: Rock, Folk Rock, Experimental\n\nTracklisting:\n\n01. Stone Stick Earth Brick (5:56)\n02. String Wrist (8:40)\n03. III (6:50)\n04. Your Discomfort, My Happiness (8:03)\n05. Green Canoe (6:04)\n06. Building A Nest (7:00)\n\n\nYou don't always get to pick your treats, but that's no cause for complaint. Badgerlore's first CD Of Things Too Sorrowful to be Reminded came festooned with twigs and leaves glued to the package, just the thing to give it that homemade-gift vibe. Stories For Owls comes in a nice, clean cardboard folio; most likely no fingers were gummed up during its manufacture.\n\nThis time the bonus is musical. In an inspired move, core members Ben Chasny (Six Organs of Admittance, Comets In Fire, August Born) and Rob Fisk (ex-Deerhoof, 7 Year Rabbit Cycle) have inducted guitarist Tom Carter (Charalambides) and real-time sound processor Pete Swanson (Yellow Swans) into the Badgerlore Lodge. The newcomers add depth and resonance to an enterprise whose earlier effort was sometimes too ephemeral to grasp. Their method seems to have been to sit down, tune up, tune out and play; there's not much evident post-production until the final track. The instrumentation is equally basic; one piano, two or three guitars, and three throats unencumbered by the urge to form words.\n\n&quot;Stone Stick Earth Brick&quot; lays the foundation with strummed chords, dark and foreboding as an October snowstorm. The strings slowly tangle and curl about each other, then part for a single ghostly falsetto cry and close back in as the woods claim their due. Fisk's tape delay and treatments are equal players on the next track, &quot;String Wrist.&quot; It's more spacious, with single notes and echoing passages moving in and out of the mix like some cave painting that starts to glow and move before your eyes as the torch sputters out.\n\nThis is truly collective music, but Carter's distinctive trills and slide work can't help but stand out. &quot;Building a Nest&quot; closes the album on a suitably creepy note, with delay-thickened vocal chants moaning like ghosts in the night.","torrent":{"xt":"urn:btih:b004c9141448de76273327794b0b44ce71c7f85c","amp;dn":"Badgerlore+-+Stories+For+Owls+%5B2005%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b004c9141448de76273327794b0b44ce71c7f85c","infoHashBuffer":{"type":"Buffer","data":[176,4,201,20,20,72,222,118,39,51,39,121,75,11,68,206,113,199,248,92]},"announce":[],"urlList":[]}}