{"title":"PC Ã‚Â» MX vs ATV REFLEX Full Game directplay by globe@","uid":5997352,"size":2877359704,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b0abe87840be0319dbf69c4dbb73e4c1ea536c6e&amp;dn=PC+%C3%82%C2%BB+MX+vs+ATV+REFLEX+Full+Game+directplay+by+globe%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1291066112,"description":"* Hello PC games fans ...\n\n\n* Play this nice bikes racing game ...\n\n\n* The freeware FREEARC is needed to extract the earc file\n\n\n* FILE INFO : ABSOLUTE COMPLETE , SIMPLY NOTHING TO REPORT (minor things with correct competent work)\n\n\n* Gameplay : *\n\nThe core focus of the game allows for the player to race motocross and supercross on motocross bikes or ATVs. The game also includes events such as omnicross, free ride, champion sport track, waypoint racing, and freestyle motocross.\n Although the game is part of the MX vs ATV series, Reflex was built from the ground up featuring a new control scheme and physics engine. The new control scheme is labeled &quot;reflex&quot; which utilizes both analog sticks. The left analog controls the handlebars while the right analog stick controls the rider's body movement. The reflex system allows for unprecedented control and manipulation by allowing the player to 'ride' the motorcycle and other vehicle as they actually would. Tricks have been simplified from the previous games as the player only needs to hold the modifier button and use the right stick to make different combinations and flips.\n Also new to Reflex is real-time terrain deformation. Terrain deformation allows any of the different vehicles to literally carve into the earth creating ruts, berms, braking bumps and acceleration bumps as they actually do in real life. These ruts, berms and bumps are dynamic and constantly changing throughout the course of the race adding for an extra sense of realism.\n Online mode consists of public and private rooms. These rooms are dedicated to specific event types (i.e. supercross) and host up to twelve players at a single time. A player's 'motocard' keeps record of the player's progress through online events which earns them experience points that go towards the player's level. \n\n\nMINIMUM SYSTEM REQUIREMENTS :\n========================\n\nWindows(R) XP or Vista(R) or Windows(R) 7\nAthlon 64 3800+ 2.4 Ghz or better / Intel Pentium 4 530 3.0Ghz or better\n1GB RAM (Windows(R) XP) or 2GB RAM (Vista(R), Windows(R) 7)\nNVIDIA GeForce 8 Series or better / ATI 2000 Series or better) with latest manufacturer drivers.\nDirectX(R) 9.0c compatible sound card\n6.5GB of uncompressed Hard Drive Space\n\n\n\n\n* enjoy ... *\n","torrent":{"xt":"urn:btih:b0abe87840be0319dbf69c4dbb73e4c1ea536c6e","amp;dn":"PC+%C3%82%C2%BB+MX+vs+ATV+REFLEX+Full+Game+directplay+by+globe%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0abe87840be0319dbf69c4dbb73e4c1ea536c6e","infoHashBuffer":{"type":"Buffer","data":[176,171,232,120,64,190,3,25,219,246,156,77,187,115,228,193,234,83,108,110]},"announce":[],"urlList":[]}}