{"title":"A Farewell to Arms (1932) DVD5 - Gary Cooper - Helen Hayes - 1st","uid":9580330,"size":4314902528,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b1b08e73fb9a0861b70c6257afe96743936d1b81&amp;dn=A+Farewell+to+Arms+%281932%29+DVD5+-+Gary+Cooper+-+Helen+Hayes+-+1st&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SaM","files":-1,"time":1391750688,"description":"A Farewell to Arms (1932) DVD5 - Gary Cooper - Helen Hayes - 1st film version of Ernest Hemmingway [DDR]\n\nA Farewell to Arms is a 1932 romance drama film directed by Frank Borzage and starring Helen Hayes, Gary Cooper, and Adolphe Menjou. Based on the 1929 semi-autobiographical novel A Farewell to Arms by Ernest Hemingway, with a screenplay by Oliver H.P. Garrett and Benjamin Glazer, the film is about a romantic love affair between an American ambulance driver and an English nurse in Italy during World War I. The film received Academy Awards for Best Cinematography and Best Sound, and was nominated for Best Picture and Best Art Direction. In 1960, the film entered the public domain (in the USA) due to the failure of the last claimant, United Artists, to renew its copyright registration in the 28th year after publication. The original Broadway play starred Glenn Anders and Elissa Landi\n\nCAST:-\nHelen Hayes as Catherine Barkley\nGary Cooper as Lieutenant Frederic Henry\nAdolphe Menjou as Major Rinaldi\nMary Philips as Helen Ferguson\nJack La Rue as Priest\nBlanche Friderici as Head Nurse\nMary Forbes as Miss Van Campen\nGilbert Emery as British Major\n\nDirected by Frank Borzage\nProduced by Edward A. Blatt, Benjamin Glazer\nMusic by Milan Roder\nRunning time 85 minutes\n\nSYNOPSIS:- A Farewell to Arms (1932)\nOn the Italian front during World War I, Frederic Henry (Gary Cooper), an American serving as an ambulance driver in the Italian Army, delivers some wounded soldiers to a hospital. \n\nThere he meets his friend, Italian Major Rinaldi (Adolphe Menjou), a doctor. They go out carousing, but are interrupted by a bombing raid. Frederic and English Red Cross nurse Catherine Barkley (Helen Hayes) take shelter in the same place. The somewhat drunk Frederic makes a poor first impression.\n\nRinaldi persuades Frederic to go on a double romantic date with him and two nurses, Catherine and her friend Helen Ferguson (Mary Philips). However, Rinaldi becomes annoyed when Frederic prefers Catherine, the woman the major had chosen for himself. Away by themselves, Frederic learns that she was engaged to a soldier who was killed in battle. In the darkness, he romantically seduces her, over her half-hearted resistance, and is surprised to discover she is a virgin.\n\nTheir romantic relationship (forbidden by army regulation) is discovered. At Rinaldi's suggestion, Catherine is transferred to Milan. When Frederick is wounded by artillery, he finds himself in the hospital where Catherine now works. They continue their affair until he is sent back to the war. Now pregnant, Catherine runs away to Switzerland, but her many letters to her beloved sweetheart/lover are intercepted by Rinaldi, who feels he needs to rescue his friend from the romantic entanglement. Meanwhile, Frederic's letters to her are sent to the hospital which she has abandoned.\n\nWhen Frederic cannot stand it any longer, and he deserts them to find Catherine. Returning first to the hospital in Milan, he attempts to convince the reluctant Ferguson to reveal Catherine's whereabouts to him. Displaying animosity toward Frederic, all she reveals finally is that Catherine has left and is pregnant with Frederic's child. Rinaldi visits him at the hotel where he is hiding, and, upon hearing of Catherine's pregnancy, out of remorse for having interfered with their correspondence, tells Frederic where she is living. He rows across a lake to her. Meanwhile, Catherine is delighted when she is told she has finally received some mail, but faints when she is given all of her romantic love letters, marked &quot;Return to Sender&quot;. She is taken to the hospital, where her child is delivered stillborn. She herself is in grave danger. Frederic arrives, and just as an armistice between Italy and Austria-Hungary is announced, Catherine tragically dies, with him at her side.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 85 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]\nDuration: 85 mins","torrent":{"xt":"urn:btih:b1b08e73fb9a0861b70c6257afe96743936d1b81","amp;dn":"A+Farewell+to+Arms+%281932%29+DVD5+-+Gary+Cooper+-+Helen+Hayes+-+1st","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1b08e73fb9a0861b70c6257afe96743936d1b81","infoHashBuffer":{"type":"Buffer","data":[177,176,142,115,251,154,8,97,183,12,98,87,175,233,103,67,147,109,27,129]},"announce":[],"urlList":[]}}