{"title":"WW2 Battles  Leningrad","uid":9014062,"size":3951067136,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b1d6b7023743b74034beb2c5ea2d0ee0c5bd99de&amp;dn=WW2+Battles++Leningrad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mpkeuter","files":1,"time":1381163177,"description":"Early in Sep 1941, German troops marched in the suburbs of Leningrad while Finnish troops threatened the city from the north. The city felt the threat long ago, however, and starting early in the summer of 1941, the civilians of the city were summoned to construct an elaborate system of defenses around the city: wooden blockages, barbed wire, anti-tank ditches, and trenches of various sizes. The responsibility of defending the city was given to Georgi Zhukov. German preparations for invasion started on 4 Sep when artillery shells began to rain on the city, and aircraft dropped bombs beginning on 6 Sep. Zhukov's preparations saved the city from a quick assault; the German troops dug in around the city, and the siege of Russia's second largest city had begun.\n\nDespite the constant shelling and bombing of the city, the Russia defenses fought on valiantly. On 7 Oct, Adolf Hitler and Alfred Jodl issued an order that Leningrad must be taken without giving the Russians any chance to surrender. &quot;The Fuhrer has decided to wipe St. Petersburg off the face of the earth&quot;, said a document from Adolf Hitler's office. The German Luftwaffe had the chance to carry out Hitler's orders first, dropping\n&quot;thousands of incendiary bombs on the Badayev warehouses, a two-hectare site of wooden buildings that held much of the city's remaining food supplies; the next morning the whole city was suffused with the smell of burning meat, flour, lard and sugar. After this disaster the people of Leningrad had only a few weeks' supply of food left and there was little hope of receiving any more.&quot;\n\nThe Winter War that Russia was fighting with Finland had taken a unfavorable turn for the Russians as the Finns marched toward Leningrad from the northwest. The Finnish leader Carl Gustav Emil Mannerheim halted his advance at the Finnish-Russian border of 1939 and refused to go any further. On 4 Sep, Jodl attempted to, unsuccessfully, convince Mannerheim to press on his attack to aid the German efforts in the northern arm of Operation Barbarossa. As a result, although the Finns remained a threat to the Russians until Finland left the Axis alliance in Sep 1944, the Russian defenses were able to put more focus on the German front.\n\nSupplies were of the most critical issue in the defense of Leningrad. Rationing of food was employed immediately as the food situation took a bad start immediately after the German attack: several barges full of grain were sunk at the beginning of the siege (some were recovered by divers later during the siege to alleviate the situation), while a depot with a large stock of food burned from German bombings. The food situation never improved in the next few months, as the Russian leaders in the city feared but yet expected. Food rations had reduced several times since the beginning of the siege, and now had reached starvation levels. At the end of Dec 1941, 3,000 people starved to death daily.\n\nA small gleam of light was found on 20 Nov 1941, however. Daring runs by trucks over the frozen Lake Ladoga brought small amounts of supplies into the city over the &quot;Road of Life&quot;. Subsequent runs over the Road of Life brought in small but yet significant supplies. The trucks endured dangerous driving conditions from unstable ice below and German air raids from above, but the supply runs continued. Over this route, 500,000 civilians were also evacuated out of the city throughout the siege.\n\nGerman troops, frustrated by the inability to break Leningrad's defenses, continued to bombard the city continuously. The cultural capital of Russia slowly turned to ruins as the northern arm of Operation Barbarossa turned into a complete stop. Although the Germans did not admit to it, the stubborn defense of Leningrad had already marked a complete failure in the north.\n\nAs the Finns closed to within 200km of the city, Operation Spark was launched by the Russians on 12 Jan 1943. Troops from Leningrad and Volkhov counterattacked German forces to the south of the city. This offensive opened a corridor on 18 Jan, allowing the city to be supplied. Soon after, the railroad between Leningrad and Moscow was restored. The population, however, did not see the effect of this opened railroad right away, for starvation and the freezing temperatures continued to kill. Nikolai Markevich wrote in his diary on 24 Jan 1942 that\n&quot;The city is dead. There is no electricity, no trams. Warm rooms are rare. No water. Almost the only form of transport is sleds, carrying corpses in plain coffins, covered with rags or half clothed. Daily six to eight thousand die. The city is dying as it has lived for the last half year - clenching its teeth.&quot;\n\nOn 4 Apr, the German Luftwaffe struck at the Russian fleet at the ports of Leningrad, but it failed to destroy the fleet. Along with the other ongoing events that frustrated the German forces, morale started to slip on the German side, while the civilians and troops at Leningrad saw the opposite. On the northern front, the Finnish troops remained rather dormant. In hindsight the Finns' lack of cooperation with the German forces became a salvation to the Russian forces, as it allowed them to shift defenses on the German front. The lack of cooperation also meant that the Germans was not able to launch an offensive from the Finn-occupied northern corridor nor shell the city from the north. The Finns held on to the territory immediately north of the city until summer 1944.\n\nThe siege finally completely ended on 27 Jan 1944 as the last of the German troops withdrew from the region. German shelling lasted until the last days according to Hitler's orders at the start of the siege that Leningrad must be reduced to dust.\n\nThe casualties suffered during the 900-day siege differed according to source. The Russian government reported 670,000 deaths during the siege, with a significant portion to starvation. Others estimate the death toll to be as high as over one million. It was a tragic blow to Russia, however, the will of the people of Leningrad to fight on became one of the more powerful tools of the Russian propaganda machine. For the stubborn defense, Leningrad was given the Order of Lenin in 1945 by Josef Stalin. She was also the first city to be awarded the honor Hero City in 1965.\n\nDutch Subs\nEnglish Audio","torrent":{"xt":"urn:btih:b1d6b7023743b74034beb2c5ea2d0ee0c5bd99de","amp;dn":"WW2+Battles++Leningrad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1d6b7023743b74034beb2c5ea2d0ee0c5bd99de","infoHashBuffer":{"type":"Buffer","data":[177,214,183,2,55,67,183,64,52,190,178,197,234,45,14,224,197,189,153,222]},"announce":[],"urlList":[]}}