{"title":"Iran Costa - O Bicho [1995] [ALAC - m4a]","uid":7772458,"size":338443910,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b21dc3f405496e309284a2bd75968bf7a96a0d28&amp;dn=Iran+Costa+-+O+Bicho+%5B1995%5D+%5BALAC+-+m4a%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sjogos","files":27,"time":1351564893,"description":"-Ripped using CUERipper v 2.1.4, from Original CD.\n-The Rip was accurately RIP by CUE RIPPER. Log Included in the torrent.\n-Dynamic Range LOG Included (Included in this Torrent . Official DR Value: 12 http://www.dr.loudness-war.info/\n\n\nTechnical Information:\n----------------------------------------------------------------------------------\n-Source: Original CD\n-Artist: Iran Costa - http://pt.wikipedia.org/wiki/Iran_Costa\n-Album: O Bicho\n-Year: 1995\n-Bar Code: 5602515142081\n-Publisher: Vidisco &quot;Comercio e Industria de Som, Lda&quot;\n-Number of disks: 1\n-Number of Tracks: 11\n-Edition: Standard Edition\n-DR Value: 12\n\n-Destination Format: Apple Lossless Audio Codec (Lossless)\n-Bit/Sample Rate: 16/44\n-Covers: Included\n-Sound Quality: Same as Source\n\nMore Info:\n----------------------------------------------------------------------------------\nThis album made alot of success in Portugal back in 1995. All people in this time had cassette tapes of this great song. Iran Costa made alot of success in Brazil too. This was the most successful album of Iran Costa.\n\n\nAdditional info (IMPORTANT):\n----------------------------------------------------------------------------------\n- File Format it NOT Flac BUT m4a (Apple Lossless). It provides the same quality as FLAC, its just compressed using different algorithm, but the sound quality is the same (Its like ZIP vs RAR...do the same thing, just in different way). The last version of &quot;Windows Media Player&quot; can play m4a files (If you have ALAC codec in your system, if you don't you could download it for free on Internet). It's possible to read m4a files in foobar2000 and in Winamp (if you install Winamp Essencials). \n\n-If you prefer, you can also convert to WAV, FLAC or record directly to CD-R using cue file in &quot;imgburn&quot; WITHOUT loosing quality. You will get a copy exactly as original source. REMEMBER: Converting between lossless formats are always lossless. You can convert any number of times you want, quality will always the same as source.\n\n- You can always convert to a lossy format like mp3, but in this case you will lose quality. If you are not very picky about sound quality, MP3 320kbps is sufficient for the most people. BUT if you want the REAL CD quality (Like retail copy) stay in lossless format.\n\n- Songs are Correctly Tagged, with correct artist, name, number of disks etc.\n\n- Why m4a format and not FLAC? Because its compatible with iTunes. If you are iTunes user, just add the album folder to iTunes library, and you will get the album in your library correctly tagged and with album picture.\n\n- Is this CD-RIP the same as buying the album on iTunes? No....This are much better. iTunes sells AAC 128K or 256K, lossy formats. This is CD quality, iTunes don't. Don't buy music in iTunes, buy CD's!. They have better quality, almost the same price (sometimes CDs are cheaper!) and you get jewel case, manuals etc.\n\n\nThank you for your Download. Enjoy it.","torrent":{"xt":"urn:btih:b21dc3f405496e309284a2bd75968bf7a96a0d28","amp;dn":"Iran+Costa+-+O+Bicho+%5B1995%5D+%5BALAC+-+m4a%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b21dc3f405496e309284a2bd75968bf7a96a0d28","infoHashBuffer":{"type":"Buffer","data":[178,29,195,244,5,73,110,48,146,132,162,189,117,150,139,247,169,106,13,40]},"announce":[],"urlList":[]}}