{"title":"20130328-Stossel-[Green Tyranny].Fox Business.CF.avi","uid":8334376,"size":326644732,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b2acdecff02ade78e92f4d0f6ed463e28de80f43&amp;dn=20130328-Stossel-%5BGreen+Tyranny%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1364952000,"description":"----------\n\nSTOSSEL - [Green Tyranny] - Fox Business Network\n2013, March 28, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nTyranny is the stuff of dictatorships. We call this week's show &quot;Green Tyranny&quot; because government's regulations always go too far. At first, the EPA did good things. Environmental standards brought us cleaner air and water. Then government should have said, &quot;stick a fork in it! It's done.&quot; But government never does. It just spends more and more.\n\nThe Endangered Species Act seemed like a good idea. But now, Jim Burling from the Pacific Legal Foundation, says the ESA puts animals, like prairie dogs and frogs, above the interests of the people.\n\nEurope has spent billions to support &quot;green&quot; energy, but Bjorn Lomborg points out that Germany and Spain are now cutting back. Then, he debates Brian Wynne, the President of an electric car lobbying group (The Electric Drive Transportation Association). Celebs' like Justin Bieber and Leonardo DiCaprio jumped on the electric car bandwagon - but are electric cars really all that green? Lomborg doesn't think so.\n\nMy mayor, Michael Bloomberg, now wants yet another ban-Styrofoam. He says it's &quot;environmentally destructive.&quot; But Angela Logomasini, from the Competitive Enterprise Institute, argues that banning foam products hurts consumers without helping the environment.\n\nScience writer, Matt Ridley, argues that fossil fuels are actually good for the environment.\n\nFinally, a debate on global warming. If you can even call it that - We asked a dozen scientists who are concerned about man causing global warming to debate Roy Spencer, a skeptical climatologist at the University of Alabama. Most refused. Gavin Schmidt, a NASA scientist, was willing to talk, as long as it was not a debate. We found a weird compromise.","torrent":{"xt":"urn:btih:b2acdecff02ade78e92f4d0f6ed463e28de80f43","amp;dn":"20130328-Stossel-%5BGreen+Tyranny%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2acdecff02ade78e92f4d0f6ed463e28de80f43","infoHashBuffer":{"type":"Buffer","data":[178,172,222,207,240,42,222,120,233,47,77,15,110,212,99,226,141,232,15,67]},"announce":[],"urlList":[]}}