{"title":"Sheena Easton - What Comes Naturally 1991","uid":8981289,"size":412127463,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b2d5fa44bb5ce9a2f4ec7fedcdc701fce331297f&amp;dn=Sheena+Easton+-+What+Comes+Naturally+1991&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1380573353,"description":"If you want to dance to Sheena Easton's music, this is the CD for you. 'What Comes Naturally' features Sheena performing upbeat dance music that may not have been that 'natural' for her to perform and record. The music is her response to the changing musical trends of the time, continuing in the direction she had taken on her previous release, 'The Lover In Me'. Listening to it today, you might not realize that this was originally released over a decade ago. The music is so full of energy.\nUnlike her early releases, which featured many soft ballads, with keyboards and strings, the emphasis here is on the beat, and having Sheena vocally swing with it. If you liked her primary for lovely emotional songs like 'Almost Over You', this music is not for you. The closest songs to that style are 'To Anyone', 'The Next Time' and 'Forever Friends'. The remaining tracks are upbeat numbers that are more suitable for active dancing. Very aerobic, workout music.\n\nIt is interesting to hear Sheena bringing her unique vocal style to this type of music. The album's single, 'What Comes Naturally' kicks things off, and even features Sheena doing a bit of rap. 'Half A Heart' is a tune that kind of updates her 80's rock sound. 'Somebody' could be a Britney Spears song. 'Manic Panic' is a bouncy rhythmic number. 'Time Bomb' and 'You Can Swing It' sound a lot like hip-hop to me. 'The First Touch Of Love' is rhythmic tune with a more 'electronic' sound. It's hard to keep still, listening to these tunes. Somehow your hips just want to start moving.\n\nThe sound of the songs may have been influenced by the success of artists like Paula Abdul. Listening to 'If You Wanna Keep Me', you may notice a similarity in style. Unfortunately the audience for this CD was not particularly large.\nMore than just a talented singer with a beautiful voice, the lady is a survivor. Having just seen Sheena Easton performing her classics in Vegas, I can say that she still puts great passion and fire into her music, but also has the maturity not to take herself too seriously. Seeing her in person, has caused me to give this CD a second chance, and I'm really glad I did because I enjoy it now more than ever. \n(review, amazon.com)\n\n- - -\n\nSheena Easton - What Comes Naturally\n(MCA 1991)\n\n 1. What Comes Naturally  \n 2. If You Wanna Keep Me \n 3. You Can Swing It  \n 4. The First Touch of Love   \n 5. Forever Friends  \n 6. The Next Time \n 7. Manic Panic  \n 8. Somebody  \n 9. Time Bomb    \n10. Half a Heart  \n11. To Anyone   \n12. What Comes Naturally (Extended Club Version)\n","torrent":{"xt":"urn:btih:b2d5fa44bb5ce9a2f4ec7fedcdc701fce331297f","amp;dn":"Sheena+Easton+-+What+Comes+Naturally+1991","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2d5fa44bb5ce9a2f4ec7fedcdc701fce331297f","infoHashBuffer":{"type":"Buffer","data":[178,213,250,68,187,92,233,162,244,236,127,237,205,199,1,252,227,49,41,127]},"announce":[],"urlList":[]}}