{"title":"[DVD5 ITA-JAP] Full Metal Alchemist -Deluxe Edition 3-12[CR-Bt]","uid":4728368,"size":4673015808,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b2e40002f0ae60c7bcfa4b40bbc6da5b79dd2b09&amp;dn=%5BDVD5+ITA-JAP%5D+Full+Metal+Alchemist+-Deluxe+Edition+3-12%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CR-Bt","files":22,"time":1234831199,"description":"Sempre alla ricerca della Pietra Filosofale, Ed e Al decisono di seguire il suggerimento di Clara e arrivano a Zenotaim. Qui si imbattono in due alchimisti che, spacciandosi per i fratelli Elric, stanno facendo delle ricerche per conto di un ricco uomo della zona. I due impostori, usando una tecnica particolare, riescono a cristallizzare la misteriosa Acqua rossa trasformandola in pietra. Che sia questa la vera Pietra Filosofale? Terminata questa indagine, Ed a Al ritornano a East City per fare un rapporto e ci trovano l'intero stato maggiore dei militari, in fuga da Central City dove un misterioso e inarrestabile killer sta uccidendo tutti gli alchimsiti di Stato.\n\nMaggiori info su http://colombo-reloaded.org\n\n\nAfter losing their mother, Alphonse and Edward Elric attempt to bring her back using the forbidden science of human alchemy. However, alchemy operates on the theory of equivalent trade, and breaking the human alchemy taboo carries a heavy price. Ed loses his leg, and Al loses his body. Ed is able to seal Al's soul inside of a huge suit of armor, at the cost of his arm. Years later, Ed (now with two mechanical limbs) and Al (still trapped in the armor) leave their childhood home, each brother concerned with the other's happiness. Ed, who has a natural talent and skill for alchemy, becomes nationally certified and is soon known everywhere as the &quot;Fullmetal Alchemist.&quot; Their true objective is to search for any information on the fabled Philosopher's Stone, hoping it will allow them to regain their old bodies. All of their hopes rest with this mythical stone, which may not even exist at all. However, the brothers soon learn that they are not the only ones after the powerful stone.\n\nMore info at http://colombo-reloaded.org","torrent":{"xt":"urn:btih:b2e40002f0ae60c7bcfa4b40bbc6da5b79dd2b09","amp;dn":"%5BDVD5+ITA-JAP%5D+Full+Metal+Alchemist+-Deluxe+Edition+3-12%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2e40002f0ae60c7bcfa4b40bbc6da5b79dd2b09","infoHashBuffer":{"type":"Buffer","data":[178,228,0,2,240,174,96,199,188,250,75,64,187,198,218,91,121,221,43,9]},"announce":[],"urlList":[]}}