{"title":"Terence Hill and Bud Spencer Collection (NL SUBS) 5-9 vlinder TB","uid":6121770,"size":4475673959,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b40961eda5adba31897ee9dd68fd542ab2b6bb90&amp;dn=Terence+Hill+and+Bud+Spencer+Collection+%28NL+SUBS%29+5-9+vlinder+TB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Vlinder2","files":-1,"time":1295782946,"description":"Terence Hill &amp; Bud Spencer - The Ultimate Collection - DVD 5 van 9 \n\nNegen dvd's met circa 30 uur aan actie en humor! Laat je vermaken door de avonturen van Terence Hill &amp; Bud Spencer.\n\n\n\nInhoud:\nNinja Shadow &amp; Lord of the Sun \nIndians &amp; Gonzales Revenge \nDiamonds &amp; Condor Mission \nMidsummer in Daisy Town &amp; Ma Dalton &amp; Ghost Train &amp; Who is Mr. Joseph's \nGrand Delusions &amp; Lucky's Fiancee &amp; Nobody's Fool &amp; CafÃƒÂ© OlÃƒÂ© \nDaisy Town \nA Policy for Hell &amp; The False Entruscan \nLet the Buried Lie &amp; Another Falling Star \nBoomerang &amp; An Unusual Insurance \n      \n   \n \nDVD 5\n\nGrand Delusion\n\nBij zij terugkeer in Daisy Town, komt Luke in een verlaten stad. Het stadsvolk is op het kerkhof, bezig met de begrafenis van 'Luke zelf'. Een nieuwe sherriff komt naar de stad om de plaats van Luke over te nemen. Zwetend wordt Luke in het midden van de woestijn wakker, gebeten door een slang. Zijn paard Jolly Jumper rent naar de stad voor hulp en Lotta Legs moet Luke en een antidote snel vinden! De Daltons proberen haar tegen te houden.....\n\nLucky's Fiancee\n\nIngehuurd door een stel eenzame mijnwerkers om hun bruiden uit het westen te bezorgen, is Lucky Luke zich niet bewust dat een van de vrouwen Jenny is, die ontsnapt is uit de gevangenis en van plan is haar bende te herenigen en banken wil gaan beroven, beginnend met die in Purgatory. Nadat bende de caravaan van Luke heeft aangevallen, wordt Jenny op haar gedrag aangesproken en raakt onder de indruk van Luke. Ze besluit op het rechte pad te gaan, en tegen de tijd dat ze Purgatory bereiken, belooft Jenny de perfecte bruid te worden. Ze probeerd haar bende te weerhouden van het beroven van de bank, naar Luke denkt dat ze weer bij de bende is.... Beledigd dat Luke aan haar twijfelde, laat ze hem door haar bende aan een kist met dynamite ketenen, met een brandend lont.....\n\nNobody's Fool\n\nLotta Legs is verzot op 1 april, Daisy Town vreest die dag om haar 1 april grappen. Luke wordt uitgenodigd bij de tent van een rondreizende Russische Prins, en Lotta Legs gaat mee. De Prins benoemd Luke als zijn bodygard en toont veel belangstelling voor Lotta. De problemen beginnen als de prins en zijn verloofde (die jaloers is op Lotta) ruzie gaan maken. De prins verklaart dat hij met Lotta wil touwen. De prinses wil met een gewone man trouwen - Lucky Luke! Als Luke het aanbod afwijst, daagt de prins Luke uit voor een tweegevecht omdat hij de prinses beledigd heeft...\n\nCafÃƒÂ© OlÃƒÂ© \n\nOp een dag ontdekken de bewoners van Daisy Town dat alle koffie op is - iemand heeft de koffie aanvoer naar de stad geblokkeerd. De stedelingen hopen op hulp van Luke, terwijl Lotta, opgehitst door Susan, probeert te bewijzen dat ze een betere sherriff is dan Luke. De beledigde Luke gaat op Lotta's bluf in en ze verwisselen van rol: Lotta wordt sherriff en Luke neemt de saloon over.....\n\nEnglish\n\n\nGrand Delusion\nActors:  Terence Hill\nLucky Luke returns to a deserted Daisy Town after tracking the Daltons. He hallucinates while in the desert following a snakebite, but wakes up after witnessing his own funeral. The Daltons come across him and leave him to die while they go on to Daisy Town to pillage and plunder. When Lotta finds out about Luke's condition, she tries to rescue him with a snakebite antidote, but the Daltons put her in jail when they learn what she plans to do. In the end, Luke makes the Daltons make restitution to the town \n\n\nLucky's Fiancee\n\nActors:  Terence Hill    \nLuke's vacation is cut short when he is enlisted to bring back some mail order brides back from the east to Purgatory. (Purgatory is the name of the town and a lot of good puns are in this episode.) Luke picks up the women; unaware that one of them, Jenny, is a bank robber. Jenny is impressed with Lucky Luke and decides to become the perfect bride once she's in Purgatory.\n\n\nNobody's Fool\nActors:  Terence Hill    \nLotta loves April 1st; Daisy Town dreads it because of her April Fools pranks. Luck is summoned to the tent of a visiting Russian prince, and lets Lotta come along. The Prince appoints Luke as his bodyguard and takes great interest in Lotta.\n\nTrouble starts when the Prince and his fianc?(who is jealous of Lotta) fight. The Prince declares that he'll marry Lotta instead. The Princess declares that she too will marry a &quot;commoner,&quot; Lucky Luke!\n\nWhen Luke declines the offer, the Prince challenges Luke to a duel, and Lotta withdraws her acceptance of marriage - but both are sentenced to death! Just before they are beheaded, Luke turns to Lotta and says, &quot;April Fools!&quot; The Russians are hired actors. Lotta vows to get even with Luke!\n\nCafÃƒÂ© OlÃƒÂ© \nWhen a small town runs out of coffee, only cowboy hero Lucky Luke can save the day. But if he didn't have enough problems, his girl Lotta decides maybe she can do a better job as Sheriff, and the two agree to trade jobs...for a while.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0637374/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0637374/&lt;/a&gt;\n\nTaal: Engels!\nOndertitels : Nederlands (instelbaar)\nDe Cover en Label : Ja!\nSpotinformatie \nBeeldformaat  : 4:3\nFormaat : DVD5 \nBron : Retail\n \n\n \nGenre : Actie\nAvontuur\n\nTBS\n\nBlack-Sam\n","torrent":{"xt":"urn:btih:b40961eda5adba31897ee9dd68fd542ab2b6bb90","amp;dn":"Terence+Hill+and+Bud+Spencer+Collection+%28NL+SUBS%29+5-9+vlinder+TB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b40961eda5adba31897ee9dd68fd542ab2b6bb90","infoHashBuffer":{"type":"Buffer","data":[180,9,97,237,165,173,186,49,137,126,233,221,104,253,84,42,178,182,187,144]},"announce":[],"urlList":[]}}