{"title":"The Invisibles [ADULT]","uid":4883499,"size":712256418,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b42b804b1b48d0115b2c9259581d192853f795b0&amp;dn=The+Invisibles+%5BADULT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1241522958,"description":"The Invisibles was published by the Vertigo imprint of DC Comics from 1994 to 2000. It was created and scripted by Scottish writer Grant Morrison.\n\nThe plot follows a single cell of The Invisible College, a secret organization battling against physical and psychic oppression using time travel, magic, meditation, and physical violence. Their enemies are the Archons of Outer Church, interdimensional alien gods who have already enslaved most of the human race without its knowledge. Reality in the The Invisibles is like a hologram. What we perceive as the &quot;real world&quot; is actually the overlap of two different dimensions. One healthy dimension, Universe A, is represented by the Invisibles. The other terminally diseased universe, Universe B, is represented by the Archons of the Outer Church.\n\nThe Invisibles was Morrison's first major creator-owned title for DC Comics and it drew from his Zenith strip as well as 1990s conspiracy culture. His intent was to create a hypersigil to jump-start the culture in a more positive direction.\nThe title initially sold well but sales dipped sharply during the first series, leading to concerns that the series might be canceled outright. To counteract this, Morrison suggested a &quot;wankathon&quot; in the hope of bringing about a magical increase in sales by a mass of fans simultaneously masturbating at a set time.\nMorrison became seriously ill whilst writing the book, something he attributes to working on the title and the manner in which its magical influence affected him, and has stated that his work on the comic made him into a different person from the one who started it. He has also said that much of the story was told to him by aliens when he was abducted during a trip to Katmandu.\n\nThe third and final series was meant to be a countdown to the new millennium but shipping delays meant the final issue did not appear until April 2000. The third series should be read back-to-front, i.e. #12-1.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:b42b804b1b48d0115b2c9259581d192853f795b0","amp;dn":"The+Invisibles+%5BADULT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b42b804b1b48d0115b2c9259581d192853f795b0","infoHashBuffer":{"type":"Buffer","data":[180,43,128,75,27,72,208,17,91,44,146,89,88,29,25,40,83,247,149,176]},"announce":[],"urlList":[]}}