{"title":"(1970) John Lennon - Plastic Ono Band [VinylRip 24-96] {100.XY}","uid":9671983,"size":808178771,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b4ccf65c98374a945c170feb466d6f9d9c305a5f&amp;dn=%281970%29+John+Lennon+-+Plastic+Ono+Band+%5BVinylRip+24-96%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"100.XY","files":-1,"time":1393477318,"description":"John Lennon - Plastic Ono Band\n\n\n\nimage Review:\nAnyone performing avant-garde music is laying themselves open to a certain amount of hostility and derision at the outset. And if that person also happens to be Yoko Ono, who has not only displayed a gift for hyping herself with cloying &quot;happenings&quot; but also led poor John astray and been credited by more than one Insider with &quot;breaking up the Beatles,&quot; why, the barbs and jeers can only be expected to increase proportionately. Not only do most people have no taste for the kind of far-out warbling Yoko specializes in; they probably wouldn't give her the time of day if she looked like Paula Prentiss and sang like Aretha.\n\nOn the other hand, not much of her recorded product inspires any sympathy. What it mostly inspires is irritation, even in hardened fans of free music and electronic noise. Two Virgins, Unfinished Music No. One, and the distinctly uncatchy Peace jingles on Wedding Album were the ego-trips of two rich waifs adrift in the musical revolutions of the Sixties, as if Saul Bellow had suddenly discovered the cut-ups of William Burroughs and recruited Lenore Kandel to help him forge them in the void.\n\nDilettante garbage, simply. The electronic/collage stuff, like the radio bit and the silent grooves, was a John Cage takeoff equaled by precocious teenagers with tape recorders everywhere, and the screaming had been explored much more effectively by Abbey Lincoln in Max Roach's 1960 We Insist: Freedom Now Suite (ditto Yoko's pre-/ post-coital sighs) and Patty Waters in a weird 1965 ESP-Disk recording (a classic rendition of &quot;Black Is the Color of My True Love's Hair&quot; which found her shrieking the word &quot;black&quot; through every possible disten-tion for 15 minutes).\n\nIt wasn't until the long freak-out on the back of the live Toronto LP that Yoko began to show' some signs that she was learning to control and direct her vocal spasms, and John finally evidenced a nascent understanding of the Velvet Underground-type feedback discipline that would best underscore her histrionics. That record began to be listen-able, even exciting, and the version of &quot;Don't Worry Kyoko&quot; on the back of the &quot;Cold Turkey&quot; single was even better.\n\nNow Yoko finally has an album all her own out, and it bodes well for future experiments by the Murk Twins along these lines. For one thing, Yoko has excellent backup this time: one track features an Ornette Coleman quartet, and the rest find John, Ringo and bassist Klaus Voormann working out accompaniments that are by turns as frenzied as Yoko herself and quite restrained. It always sounds thought-out, carefully arranged, appropriate; and with Yoko's music that's saying something.\n\nAnother strong plus is that all the songs are kept relatively short, make distinct statements, and seldom degenerate into the kind of pointless, prolix yammering Continued from preceding page that characterized her earlier work. In a way, the track with Coleman is the weakest: Yoko is into her &quot;Ohh, John!&quot; riff, and Ornette's band is laying down the kind of a rhythmic noodling that seldom finds them at their peaks. It was a rehearsal tape anyway; what would be really nice would be to hear Yoko with new madmen the likes of Gato Barbieri and Mike Mantler.\n\nThe other tracks, however, are something else again. John's guitar is strong and sizzling, a crazed file cutting through with some of the most eloquent distortions heard in a long time. He's really learning this language now, and his singing high notes and gut-teral rhythms speak with the same authoritative voice he showed with the Beatles. And when he suddenly shifts down from those flurries into an expertly abstracted guitar line straight out of Chuck Berry (as in &quot;Why&quot;), it just takes your breath away.\n\nThere are also two experiments in electronics here: Side One closes with a haunting juxtaposition of &quot;Tomorrow Never Knows&quot; guitar and vocal sounding like one of the modal choirs off the Music of Bulgaria album electronically distorted; and &quot;Paper Shoes&quot; opens with tides of noise and railroad clacks, then moves into a sequence where Yoko's voice, cut up by machine and melted into itself, flashes in wierd echoes around the trestles.\n\nThis one will grow on you. They haven't ironed out all the awkwardness yet, but this is the first J&amp;Y album that doesn't insult the intelligence in fact, in its dark confounding way, it's nearly as beautiful as John's album. Give it a try, and at least a handful of listenings before your verdict. There's something happening here.\nReview by LESTER BANGS\n\n\nimage\n\n\n\nTrack List:\n01 - Mother\n02 - Hold On\n03 - I Found Out\n04 - Working Class Hero\n05 - Isolation\n06 - Remember\n07 - Love\n08 - Well Well Well\n09 - Look At Me\n10 - God\n11 - My Mummy's Dead\n\n\nSummary:\nCountry: UK\nGenre: Rock, hard rock, Art Rock\n\n\nMedia Report:\nSource : Vinyl\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 24-bit PCM\nBit rate mode : Variable\nBit rate : ~2.4-2.8 Mbps\nChannel(s) : 2 channels\nSample rate : 96000 Hz\nBit depth : 32 bits (float)","torrent":{"xt":"urn:btih:b4ccf65c98374a945c170feb466d6f9d9c305a5f","amp;dn":"%281970%29+John+Lennon+-+Plastic+Ono+Band+%5BVinylRip+24-96%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4ccf65c98374a945c170feb466d6f9d9c305a5f","infoHashBuffer":{"type":"Buffer","data":[180,204,246,92,152,55,74,148,92,23,15,235,70,109,111,157,156,48,90,95]},"announce":[],"urlList":[]}}