{"title":"Angelique (Boxset DVD 1-2006)DVD9 (dutch subs) NLT-Release","uid":6017322,"size":6700605238,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b6eb8983899ea3c659e4e5d2cb52cbffe15574f5&amp;dn=Angelique+%28Boxset+DVD+1-2006%29DVD9+%28dutch+subs%29+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1291681274,"description":"Angelique (Boxset DVD 1-2006)DVD9 (dutch subs) NLT-Release\n\n[img]http://img405.imageshack.us/img405/5084/angeliques.jpg[/img]\n\nBeleef de aangrijpende avonturen van de beeldschone AngÃƒÂ©lique (MichÃƒÂ¨le Mercier) die wordt getroffen door het noodlot. Het verhaal gaat over ontmoetingen met de rijke graaf van Toulouse Joffrey de Peyrac (Robert Hossein), haar toekomstige man en enige ware liefde. AngÃƒÂ©lique en Joffrey worden geconfronteerd met de macht van invloedrijke personen tijdens het bewind van Louis XIV, de Zonnekoning. Liefde, actie en avontuur maken van AngÃƒÂ©lique een waar kostuumdrama vol actie. Een tijdloos succes waar mensen van alle leeftijden van zullen genieten!\n\nAngelique DVD 1:\nOmdat haar vader in geldnood is geraakt, stemt de jonge AngÃƒÂ©lique schoorvoetend in met een huwelijk met graaf Joffrey de Peyrac om zodoende haar familie te helpen. De graaf is mismaakt en verlamd, en heeft een reputatie als losbandige magiÃƒÂ«r. In eerste instantie vindt ze hem afschrikwekkend maar naarmate ze deze opmerkelijke man beter leert kennen, wordt ze hopeloos verliefd op hem. De koning is echter ook zeer onder de indruk van haar schoonheid en wil haar tot zijn maÃƒÂ®tresse maken.\n**************************************************\n\nExperience the dramatic adventures of the beautiful Angelique (Michele Mercier) who is struck by fate. The story is about encounters with the wealthy Count of Toulouse, the Joffrey Peyrac (Robert Hossein), her future husband and one true love. Angelique and Joffrey are faced with the power of influential people during the reign of Louis XIV, the Sun. Love, action and adventure of Angel where a costume drama full of action. A timeless success where people of all ages will enjoy!\n\nAngelique DVD 1:\nBecause her father has fallen into financial trouble, the young AngÃƒÂ©lique reluctantly agrees to a marriage with the Count Joffrey Peyrac order to help her family. The count is deformed and paralyzed, and has a reputation as a dissolute magician. At first she finds it daunting but as they get to this remarkable man to know, she is hopelessly in love with him. The king was also very impressed by her beauty and wants to make her his mistress.\n\nBron: Retail Dvd, 5 disks\nSpeelduur 485:00 min\nBeeldformaat: 2.35 :1\nKleur: Color\nTaal: Frans, Engels\nAudio: DD 2.0 / DD 1.0\nOndertitels: Nederlands\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD9 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Avontuur Drama Romantiek\n \nWeblink : http://www.bol.com/nl/p/dvd/angelique-the-complete-collection/1002004004499903/index.html \n\nEnjoy the movie\n\nXX-Men","torrent":{"xt":"urn:btih:b6eb8983899ea3c659e4e5d2cb52cbffe15574f5","amp;dn":"Angelique+%28Boxset+DVD+1-2006%29DVD9+%28dutch+subs%29+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6eb8983899ea3c659e4e5d2cb52cbffe15574f5","infoHashBuffer":{"type":"Buffer","data":[182,235,137,131,137,158,163,198,89,228,229,210,203,82,203,255,225,85,116,245]},"announce":[],"urlList":[]}}