{"title":"From.Justin.To.Kelly.(2003).Dvdrip.Xvid-Kyd.avi","uid":4735527,"size":734566400,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b800ac65e0ac461d71ab662b370eb4455e30265b&amp;dn=From.Justin.To.Kelly.%282003%29.Dvdrip.Xvid-Kyd.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ralaz","files":1,"time":1235258819,"description":"The tale of two American Idols\n\nIn IMDB's bottom 100: #30\n\nGenere: Romance Comedy Musical\n\nSpring break in Miami is the scene. It's where surf-drenched guys cruise girls in bikinis and raucous parties rule day and night. It's the perfect time and place for three young women from Texas and a trio of college guys from Pennsylvania to find adventure and maybe even fall in love. In a Texas dive bar, Kelly is singing her heart out to a few local yokels when her best friends Kaya and Alexa try and tempt her away for some fun in the Florida sun. It's an easy sell--even for the cautious Kelly - and the three head for Miami. Making their way to the same destination is the &quot;Pennsylvania Posse&quot;: college students Justin, Brandon, and Eddie. Justin and Brandon are smooth-talking party promoters, while Eddie's primed to meet Lizzie, the cyber dream girl he's been e-mailing for months. Miami Beach, beating with a rhythm all its own, is teeming with beautiful people. Kelly's friends are drawn into the beachside fun, while Kelly tentatively navigates a sea of strangers. When her eyes meet Justin's, everything changes--in an instant. While Kaya and Alexa are content to survey the parade of eye candy, Kelly's now only interested in the guy with the irresistible smile. The feeling is mutual, and Justin's on fire. But as luck would have it, he loses Kelly's number--and boy-crazy Alexa has already set her sights on Justin. She will stop at nothing--even betraying a friend--to nab Justin as her own. Will true love win out for the star-crossed Justin and Kelly?","torrent":{"xt":"urn:btih:b800ac65e0ac461d71ab662b370eb4455e30265b","amp;dn":"From.Justin.To.Kelly.%282003%29.Dvdrip.Xvid-Kyd.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b800ac65e0ac461d71ab662b370eb4455e30265b","infoHashBuffer":{"type":"Buffer","data":[184,0,172,101,224,172,70,29,113,171,102,43,55,14,180,69,94,48,38,91]},"announce":[],"urlList":[]}}