{"title":"Rush Limbaugh - July 22, 2016 Full Podcast.mp3","uid":15384361,"size":252411957,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b84ea26efa2f3287ee569bc33c4ec3f4d4838f19&amp;dn=Rush+Limbaugh+-+July+22%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1469272919,"description":"Rush Limbaugh - July 22, 2016 Full Podcast\r\n\r\nCNN Astounded by Trump Speech Poll\r\n\r\nPresident Obama Doesn't Get It\r\n\r\nThe Poisoning of the Millennial Mind\r\n\r\nRUSH: This is devastating news.  They got 75% either positive or somewhat positive, but you know what they're saying at CNN?  It may be 75 now, but wait 'til Monday when we get through with this.  By the time we talk people down on this Trump will be lucky to be over 50% after that stupid speech after we destroy him on it.\r\n\r\nTrump Supporter: He Inspires Me\r\n\r\nDemocrat Merchants of Doom and Gloom Tell Us Trump's Speech Was Too &quot;Dark&quot;\r\n\r\nRUSH:  Here is what the Hillary campaign actually said: &quot;Tonight, Donald Trump painted a dark picture of an America in decline. And his answer -- more fear, more division, more anger, more hate -- was yet another reminder that he is temperamentally unfit...&quot;  There was no hate last night.  This is another Democrat trick.  They categorized passion and deep caring as hate. There wasn't any hate for anybody last night.  If anything, there was love expressed for people last night. \r\n\r\nMy Predictions for the DNC\r\n\r\nCruzer: Trump Didn't Speak to Me\r\n\r\nIncredible 13-Year-Old Analyzes Cruz\r\n\r\nRUSH: &quot;Cops getting shot all the time? Eh! No big deal. Why you think it's anything odd?  Why do you think it's anything unusual?&quot;  That's really how Obama wants us to look at this?  I'm so sick of these &quot;new normals&quot; -- economy in decline, 94 million Americans not working, unemployment rate 12, 15% in reality.  And this we're just supposed to accept?\r\n\r\nThe Poisoning of the Millennial Mind\r\n\r\nRUSH: If you have a Millennial child, you probably are familiar with their almost paranoid concern with the concept of sustainability.  And their need, their paranoia of sustainability derives from what they've been told about global warming.  And remember, now they've been told this from the most impressionable years of their lives, age three, four, five, pre-K, kindergarten, they haven't escaped it. \r\n \nhttp://www.rushlimbaugh.com/","torrent":{"xt":"urn:btih:b84ea26efa2f3287ee569bc33c4ec3f4d4838f19","amp;dn":"Rush+Limbaugh+-+July+22%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b84ea26efa2f3287ee569bc33c4ec3f4d4838f19","infoHashBuffer":{"type":"Buffer","data":[184,78,162,110,250,47,50,135,238,86,155,195,60,78,195,244,212,131,143,25]},"announce":[],"urlList":[]}}