{"title":"Just One More Hand - Life in the Casino Economy (2015) Gooner","uid":12530986,"size":1182182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8e135ec66e293e69e4ebf4919134683732937f6&amp;dn=Just+One+More+Hand+-+Life+in+the+Casino+Economy+%282015%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1444257795,"description":"Publisher: Rowman &amp; Littlefield Publishers (February 2, 2015)\r\nLanguage: English\r\nISBN-10: 1442236671\r\nISBN-13: 978-1442236677\r\nASIN: B00T1D4AX0\r\n\r\nJust One More Hand tells a story that workers all over can relate to: an industry that promised a solid and stable livelihood is being transformed by competitive pressures, causing employees to lose their economic footing. What seemed like a good job one day becomes a bad job the next. Incorporating the real experiences of casino employees, the book demonstrates the difficulties for local communities that are building new casinos in the hopes of luring tourists. Local communities placing all their chips on casinos as an economic development strategy face increasingly long odds.\r\n\r\nLife stories of individual workers in Atlantic City are explored in the context of the history of the city and the now-global gaming industry. With more and more casinos competing for customers, employees are feeling the brunt of cost-cutting measures, including the wholesale closure of some casinos. While long-time employees are fighting against concessions and wage stagnation, younger workers juggle multiple part-time and seasonal jobs at several casinos. Policy makers hoping to offset these trends are trying to rebrand Atlantic City for a younger, hipper, and more well-to-do clientele using public-private partnerships. Unfortunately, scant attention is being paid to the core issue in economic development—the need for sustainable livelihoods and meaningful work. Here, Ellen Mutari and Deborah Figart explore the realities of the industry and the lives and challenges the workers within it are facing","torrent":{"xt":"urn:btih:b8e135ec66e293e69e4ebf4919134683732937f6","amp;dn":"Just+One+More+Hand+-+Life+in+the+Casino+Economy+%282015%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8e135ec66e293e69e4ebf4919134683732937f6","infoHashBuffer":{"type":"Buffer","data":[184,225,53,236,102,226,147,230,158,78,191,73,25,19,70,131,115,41,55,246]},"announce":[],"urlList":[]}}