{"title":"36-Hour Day Ebook","uid":9785135,"size":4891299,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9e794308ac1a957249af43c3894c5af8469b80a&amp;dn=36-Hour+Day+Ebook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EdgarS789","files":4,"time":1395152792,"description":"Publication Date: October 7, 2011\n\nOriginally published in 1981, The 36-Hour Day was the first book of its kind. Thirty years later, with dozens of other books on the market, it remains the definitive guide for people caring for someone with dementia. Now in a new and updated edition, this best-selling book features thoroughly revised chapters on the causes of dementia, managing the early stages of dementia, the prevention of dementia, and finding appropriate living arrangements for the person who has dementia when home care is no longer an option.\n\nPraise for The 36-Hour Day\n\n&quot;Both a guide and a legend.&quot; -- Chicago Tribune\n\n&quot;The best guide of its kind.&quot; -- Chicago Sun-Times\n\n&quot;An excellent book for families who are caring for persons with dementia... A book that physicians can confidently recommend to the families of their patients.&quot; -- Journal of the American Medical Association\n\n&quot;Excellent guidance and clear information of a kind that the family needs... The authors offer the realistic advice that sometimes it is better to concede the patient's frailties than to try to do something about them, and that a compassionate sense of humor often helps.&quot; -- New York Times\n\n&quot;An admirably realistic guide to caring for people with Alzheimer's.&quot; -- New York Review of Books\n\n&quot;An excellent, practical manual for families and professionals involved in the care of persons with progressive illnesses... The book is specific and thought-provoking, and it will be helpful to anyone even remotely involved with an 'impaired' person... Highly recommended, especially for public and nursing libraries.&quot; -- Library Journal\n\n&quot;Continues to be the 'bible' of recommendation for any caregiver whose family member suffers from dementia.&quot; -- Bookwatch\n\n&quot;Recommended to all caregivers and families of persons with dementia as an indispensable source of valuable information on a very wide range of topics.&quot; -- Case Management Journals\n\n&quot;An excellent guide with general information for family caregivers of persons with dementia... The text is person focused and describes the complexity and depth of the care required not only for persons with Alzheimer's disease and other forms of dementia but also for caregivers.&quot; -- Activities, Adaptation and Aging","torrent":{"xt":"urn:btih:b9e794308ac1a957249af43c3894c5af8469b80a","amp;dn":"36-Hour+Day+Ebook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9e794308ac1a957249af43c3894c5af8469b80a","infoHashBuffer":{"type":"Buffer","data":[185,231,148,48,138,193,169,87,36,154,244,60,56,148,197,175,132,105,184,10]},"announce":[],"urlList":[]}}