{"title":"The Inspector Lynley Crime Series - Elizabeth George","uid":12041513,"size":1266153212,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ba8f3b36baac3000db6a45c3b24e894f243c17ad&amp;dn=The+Inspector+Lynley+Crime+Series+-+Elizabeth+George&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"davieboy1966","files":135,"time":1434797404,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\n\nAll are unabridged and from Cassette Tapes.\nAll are recorded at 32 kbps / 22 kHz Mono CBR Fraunhofer MP3.\n\n\n\nI have now made available here audio books 1 ~ 6 in this series. No unabridged CD or Electronic Download versions of any of these titles are available to my knowledge.\nThese rare recordings are from cassette tapes - thus the sound quality may not be pristine, but they are reasonably hiss free and clear.\nI consider the author's earlier titles far superior to her later works in this series now in 2015 comprising a total of 19 books.\n\nThe series features Detective Inspector Thomas &quot;Tommy&quot; Lynley, (8th Earl of Asherton) of Scotland Yard and Detective Sergeant Barbara Havers.\nIn addition to the tensions involved in solving murder cases, the series thrives on the characters' clashes regarding personality, gender, and class, as Lynley is an earl (a peer of the realm),\nand Havers comes from a working-class background.\n\n#1. A Great Deliverance [1988] 11 hours 8 mins, read by Michael Tudor Barnes.\nFat, unlovely Roberta Teys is found beside her father's headless corpse, wearing her best dress and with an axe in her lap. Her first words are: 'I did it. And I am not sorry' and she refuses to say more. Inspector Thomas Lynley and DS Barbara Havers are sent by Scotland Yard to solve this particularly gruesome murder. And as they navigate their way around a dark labyrinth of secret scandals and appalling crimes, they uncover a series of shocking revelations that shatter the facade of the peaceful Yorkshire village.\n\n#2. Payment in Blood [1989] 11 hours 40 mins, read by Michael McStay.\nAn isolated Scottish mansion is the venue for a reading of a controversial new play by a West End theatre company. But on the very first evening, the playwright is savagely murdered, and Inspector Thomas Lynley faces the most testing case of his career. For one of the suspects is Lady Helen Clyde, the woman Lynley loves. And as he attempts to untangle the family scandals, fierce theatrical rivalries and long-buried secrets that beset the case, Lynley struggles to balance the clinical detachment of his job with the intensity of his feelings...\n\n#3. Well-Schooled In Murder [1990] 13 hours 37 mins, read by Peter Yudkin.\nThe discovery of a schoolboy's body in an English country churchyard shatters the quiet, confident atmosphere of the Bredgar Chambers School. Who murdered the brilliant boy, and why? How did his body get from the school to a distant churchyard? As Inspector Thomas Lynley and Sergeant Barbara Havers question both the staff and pupils of the school, they sense something extraordinary and evil that has been locked away for several years within the confines of this privileged community....\n\n#4. A Suitable Vengeance [1991] 16 hours 23 mins, read by Davina Porter.\nDetective Inspector Thomas Lynley, 8th Earl of Asherton, has brought to Howenstow, his ancestral home, the young woman he has asked to be his wife. But the savage murder of a local journalist soon becomes the catalyst for a lethal series of events which shatters the calm of the picturesque Cornish community, tearing apart powerful ties of love and friendship, and exposing a long-buried family secret. The resulting tragedy will forever alter the course of Thomas Lynley's life...\n\n#5. For the Sake of Elena [1992] 16 hours 27 mins, read by Terrence Hardiman.\nElena Weaver, in her skimpy dresses and bright jewellery, exuded intelligence and sexuality. A student at St Stephen's College, Cambridge, she lived a life of casual but intense physical and emotional relationships, with scores to settle and targets to achieve. Until someone, lying in wait on the bank of the River Cam, where Elena went running every morning, bludgeoned the young woman to death. Called into the rarefied world of academia, Inspector Thomas Lynley and his partner Barbara Havers find a tangled skein of love, obsession and desire -- a maelstrom of emotion that has claimed Elena Weaver's life.\n\n#6. Missing Joseph [1993] 18 hours 16 mins, read by Diana Bishop.\nIn Lancashire, in gray, bone-chilling December, the vicar of Winslough is found poisoned by water hemlock, which was served--in an apparent accident--by an herbalist, a solitary woman whose sexually precocious daughter the vicar had been counseling. Forensic analyst Simon St. James and his wife Deborah, troubled by their failure to conceive a child, take a long week-end at Winslough in January and are drawn into village gossip about the death, which Simon doubts could have been unintended. Irregularities in the local police follow-up (the constable is sleeping with the herbalist) prompt him to call on his friend Inspector Lynley to reopen the case. Probing relationships between lovers and between parents and children (notable here are those between the constable and his retired-copper father, between the vicar's housekeeper and her mother, both schooled in the local witch tradition), Lynley traces the vicar's death back through London to a long-ago suicide in Cornwell... \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:ba8f3b36baac3000db6a45c3b24e894f243c17ad","amp;dn":"The+Inspector+Lynley+Crime+Series+-+Elizabeth+George","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba8f3b36baac3000db6a45c3b24e894f243c17ad","infoHashBuffer":{"type":"Buffer","data":[186,143,59,54,186,172,48,0,219,106,69,195,178,78,137,79,36,60,23,173]},"announce":[],"urlList":[]}}