{"title":"Guided By Voices - English Little League (2013) [FLAC]","uid":8691499,"size":308441932,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bb4f166d260bee0e6ea11135cf477814316401c9&amp;dn=Guided+By+Voices+-+English+Little+League+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1373894008,"description":"\n  Guided By Voices - English Little League (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 950 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Xeno Pariah\n  02 Know Me As Heavy\n  03 Islands (She Talks in Rainbows)\n  04 Trashcan Full of Nails\n  05 Send to Celeste\n  06 The Quiet Game\n  07 Noble Insect\n  08 Sir Garlic Breath\n  09 Crybaby 4 Star Hotel\n  10 Biographer Seahorse\n  11 Flunky Minnows\n  12 Birds\n  13 The Sudden Death of Epstein's Ways\n  14 Reflections in a Metal Whistle\n  15 Taciturn Cave\n  16 A Burning Glass\n  17 W/ Glass In Foot\n\n  English Little League is the fourth album by the reunited mid-'90s Guided by Voices lineup in a little under a year and it shows the inevitable strain of making so much music in such a short time. Of course, being prolific is basically GbV's calling card, but in the past one could count on a fairly high killer vs. filler ratio. Sometimes even hovering close to 100 percent during the band's salad days. This time it's closer to 50-50, as Robert Pollard's songs sometimes struggle to deliver hooks and the band runs through the fractured power pop paces, but rarely comes to life. These are the times when you wish the band would pack it in. The times you are glad they're back are when Pollard whips out a classic tune and the band starts firing on all four, and it sounds like an older, but still rambunctious, version of the classic band. The shorter, faster Pollard tunes like the rumbling &quot;Crybaby 4 Star Hotel&quot; sound the best, though some of the proggy heavy rockers sound fine too. \n\n  The problems arise on the slower, more introspective songs that give more airtime to the toll years of being Pollard have extracted from his voice. They drag the album to a halt when they arrive, sucking all the energy out of their sound as they ramble along with no strong payoff. The real bright spots on the album are the Tobin Sprout songs. He gets three solo songs and one co-write with Pollard, and they are the brightest, most straightforward songs on the album -- &quot;Islands&quot; is even the best song here. While GbV are clearly Pollard's show and his aesthetic rightfully guides their way, Sprout is doing better work now and it might make sense to showcase his work more on their next record. Which will follow this one in a couple months, no doubt. As for English Little League, the three records the band did in 2012 are all stronger collections, but this is hardly a failure. One just has to search a little harder to find the good songs this time.","torrent":{"xt":"urn:btih:bb4f166d260bee0e6ea11135cf477814316401c9","amp;dn":"Guided+By+Voices+-+English+Little+League+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb4f166d260bee0e6ea11135cf477814316401c9","infoHashBuffer":{"type":"Buffer","data":[187,79,22,109,38,11,238,14,110,161,17,53,207,71,120,20,49,100,1,201]},"announce":[],"urlList":[]}}