{"title":"HISTORY OF POP AND ROCK MUSIC - part 371","uid":7127597,"size":1276644628,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bc0b73dda0905c2ab1dfa08adc5bfdb33283490b&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+371&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1332582191,"description":"PART 371\n\n\n\nPOINTER SISTERS - I'm So Excited (1982)\nPOINTER SISTERS - Jump (1983)\nPOINTER SISTERS - Automatic (1983) \nPOINTER SISTERS - Neutron Dance (1984)\nPOINTER SISTERS - Baby Come and Get It (1984) \nPOINTER SISTERS - He Turned Me Out (1988) \n\n&quot;I'm So Excited&quot; is a song by The Pointer Sisters. The track, written by The Pointer Sisters and Trevor Lawrence, was originally released in 1982 and saw a re-release in 1984. It is considered to be one of the group's signature songs.Upon its release, the single charted at #28 on the Billboard Dance Music/Club Play Singles Chart, #30 on the Billboard Hot 100 and #46 on the Billboard R&amp;B Singles Chart.\n&quot;Jump (For My Love)&quot; was the opening track (and third single) of the Pointer Sisters' 1983 album, &quot;Break Out&quot;.Released prior to the 1984 Summer Olympics games, the song's video featured footage of athletes competing in track and field events. The song was the second of four Billboard Hot 100 top 10 singles in a row for the sisters in 1984; it peaked at #3 in July. It also appeared on Billboard's Adult Contemporary chart and reached the Top 10 in the UK, peaking at number six.The song netted the group a Grammy Award for Best Pop Performance by a Duo or Group with Vocal in 1985.\n&quot;Automatic&quot; is a song by the Pointer Sisters, released on the Planet label at the end of 1983. The song became one of the Pointers' signature tunes and was the first of four consecutive top ten singles from their multi-platinum landmark album,&quot; Break Out&quot;.&quot;Automatic&quot;, which features Ruth Pointer's deep lead vocals, soared to number five on the US Billboard Hot 100 chart and number two on the US Hot R&amp;B/Hip-Hop Songs and US Hot Dance Club Play charts. It repeated that success in other countries such as Canada and the United Kingdom (where it made it to number two only kept from the top spot by Duran Duran's &quot;The Reflex&quot;). The song also became the Sisters' only #1 in the Republic of Ireland. &quot;Automatic&quot;, and its sister song &quot;Neutron Dance&quot;, set the stage for female R&amp;B groups featuring strikingly low alto lead vocals, backed by higher harmonies.\n&quot;Neutron Dance&quot; is a dance/R&amp;B/New Wave song from the Pointer Sisters. Released from their album &quot;Break Out&quot; in 1984, the song hit the US Top 10, peaking at number six on the Billboard chart, and was also featured in the Eddie Murphy motion picture Beverly Hills Cop.\n&quot;Baby Come and Get It&quot; is a song written by Barry Mann, James Ingram and Cynthia Weil.,originally released as a single in January 1984.The song appears on hit album &quot;Break Out&quot; It was the tenth studio album by The Pointer Sisters and their most successful album to date.\n&quot;Serious Slammin'&quot; is the thirteenth studio by the Pointer Sisters, released in 1988 on the RCA label.It was the last record they made with longtime producer Richard Perry. The record's first single, &quot;He Turned Me Out,&quot; reached the R&amp;B top 40. It was their last album to chart on the US Album Charts and it didnt make the R&amp;B Albums Chart for the first time 15 years.\n\n\n","torrent":{"xt":"urn:btih:bc0b73dda0905c2ab1dfa08adc5bfdb33283490b","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+371","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc0b73dda0905c2ab1dfa08adc5bfdb33283490b","infoHashBuffer":{"type":"Buffer","data":[188,11,115,221,160,144,92,42,177,223,160,138,220,91,253,179,50,131,73,11]},"announce":[],"urlList":[]}}