{"title":"AddressBook Cleaner 2.44 + [Patch]","uid":7396648,"size":1859265,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:bc4daaa9dd7c8bebdd8810629378595c70658a1e&amp;dn=AddressBook+Cleaner+2.44+%2B+%5BPatch%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"whazzup89","files":1,"time":1340935347,"description":"Name: AddressBook Cleaner\nVersion: 2.44\n\nIncludes: [Patch] - Removes all limitations, no registration required - Courtesy of Dynasty\n\nLink for more information: http://www.imactools.com/addressbookcleaner/\n\n\nAddressBook duplicates cleaner clears duplicated contacts in Address Book on Mac.\n\nAddressBook Cleaner is a contacts duplicates remover app for cleaning up Apple Address Book on Mac to avoid duplicated contacts. Supposed to keep Address Book clean and contacts unique.\n\nWhy AddressBook Cleaner?\n\nMany chances let you need an app to remove duplicates from Mac Address Book. Those may be, sync process goes wrong somewhere along the line and creating duplicated lists of some contacts, importing VCards from other program etc. It always takes time to find out and delete the duplicates after the terrible dupes being generated.\n\nAddressBook Cleaner is exactly such utility to help you finding out all the duplicated contacts matched the predefined conditions, and marking the ones to be thrown.\n\nRemove duplicated contacts\n\nRemoval of duplicated contacts from mac address book becomes easy with AddressBook Cleaner, simply run it and choose whatever matching conditions. Matched duplicates will be listed in groups, and AddressBook Cleaner attempts to mark discardable ones automatically for deletion.\nSimplify contacts in Apple Address Book\n\nCollating fields of a contact to find out repeated phone numbers and email addresses, and auto mark redundant phone numbers and email address for removal.\nWork with iCloud\n\niCloud is good in many cases, but one of its drawbacks is generating duplicates of contacts. Here is the guide works to clear those dupes from iCloud.","torrent":{"xt":"urn:btih:bc4daaa9dd7c8bebdd8810629378595c70658a1e","amp;dn":"AddressBook+Cleaner+2.44+%2B+%5BPatch%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc4daaa9dd7c8bebdd8810629378595c70658a1e","infoHashBuffer":{"type":"Buffer","data":[188,77,170,169,221,124,139,235,221,136,16,98,147,120,89,92,112,101,138,30]},"announce":[],"urlList":[]}}