{"title":"The Most rapid and Direct means to eternal bliss","uid":11556137,"size":651988,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bcd86721010117799db6d10c6a354a079f352ead&amp;dn=The+Most+rapid+and+Direct+means+to+eternal+bliss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seedcast","files":4,"time":1416830360,"description":"In this book there are practice instructions for seven different methods of meditation including: 1. The Awareness Watching Awareness Method. 2. The Abandon Release Method. 3. The Eternal Method. 4. The Infinite Space Method. 5. The Loving All Method. For thousands of years humans have been stuck in the same pool of inward unsolved problems. Thousands of years ago humans had the problems of suffering, sorrow, anger, fear, violence, conning, cheating, lying, death, etc. Today humans have the problems of suffering, sorrow, anger, fear, violence, conning, cheating, lying, death, etc. All of those problems have a single cause. In this book the cause of the lack of progress and the solution that actually works is revealed. There is a secret, a missing link, a vicious circle, that is keeping humans stuck in the same pool of unsolved problems. That secret, that missing link, that vicious circle is revealed in this book. How to break free of that ancient human trap is also revealed in this book. The solutions taught in the past have failed. Not even one in a million humans has been freed from all suffering and been established in absolutely perfect infinite-eternal-awareness-love-bliss by the solutions that have been taught in the past. It is possible to be free of all sorrow and suffering and to experience absolutely perfect infinite eternal joy in this lifetime. It is possible for all humans, not just a few humans. There is a rapid means to infinite bliss. That rapid means is taught in this book. Whatever spiritual path you are on, this book will be a great help. The problem of the ego distorting, distracting and keeping the attention directed outward is a problem shared by all humans, whatever path they are on. The ego's tricks have seldom been looked at in spiritual literature. The ego's tricks are revealed in this book. How to put an end to the ego's tricks is also taught in this book, making this book a unique and immensely valuable contribution. This book is a great help to all humans, including those who are not on a spiritual path, because the most direct and rapid means to end suffering and sorrow and to live in awareness-love-bliss, is of benefit to all. For human consciousness to be transformed something new must be introduced. This book introduces something new into human consciousness. It is rare that a spiritual book goes into detail revealing the tricks the ego uses to avoid liberation. The Most Direct Means to Eternal Bliss is such a rare book. Step-by-step instructions in how to put an end to the ego's tricks are given in this book. This book shows how to directly experience infinite-eternal-awareness-love-bliss in this lifetime. This book contains a detailed description of the difference between the True Self and the imposter self. Detailed instructions in how to directly experience the True Self are given in this book. Of the thousands of spiritual books you could purchase, The Most Direct Means to Eternal Bliss is the best first choice. This is the book that created a spiritual revolution that is continuing to transform all human life. The direct experience of infinite-eternal-life is available to all humans. There is a fork in the road. One road leads to ideas, beliefs, concepts and opinions. The other road leads to Direct Experience. This book shows the difference between these two roads and how to choose the road that leads to eternal-perfect-love-bliss in this lifetime. This book is a new doorway for humanity. On a combination lock that you have been unable to open it is not the numbers on the dial that are new. It is the combination that opens the lock that is new. The more than fifteen hundred sentences in this book reveal the combination that opens the lock. On the other side of the door is eternal Life-Love-Bliss","torrent":{"xt":"urn:btih:bcd86721010117799db6d10c6a354a079f352ead","amp;dn":"The+Most+rapid+and+Direct+means+to+eternal+bliss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcd86721010117799db6d10c6a354a079f352ead","infoHashBuffer":{"type":"Buffer","data":[188,216,103,33,1,1,23,121,157,182,209,12,106,53,74,7,159,53,46,173]},"announce":[],"urlList":[]}}