{"title":"Sargon The Magnificent Mrs. Sydney Bristowe","uid":7255079,"size":577755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd9fa23dd8493e8638b326b354915e9fe81fccda&amp;dn=Sargon+The+Magnificent+Mrs.+Sydney+Bristowe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"McCoffee","files":1,"time":1336564032,"description":"\nWithin this book, the author explains her reasons for believing that archeological discoveries in Babylonia and other countries prove the historical truth of the first chapters of Genesis, and that in return, those chapters provide the key to problems presented by archeological discoveries which have thus far baffled all investigations. She utilizes evidence from works by leading Assyriologists and from Babylonian inscriptions and drawings in support of her identification of Sargon of Akkad with Cain.\n\nThis book was recommended by some one i trust. That simple tells me. that this book has accurate information on the subject that is covered within it. \n\nThis is the only copy I have found in PDF form online. The document may have some mistakes in the form of typos , because of the method the up-loaded used. \n\nI know that this book will be useful. And will give you deeper insight into what is going on in the Bible, and in our world today. that's what I'm trying to do with my uploads. I'm trying to have all the essential books and documents here. To expand your knowledge bass on these subjects.  Making sure I up-load the most accurate and relevant information on these topics.  ","torrent":{"xt":"urn:btih:bd9fa23dd8493e8638b326b354915e9fe81fccda","amp;dn":"Sargon+The+Magnificent+Mrs.+Sydney+Bristowe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd9fa23dd8493e8638b326b354915e9fe81fccda","infoHashBuffer":{"type":"Buffer","data":[189,159,162,61,216,73,62,134,56,179,38,179,84,145,94,159,232,31,204,218]},"announce":[],"urlList":[]}}