{"title":"PC Ã‚Â» CALL OF CTHULHU - DARK CORNERS OF THE EARTH Full Game dire","uid":5474602,"size":650872986,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bdc0b2ec53adfa8db00db44738125e1f3aad2923&amp;dn=PC+%C3%82%C2%BB+CALL+OF+CTHULHU+-+DARK+CORNERS+OF+THE+EARTH+Full+Game+dire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"globeplus","files":-1,"time":1270065797,"description":"* Hello PC games fans ...\n\n\n* Play this fantastic and intense survival horror game ...\n\n\n* Absolute full game , nothing ripped , small adjustments without changing the gameplay and a private launcher to run the game that includes a walkthrough and a patcher\n\n\n* STORY : *\n\n* The game's protagonist is Jack Walters, formerly a police detective with a talent for solving cases with apparently insufficient evidence (it is implied that he might be a psychic), who was committed to a mental institution after a disturbing encounter during a raid in Boston left him apparently insane and with a split personality. A few years later the secondary personality disappears and he is released, although still suffering from amnesia and schizophrenia.\n\nNow earning a living as a private detective, whilst also attempting to trace his own actions during the period of mental disturbance that he now cannot remember, Jack is contacted to take up a missing person case in the town of Innsmouth. He is sent to Innsmouth by Arthur Anderson, owner of the First National grocery store chain, to find Brian Burnham, the missing clerk who has been running the Innsmouth location. Jack takes the case only to find Innsmouth unfriendly, and that the town does not welcome First National or Brian for being &quot;outsiders&quot;, an attitude which quickly wins Jack enemies in the town.\n\nOver the course of the game, Jack slowly unravels the strange and terrible secrets behind Innsmouth, the Burnham case, and even the Boston incident that initially landed him in the asylum. In an environment filled with murderous cultists, deep-sea monsters, and alien horrors, Jack must try to survive and remain sane despite the horrors of the new case and his afflictions.\n\n\n\nMinimum Specifications :\n========================\n\nWindows XP/2000/Vista/7\n256MB RAM\nPentium III 800Mhz\nSixteen-speed CD-ROM drive\nDirectX 9.0 3D compliant Video Card with 128MB Video RAM\nSound Card (100% DirectX 8.1 Compatible)\nMouse\nDesktop Resolution of 800X600 @ 16-bit color depth minimum\n2.0GB hard-drive space for installation.\n\n\n\n\n\n\n                        ***** enjoy ... *****\n","torrent":{"xt":"urn:btih:bdc0b2ec53adfa8db00db44738125e1f3aad2923","amp;dn":"PC+%C3%82%C2%BB+CALL+OF+CTHULHU+-+DARK+CORNERS+OF+THE+EARTH+Full+Game+dire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdc0b2ec53adfa8db00db44738125e1f3aad2923","infoHashBuffer":{"type":"Buffer","data":[189,192,178,236,83,173,250,141,176,13,180,71,56,18,94,31,58,173,41,35]},"announce":[],"urlList":[]}}