{"title":"John Garcia - John Garcia  mp3  320k    2014","uid":11066155,"size":114065748,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bddc3a35ec39ca2c08beaf8a2eaf77c8280d5163&amp;dn=John+Garcia+-+John+Garcia++mp3++320k++++2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":12,"time":1411226235,"description":"John Garcia (born September 4, 1970) is a vocalist and songwriter. Garcia is best known as the vocalist and founding member of Kyuss, Slo Burn, and Unida. Garcia currently performs in Vista Chino with former Kyuss drummer Brant Bjork.\n\nIn 1989, while still in high school, Garcia formed Kyuss (originally known as Katzenjammer and Sons of Kyuss) with Brant Bjork and Josh Homme. The band produced five albums in total, all of which featured Garcia on vocals. In October 1995, just three months after releasing the album ...And the Circus Leaves Town, Kyuss disbanded. Their final official release was a 10&quot; vinyl on the now defunct label Man's Ruin Records, which was later re-released on a split CD with Homme's post-Kyuss project Queens of the Stone Age. Kyuss had been on an indefinite hiatus ever since. In November 2010, along with former members Oliveri and Bjork, it was announced he would be touring as Kyuss Lives!, and toured Europe, Australia and New Zealand from March to May 2011 with a new studio album expected to follow. Bruno Fevery filled in for Homme, who did not want to participate. In November 2012, following a lawsuit filed by Homme and former Kyuss bassist Scott Reeder, Kyuss Lives! changed their name to Vista Chino.\n\nIn 1996, Garcia formed stoner rock band Slo Burn in Palm Desert, California. Releasing just one EP, Amusing the Amazing, the band's tenure was short-lived, though it was embraced by the former Kyuss fanbase. A total of 9 songs were recorded, but the band did not have enough funds, so the 4 tracks were released as an EP. Bootleg copies of the album that have the remaining 5 tracks exist, unmixed, in varying quality. The band played at Ozzfest in 1997 before disbanding later that year, for reasons never officially revealed.\n\nUpon leaving Slo Burn, Garcia formed the band Unida, which at one point included former Kyuss bassist Scott Reeder. Unida released one album, Coping with the Urban Coyote and a split EP with the Swedish group Dozer. Unida were signed to Rick Rubin's label, American Records, and recorded a second album, El Coyote (alternatively known as The Great Divide) which was unreleased due to company partner, Island/Def Jam, not seeing any commercial potential in the music. The band, however, distributed the album themselves, selling copies at their live shows while on tour. Unida is currently on indefinite hiatus.\n\nIn early 2010, a European tour was announced, starting with a gig at Roadburn Festival in April. Billed as &quot;Garcia Plays Kyuss&quot;, the performances consisted entirely of songs originally recorded by Garcia's former band, Kyuss. His backing-band is composed of Belgian and Dutch musicians from Agua de Annique, Kong, Celestial Season and Arsenal. During their performance at Hellfest on June 20, John Garcia was joined on stage by former Kyuss members Brant Bjork and Nick Oliveri while playing &quot;Gardenia&quot; and &quot;Green Machine&quot;.\n\nIn November 2010, John Garcia formed Kyuss Lives! with Brant Bjork, Nick Oliveri, and Bruno Fevery. Due to legal pressure on November 2012, Kyuss Lives! announced that they had changed their name to Vista Chino.\n\nVista Chino released their debut album Peace on September 3, 2013 through Napalm Records\n\nIn 1998, he joined Hermano, a side-project created by producer Dandy Brown. The band has released four albums since 2002.\n\nIn 1999, Garcia collaborated with Swedish all-female stoner band Misdemeanor on &quot;Love Song&quot;, the fourth track of their EP, Five Wheel Drive.\n\nIn 2001, he contributed vocals to the track The Thing That Should Not Be along with drummer Jason Bonham, bassist Jeff Pilson (Dokken,) and guitarist Kurdt Vanderhoof for the Metallica tribute album Metallic Assault.\n\nIn 2002, Garcia contributed vocals to two tracks on UK band Orange Goblin's album Coup de Grace, &quot;Made of Rats&quot; and &quot;Jesus Beater&quot;.\n\nIn late 2003, Garcia recorded vocals for the song &quot;Born Too Slow&quot; by The Crystal Method. The song became the lead single of Legion of Boom. The song did moderately well in terms of radio airplay and is highly popular among fans of The Crystal Method, particularly because of the howling vocals Garcia laid down on the track. Limp Bizkit guitarist Wes Borland played guitar on the song. Garcia has performed the song live several times with The Crystal Method.\n\nOn December 20, 2005, Garcia would finally team up with Homme again, making a guest appearance onstage with Queens of the Stone Age during the encore of their set at the Wiltern Theatre in Los Angeles, California. They performed three Kyuss songs together: &quot;Thumb&quot;, &quot;Hurricane&quot; and &quot;Supa Scoopa and Mighty Scoop&quot;. This appearance fueled Kyuss reunion rumours, though Homme has stated publicly that a proper Kyuss reunion is unlikely to ever happen.\n\nIn 2006, Garcia collaborated with Canadian band Danko Jones on their third album, Sleep Is the Enemy, contributing vocals to the track &quot;Invisible&quot;. He would again collaborate with Danko Jones on their 2008 album Never Too Loud, appearing on the track &quot;Forest for the Trees&quot; along with Pete Stahl.\n\nGarcia has worked on a solo project under the moniker &quot;Garcia Vs Garcia&quot;, which was originally slated for a September 2008 release but has since been delayed indefinitely. In February 2014 Garcia announced in a Facebook post that he had signed a deal with Napalm Records and plans to release his solo album at the end of summer.\n\nIn 2008, John Garcia collaborated with Belgian band Arsenal on their album Lotuk, contributing lyrics and vocals to two tracks, &quot;Not a Man&quot; and &quot;Diggin' a Hole&quot;. The band members of Arsenal also shot a film documenting the making of the album, including footage of Garcia driving around in his hometown.\n\nIn 2010, he also collaborated with Karma To Burn in the Two Times song which is included in the Appalachian Incantation album.01 - My Mind\n02 - Rolling Stoned (Black mastiff cover)\n03 - Flower\n04 - The Blvd\n05 - 5000 Miles\n06 - Confusion\n07 - His Bullets' Energy\n08 - Argleben\n09 - Saddleback\n10 - All These Walls\n11 - Her Bullets' Energy\n\nGenre:\tStoner\nSubgenre:\tDesert Rock\nBitrate:\t320 k\nSize:\t108.78 MB\nShow/Hide Files: \t\n12 files","torrent":{"xt":"urn:btih:bddc3a35ec39ca2c08beaf8a2eaf77c8280d5163","amp;dn":"John+Garcia+-+John+Garcia++mp3++320k++++2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bddc3a35ec39ca2c08beaf8a2eaf77c8280d5163","infoHashBuffer":{"type":"Buffer","data":[189,220,58,53,236,57,202,44,8,190,175,138,46,175,119,200,40,13,81,99]},"announce":[],"urlList":[]}}