{"title":"the Renegade by Jack Whyte (Guardians series, Book #2","uid":8845609,"size":1493159,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be4620a0c114fbf9835e330c245f53f961403d1a&amp;dn=the+Renegade+by+Jack+Whyte+%28Guardians+series%2C+Book+%232&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":2,"time":1377373561,"description":"The eagerly awaited second volume in the Guardians series. The year is 1284 and it is a period of seeming peace in Scotland. It is also a time when the future of a country is being forged in the form of a young boy, ten-year-old Robert Bruce. He is witness to an extraordinary gathering of noblemen who have come to his family's estate, including King Edward of England, King Alexander of Scotland, and Lord Angus Mohr MacDonald of Islay. It is his first encounter with these powerful men, but it is certainly not his last. And what he sees and learns there about the nature of power will remain with him for many years to come. In the decade that follows, King Alexander dies without an heir and Scotland falls into chaos. The potential for civil war brings a growing threat of invasion from England as Edward I, young Bruce's hero and feudal patron, develops an obsession with adding Scotland, like Wales, to England's crown by conquest. One man with extraordinary vision and strength will unite Scotland's warring factions against the larger threat that looms beyond its borders, but to do so he will have to resolve the conflict of his own personal, feudal, and national loyalties. This is the story of the man destined to be Robert I, King of Scots. Filled with intrigue, high adventure, and remarkable characters, The Renegade is a dazzling feat of storytelling that weaves fascinating historical detail into the drama and excitement for which Jack Whyte is renowned.","torrent":{"xt":"urn:btih:be4620a0c114fbf9835e330c245f53f961403d1a","amp;dn":"the+Renegade+by+Jack+Whyte+%28Guardians+series%2C+Book+%232","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be4620a0c114fbf9835e330c245f53f961403d1a","infoHashBuffer":{"type":"Buffer","data":[190,70,32,160,193,20,251,249,131,94,51,12,36,95,83,249,97,64,61,26]},"announce":[],"urlList":[]}}