{"title":"FSX - Aerosoft - Hughes H-1B &quot;Special&quot;","uid":4203304,"size":69253732,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bee34c9902ed03a6788c31e6403b7c64e7b2df80&amp;dn=FSX+-+Aerosoft+-+Hughes+H-1B+%5C%22Special%5C%22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Papazoff","files":1,"time":1211588798,"description":" &lt;a href=&quot;http://www.aerosoft.com/cgi-local/us/iboshop.cgi?showd,,D10729&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.aerosoft.com/cgi-local/us/iboshop.cgi?showd,,D10729&lt;/a&gt;\n\n\nFrom now on flight sim pilots will know it the hardest plane they ever flown. Because it is designed with just one purpose in mind, to break records, it is uncomfortable, hardly stable and the engine always seems to be waiting for the worst time to go up in smoke.\n\nThe H1 is not an aircraft for the person who just started with FS, it is a very detailed and complex simulation of this rather special aircraft and without reading the manual and understanding the systems you will most likely ruin the engine (or not even get it started). Most our beta testers wrecked at least 6 finely tuned engines before they managed to keep them running. Many systems that are automated in aircraft made after the second World War are manual in this aircraft and they will require your attention at every stage of the flight. While complex this also will greatly enhance your understanding of aircraft systems, even those of modern aircraft. With every flight you will learn to tweak a bit more power out of the engine increasing your top speed. In the end the Aerosoft H1 is thoroughbred, capable of amazing things, but only in the hand of the most experienced pilot.\n\nThe original aircraft is now one of the main exhibits in the Smithsonian institute. Now you can fly this highly realistic aircraft in FSX and see if you can break your own records.\n\nFeatures:\n\n    * Superbly researched project, almost an historical document in FS\n    * Both models (short wing and long wing) versions included\n    * Flight model based on the actual 1930&amp;#039;s wind tunnel test and NACA airfoil data (we are sure Howard Hughes would appreciate that)\n    * Extensive modeling of the exterior and interior of the aircraft in full FSX standards\n    * Very highly detailed Virtual Cockpit with all parts fully animated\n    * Detailed and beautifully designed manual\n    * Low impact on framerate\n    * Special sound module to include full cockpit sounds (so you hear the wobble pump etc)\n    * Engine model unprecedented in detail, including fully new developed failure models for shock cooling, fuel pressure, oil pressure, hydraulic leaks and carburetor icing. All of these are unlike anything you seen on other aircraft.","torrent":{"xt":"urn:btih:bee34c9902ed03a6788c31e6403b7c64e7b2df80","amp;dn":"FSX+-+Aerosoft+-+Hughes+H-1B+%5C%22Special%5C%22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bee34c9902ed03a6788c31e6403b7c64e7b2df80","infoHashBuffer":{"type":"Buffer","data":[190,227,76,153,2,237,3,166,120,140,49,230,64,59,124,100,231,178,223,128]},"announce":[],"urlList":[]}}