{"title":"IPhone Hacks - Pushing the IPhone and iPod Touch Beyond Their Li","uid":7727147,"size":46717063,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf771fd01f15c71ee1ee83f1ce53b1a9ee686ee3&amp;dn=IPhone+Hacks+-+Pushing+the+IPhone+and+iPod+Touch+Beyond+Their+Li&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2010kaiser","files":-1,"time":1350242622,"description":"IPhone Hacks - Pushing the IPhone and iPod Touch Beyond Their Limits-2010kaiser\n\n\n\n\nISBN-10: 0596516649\n\nWith iPhone Hacks (By David Jurick), you can make your iPhone do all you'd expect of a mobile smartphone - and more. Learn tips and techniques to unleash little-known features, find and create innovative applications for both the iPhone and iPod touch, and unshackle these devices to run everything from network utilities to video game emulators.\nThis book will teach you how to:\n\n* Import your entire movie collection, sync with multiple computers, and save YouTube videos\n* Remotely access your home network, audio, and video, and even control your desktop\n* Develop native applications for the iPhone and iPod touch on Linux, Windows, or Mac\n* Check email, receive MMS messages, use IRC, and record full-motion video\n* Run any application in the iPhone's background, and mirror its display on a TV\n* Make your iPhone emulate old-school video game platforms, and play classic console and arcade games\n* Integrate your iPhone with your car stereo\n* Build your own electronic bridges to connect keyboards, serial devices, and more to your iPhone without &quot;jailbreaking&quot;\n\niPhone Hacks explains how to set up your iPhone the way you want it, and helps you give it capabilities that will rival your desktop computer. This cunning little handbook is exactly what you need to make the most of your iPhone.\n\nENJOY AND SEED!!!","torrent":{"xt":"urn:btih:bf771fd01f15c71ee1ee83f1ce53b1a9ee686ee3","amp;dn":"IPhone+Hacks+-+Pushing+the+IPhone+and+iPod+Touch+Beyond+Their+Li","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf771fd01f15c71ee1ee83f1ce53b1a9ee686ee3","infoHashBuffer":{"type":"Buffer","data":[191,119,31,208,31,21,199,30,225,238,131,241,206,83,177,169,238,104,110,227]},"announce":[],"urlList":[]}}