{"title":"90 Deg South (Capt Robert Scott) (Documentary) (1933) [DVDRip]","uid":5334827,"size":731803690,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c028e373c1ff9677ad9a16e6d02e2f1b09ae9b56&amp;dn=90+Deg+South+%28Capt+Robert+Scott%29+%28Documentary%29+%281933%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1265283666,"description":" &lt;a href=&quot;http://www.amazon.com/90-Degrees-South-Scott-Antarctic/dp/6305669422&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.amazon.com/90-Degrees-South-Scott-Antarctic/dp/6305669422&lt;/a&gt;\n\nXVID, 544x400, Qf=0.23, 128 kbs (stereo), 70 mins\n\n\nIn 1910, Captain Robert Scott led a band of explorers to the South Pole, traversing hundreds of miles of the most brutal Antarctic topography only to discover that Norwegian Roald Amundsen had reached the Pole before them. Cinematographer Herbert Ponting made the journey with Scott, shooting still photographs and movie footage along the way. The story was first released to the public in installments in 1911 and 1912, then reedited with Ponting's narration in 1933. From beginning to end, 90 Degrees South is a remarkable work. Strictly from a technical standpoint, the film is amazing when one considers that movie tape would easily turn brittle and shatter inside a camera during such extreme cold. Ponting's shots of the Antarctic landscape, simultaneously beautiful and forbidding, have a stark elegance to them that is timeless. The mood is lightened considerably by his droll commentary on the antics of the continent's wildlife. The real story, though, is the hellish conditions braved by Scott and his men as they trudged endlessly like draft animals to the Pole, dragging the heavy sledge full of supplies behind them. Ponting's camera brought home the day-to-day routines of the party as they slogged on, giving a human perspective to the story. Unimaginable cold and hardship dogged them every step of the way, only to become worse on the return trip. Scott's final journal entries show the team behind schedule and short on supplies, facing a certain death with stiff-upper-lip British reserve, a heroic, tragic end to an impossibly difficult endeavor. Preserved and restored by the National Film Archive (U.K.), this is a landmark documentary that is moving and powerful to this day. --Jerry \n\nRenshaw Product Description\nThe story of an immortal adventure with Captain Robert Scott. Restored by the British Film Institute's National Film Archive, cinematographer Herbert G. Ponting's 90 Degrees South is a spellbinding chronicle of Scott's heroic and ultimately tragic race for the South Pole--not only did Amundsen reach the goal first but Scott and his entire team died on the return trip. Ponting's hauntingly beautiful images of ice caves and Antarctic wildlife are punctuated by diary entries telling of the heart-breaking last days of the doomed expedition. A deeply moving tribute. 70 minutes.","torrent":{"xt":"urn:btih:c028e373c1ff9677ad9a16e6d02e2f1b09ae9b56","amp;dn":"90+Deg+South+%28Capt+Robert+Scott%29+%28Documentary%29+%281933%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c028e373c1ff9677ad9a16e6d02e2f1b09ae9b56","infoHashBuffer":{"type":"Buffer","data":[192,40,227,115,193,255,150,119,173,154,22,230,208,46,47,27,9,174,155,86]},"announce":[],"urlList":[]}}