{"title":"Silverado-`80`s","uid":4312107,"size":759553022,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c21f4f73004dc1ce5dc5c101e524811912b77b6c&amp;dn=Silverado-%6080%60s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jazz3","files":3,"time":1216862760,"description":"Movie Description\nAs the result of a chance meeting, four cowboys on horseback are drawn together to defeat a corrupt frontier sheriff and his vicious posse. An enjoyable high-spirited western. Starring Kevin Kline, Danny Glover, Brain Dennehy and Rosanna Arquette, and written and directed by Lawrence Kasdan (THE ACCIDENTAL TOURIST). Academy Award Nominations: Best Sound, Best Original Score.\n\nCredits \nCast: Kevin Kline \nDirector: Lawrence Kasdan \nProducer: Lawrence Kasdan \n\nSynopsis\nFour cowboys join forces in the Old West to combat injustice in &quot;Silverado&quot;, director Lawrence Kasdan&amp;#039;s loving ode to the Western. Emmett, a quiet loner, saves Paden from sure death in the desert, where a band of outlaws had abandoned him. They then befriend Mal, a black cowboy who was denied service at a saloon, and all three move on to rescue Emmett&amp;#039;s hot-headed brother from being hanged. The quartet finally reach their destination, Silverado, where they must make a stand against the corrupt sheriff and the band of murderous ranchers who have dogged them their entire journey.\n\nFilm Notes\n&quot;Silverado&quot; was produced in ccoperation with the American Humane Association.\n\nAdditional cast: Marvin J. McIntyre (as Clerk), Brad Williams (Trooper), Bill Thurman (Proprietor), Autry Ward (Hat Thief), Jacob Kasdan (Stable Boy), Rusty Meyers (Conrad), Zeke Davidson (Mr. Parker), Lois Geary (Mrs. Parker), Troy Ward (Baxter), Roy McAdams (Tall Outlaw), Patricia Gaul (Kate), Earl Hindman (J. T.), Tom Brown (Augie), Jerry Biggs (Bartender), Sam Gauny (Deputy Garth), Ken Farmer (Deputy Kyle), Bill McIntosh (Deputy Charlie), Charlie Seybert (Shopkeeper), Jane Beauchamp (Woman Neighbour), Jerry Block (Townsman), Ben Zeller (Townsman), and Ross Loney (Red).\n\nAdditional crew: David Israel (as location manager), Richard Walden (camera operator), William F. Bennett (Terra-flite operator), Billy R. Brashier (Projectionist), Janet Kusnick (Illustrator), Robert W. Ramage (Special effects), Floyd Van Wey (Special effects), Richard S. Wood (Special effects), Noteworthy Inc. (Music editing), Gene Feldman (Music editor), Erma Levin (Music editor), Stephen Shubin (Wardrobe - men), Le Dawson (Wardrobe - men), Oda Groeschel (Wardrobe - women), Joseph R. Fineman (Sound editor - dialogue), Norman B. Schwartz (Sound editor - post-production dialogue), Dody Dorn (Foley editor), Clifford Latimer (Foley editor), Karen I. Stern (ADR editor), Arvo Ojala (Technical gun coach), and Corky Randall (Livestock ramrod).\n\nFilmed on location in New Mexico\n\nShot in Technicolor and Super Techniscope. Sound by Dolby. Opticals by Modern Film Effects. Title design by Wayne Fitzgerald.\n\nRated BBFC PG by the British Board of Film Classification.\n\n","torrent":{"xt":"urn:btih:c21f4f73004dc1ce5dc5c101e524811912b77b6c","amp;dn":"Silverado-%6080%60s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c21f4f73004dc1ce5dc5c101e524811912b77b6c","infoHashBuffer":{"type":"Buffer","data":[194,31,79,115,0,77,193,206,93,197,193,1,229,36,129,25,18,183,123,108]},"announce":[],"urlList":[]}}