{"title":"Los Lonely Boys - Los Lonely Boys","uid":6742058,"size":430819076,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c2684b5a96213f6c37b7feefbc18c7ce79b0821a&amp;dn=Los+Lonely+Boys+-+Los+Lonely+Boys&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cdda-flac","files":-1,"time":1318544698,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51d0y7S4BiL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51d0y7S4BiL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Los Lonely Boys\nArtist: Los Lonely Boys\nAudio CD (March 30, 2004)\nOriginal Release Date: 2003\nNumber of Discs: 1\nGenre: Rock\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. SeÃƒÂ±orita\n02. Heaven\n03. Crazy Dream\n04. Dime Mi Amor\n05. Hollywood\n06. More Than Love\n07. Nobody Else\n08. Onda\n09. Real Emotions\n10. Tell Me Why\n11. Velvet Sky\n12. La ContestaciÃƒÂ³n\n\n\nAmazon Review:\nCalifornia's Los Lobos are the reigning kings of Tex-Mex/Rock Espanol. But this debut CD by the San Angelo, Texas band Los Lonely Boys might herald a changing of the guard. This is truly a band of brothers, led by guitarist/vocalist Henry Garza and his younger, bass-and-drum-playing siblings Jojo and Ringo. Like a lot of groups, they had to move away to achieve fame--in their case, to Nashville. But after the release of their EP, Willie Nelson heard them, put them on tour as his opening act, and recorded them at his studio. Stylistically, the Garza brothers' bilingual songs about love and life combine Stevie Ray Vaughan blues, Santana-style guitar licks and R&amp;B. Nelson helps out on guitar, with Reese Wynans on keyboards. Produced by Keb Mo and B.B. King producer John Porter, the music is honest, driving, and down home, especially on the organ-filled uptempo tracks &quot;Senorita&quot; and &quot;Tell Me Why.&quot; The stinging guitar solo on the Afro-anthemic &quot;Onda&quot; recalls the '70s grooves Santana built his chops on, while &quot;The Answer&quot; and &quot;More than Love&quot; are raw power ballads that show off this group's dynamism and diversity.\n\nAllmusic Review:\nLos Lonely Boys are another entry into the rock &amp; roll family band tree. The Garza brothers -- Henry, Jojo, and Ringo (yes, that is his real name and he is the drummer) -- like the Everlys, the Louvins, the Davies (Ray and Dave), the Youngs (Malcolm and Angus), and many others, are forging a new sound from the various roots traditions in American music. Rooted in rock &amp; roll basics such as Chuck Berry, the Beatles, and Ritchie Valens and the Latin rhythm-inspired sounds created by the Santana band, the brothers Garza, who hail from San Angelo, TX, also employ the wondrously soulful and raw Tex-Mex textures created by Doug Sahm and Freddy Fender. Los Lonely Boys' self-titled debut on the Or label was recorded at Willie Nelson's Pedernales Studio in Austin and features Nelson and Reese Wynans guesting on guitar and keyboards respectively on &quot;La Contestacion.&quot; But there is plenty to the sound of Los Lonely Boys; their stew is one rich not only in history, but energy, songwriting craft, fine singing, and amazing playing -- check Henry's riffing, phrasing, and soloing on &quot;Crazy Dreams&quot; and one might think the ghost of Stevie Ray Vaughan is visiting Albert King's. &quot;Dime Mi Amor,&quot; with its funky minor-key chord voicings dredged through a solid Latin rock structure with shimmering son rhythms and conjunto backbeats, is stunning in its complexity, yet is as accessible as any pop song. Driven by Henry's fluid and floral acoustic work and shot through with a soulful Tex-Mex backbeat and vocal harmonies that touch upon the originality of Cesar Rosas' and David Hidalgo's from Los Lobos as well as the Everlys, &quot;Hollywood&quot; is not merely a referencing of source material, but a genuine way of combining ideas to create a new sound, one that is not only inherently, but actually the Garza Bros. As evidenced by songs like &quot;Real Emotion,&quot; &quot;More Than Love,&quot; &quot;Onda,&quot; &quot;Senorita,&quot; &quot;La Contestacion,&quot; and &quot;Velvet Sky,&quot; los Lonely Boys reveal that they are tied to tradition but far from stuck to it; their songs are first-rate, crafted with nuance, grace, and grit and wash over the listener like a late-summer dance party under a full moon. This glorious, dark, and steamy diamond,. rooted in innocence and raw rock &amp; roll beauty, is most definitely a contender for debut album of the year.","torrent":{"xt":"urn:btih:c2684b5a96213f6c37b7feefbc18c7ce79b0821a","amp;dn":"Los+Lonely+Boys+-+Los+Lonely+Boys","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2684b5a96213f6c37b7feefbc18c7ce79b0821a","infoHashBuffer":{"type":"Buffer","data":[194,104,75,90,150,33,63,108,55,183,254,239,188,24,199,206,121,176,130,26]},"announce":[],"urlList":[]}}