{"title":"Doom and Destiny Advanced v1.4.1.0 Android","uid":12787248,"size":11373811,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:c29f3095df6cb3a4676fc36f3cdcef7243e92f60&amp;dn=Doom+and+Destiny+Advanced+v1.4.1.0+Android&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":1,"time":1447878419,"description":"Fight against Solomon Steel, the evil businessman, while he tries to conquer the universe with his ruthless startup! Get involved with the development of the game, experience glitches as never before and create with us the game of YOUR dreams!\r\n\r\nWHAT IS DOOM &amp; DESTINY ADVANCED?\r\nDo&amp;De Adv is the sequel, prequel and reboot of Doom &amp; Destiny. It features a huge world map, awesome action-packed turn base combat, crazy party customization, cross-platform multiplayer, talkative characters, secrets, gags, nerdy jokes and an ever-expanding storyline!\r\n\r\nWAIT WHAT? SEQUEL, PREQUEL AND REBOOT?\r\nOh yes! It's a &quot;sequel&quot; because it's the second installment of the &quot;Doom and Destiny series&quot;. It's a &quot;prequel&quot; because it's set in a timeline preceding the events of Doom &amp; Destiny, BUT it's also a &quot;reboot&quot; because while using the same premise and the four main characters, it tells a brand new story set in a different timeline and even dimension than Doom &amp; Destiny.\r\n\r\nWHAT ABOUT UPDATES?\r\nDoom &amp; Destiny Advanced is constantly updated with EXTRA FREE CONTENT!\r\nThe plot will grow and expand! Missions, side-quests and adventures will be added on a monthly basis!\r\nYour feedback will help us improve the gameplay and craft a great rpg, YOUR rpg!\r\n\r\nTHAT'S AWESOME, BUT WHAT'S IN DO&amp;DE ADVANCED?\r\n15 hours of brand new comical and ever-expanding storyline!\r\nHuge world to explore filled with secrets, fun lore and crazy monsters!\r\nFull freedom of hero's stats customization at each level up!\r\n15 Classes (and more to come!) to change the role of each nerd: from wizard to sorcerer, from thief to cook!\r\n22 Cosplays! Change your hero's outfit! \r\nDynamic turn based combat with mid turn reaction and counter attacks!\r\n150+ Special Powers!\r\n200+ Mean Monsters!\r\n500+ Locations!\r\n60.000+ Words of Text!\r\nOnline cross-platform PvP and Co-op! Summon your friends's party to fight with or against them!\r\nBurp into noblemen's face and blow-up chickens!\r\nNerds never die :D\r\nWhat's in this version : (Updated : Nov 11, 2015)\r\nAdded player ranks to multiplayer features, works like single-player levels but you gain xp by playing online battles. Rank is shown pretty much everywhere your name is shown.\r\nFixed a bug that could slow you down if you push the Safe and get hit by a Minigun.\r\nFixed a bug where you couldn't re-enter the password if you did reset it.\r\nRequired Android O/S : 4.0.3+","torrent":{"xt":"urn:btih:c29f3095df6cb3a4676fc36f3cdcef7243e92f60","amp;dn":"Doom+and+Destiny+Advanced+v1.4.1.0+Android","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c29f3095df6cb3a4676fc36f3cdcef7243e92f60","infoHashBuffer":{"type":"Buffer","data":[194,159,48,149,223,108,179,164,103,111,195,111,60,220,239,114,67,233,47,96]},"announce":[],"urlList":[]}}