{"title":"DVDxDV Pro v. 3.5.8 with [K]rack","uid":8181292,"size":4708957,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c2d523bc9456bb135079e17501f520ee8f546e95&amp;dn=DVDxDV+Pro+v.+3.5.8+with+%5BK%5Drack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1361632082,"description":"Official Web Site:  &lt;a href=&quot; http://www.dvdxdv.com/NewFolderLookSite/Products/DVDxDV.overview.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.dvdxdv.com/NewFolderLookSite/Products/DVDxDV.overview.htm&lt;/a&gt;\n\nCourtesy of TOBW\nFollow instructions on disk image.\n\nDVDxDV Pro is geared towards the video professional and features batch conversion so that multiple video can be performed at once. It is ideal for working with widescreen anamorphic video because it can automatically correct for different pixel aspect ratios. DVDxDV Pro allows you to extract multi-channel audio into individual 24 bit AIFF files (one file for each channel). The interlace field order can be changed to lower field or upper field dominant.\n\nVersion 3.0 is a Universal Binary which supports both Power PC and Intel processors. In addition, it features a new direct to iPod video export preset. This allows you to convert video from a DVD directly to an iPod.\n\nDVDxDV Pro is designed to restore the audio and video from DVDs to any other Quicktime supported format. If you've ever wanted to re-edit the video or send a clip of it over the internet, DVDxDV makes this process easy.\n\nDVDxDV Pro allows users of high end editing systems, such as, Final Cut Pro or Avid Media Composer to extract high quality multi-channel audio from DVDs. Each individual channel in a sound track can be exported to a separate 24 bit AIFF sound file. In addition, DVDxDV Pro allows users to reverse the original interlaced field ordering of a DVD.\n\nDVDxDV Pro can also be used to extract video from VOB or DVD and saved into many different formats. Whether you are attempting to recover video from a damaged DVD or just want to extract a segment of video DVDxDV Pro is the perfect tool for the job.\n\nWhat's New:\n\n* New online help to get the latest tips and tricks for DVDxDV.\n\nSystem Requirements:\n\nPPC or Intel Mac, OS X.4 or greater, Lion Compatible\n\n--- PLEASE SEED ---\n","torrent":{"xt":"urn:btih:c2d523bc9456bb135079e17501f520ee8f546e95","amp;dn":"DVDxDV+Pro+v.+3.5.8+with+%5BK%5Drack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2d523bc9456bb135079e17501f520ee8f546e95","infoHashBuffer":{"type":"Buffer","data":[194,213,35,188,148,86,187,19,80,121,225,117,1,245,32,238,143,84,110,149]},"announce":[],"urlList":[]}}