{"title":"The  Crystal  Key","uid":8243501,"size":1111944355,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c369428c81c8831bdbaef7d32e1e9b7bf42b846e&amp;dn=The++Crystal++Key&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"esharoth","files":-1,"time":1363009677,"description":"Title: The Crystal Key\nGenre: adventure / puzzle-solving / 1st-person\nReleased: 22nd November 1999\nDeveloper: Earthlight Productions\nPublisher: DreamCatcher Interactive\nDescription:\nYour quest for the Crystal Key will take you on an incredible adventure. Armed with only your wits, your journey will take you through fascinating lands of desert, jungle and water as you explore breathtaking worlds, each more beautiful and magical than the last. Rise to the challenge and let your wisdom, instinct and ingenuity lead the way. Carefully examine and solve each puzzle along your path. Secrets lie waiting to be unlocked and discovered by those who possess the Crystal Key. \n\nHow to play:\n1) Burn disc images on CDs or mount them on a virtual drive;\n2) Run Setup.exe on the first disc and install the game (but don't install QuickTime 4 when asked);\n3) Run CK_Letterbox.exe to patch the game (fixes display issues);\n4) Launch the game through its main executable or shortcuts with the first disc inserted (you will have to swap discs while playing).\n\n! Notice\nThe game requires QuickTime to run and I suggest you use QuickTime Alternative instead of the old QuickTime version 4 which comes with the game. Run QuickTime_Alternative_322.exe to install it (you will have to uninstall other versions of QuickTime first). Newer versions of QuickTime might work, but I haven't tested it.\n\n! Notice\nThe game ran fine for me on Windows 7 x64 with all the latest updates installed. I didn't have to use any special compatibility settings.\n\n! Warning\nThere is a game-breaking bug which the developers of the game haven't fixed. When you encounter the error &quot;cannot find file sunlight.tif&quot;, extract CK_Sunlight.zip to where you installed the game and overwrite the original file. This will advance your game to a state after the portion which doesn't work and you'll be able to continue playing.","torrent":{"xt":"urn:btih:c369428c81c8831bdbaef7d32e1e9b7bf42b846e","amp;dn":"The++Crystal++Key","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c369428c81c8831bdbaef7d32e1e9b7bf42b846e","infoHashBuffer":{"type":"Buffer","data":[195,105,66,140,129,200,131,27,219,174,247,211,46,30,155,123,244,43,132,110]},"announce":[],"urlList":[]}}