{"title":"The Legend Of Leigh Bowery","uid":5656620,"size":944131271,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c515703987d033c3ffd797f8eb58994bedf7aa02&amp;dn=The+Legend+Of+Leigh+Bowery&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ProphetZarquon","files":1,"time":1277829099,"description":"The Legend Of Leigh Bowery - 2002\n\nThe original showed some heavy &quot;digital moss&quot; and pixellation.\n\nCRC protection stripped using DVD Shrink at 9.4gb max quality settings.\n\nApplied denoise and trellis quantization.\n\nCompressed to 900mb ffMPEG mp4 with HandBrake double pass slowest encoding.\n\n-----\n\nAbout the movie:\n\nLeigh Bowery was a burly Australian man who became an icon for the London underground cross-dressing, fashion and club scene.\n\nHe performed with world-renowned dancer Michael Clark in the troupe/performance Hail The New Puritans.\n\nHe was instrumental in the creation of the underground dance club Taboo.\n\nSome of his work looks less like a drag queen, and more like an alien clown in a sequined rubber spacesuit.\n\nHe made some of the most outrageous outfits ever seen to this day.  Compare what he did to designs and styles produced more than ten years later.  He was a visionary.\n\n-----\n\nI've never gone cross dressing, but if I did, I'd want to wear something by Leigh Bowery.\n\nIf you read this far, congratulations!  You have more attention span than 95% of us.\n\nI tried downloading this by torrent several times in several forms.  Finally I found the DVD (rare), so now I am giving it back to you!  I hope this torrent finds a few Seeders and sticks around long enough to show a few new people the wondrous insanity of Leigh Bowery.\n\n-----\n\nProphetZarquon:  Would a 700mb file be better?\n\nNo.\n\nProphetZarquon:  Also do iPhone and Android handsets play mp4 files encoded with ffMPEG, or do they need h264/h265?\n\nYes.\n\nProphetZarquon:  Scratch that, plays beautifully on Android 2.1 Evo 4G. Can anyone with an iPhone, iPad, Hero, etc confirm playback quality?\n\nGood question.  Also, how well is your andTorrent client working?  ;)","torrent":{"xt":"urn:btih:c515703987d033c3ffd797f8eb58994bedf7aa02","amp;dn":"The+Legend+Of+Leigh+Bowery","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c515703987d033c3ffd797f8eb58994bedf7aa02","infoHashBuffer":{"type":"Buffer","data":[197,21,112,57,135,208,51,195,255,215,151,248,235,88,153,75,237,247,170,2]},"announce":[],"urlList":[]}}