{"title":"Murder Inc. (1960) Xvid 1cd - Stuart Whitman, May Britt [DDR]","uid":10245423,"size":798062592,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c574989f6fc9d9d6c7242d5b8eadc8e3c8c1ede3&amp;dn=Murder+Inc.+%281960%29+Xvid+1cd+-+Stuart+Whitman%2C+May+Britt+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1401292790,"description":"Murder Inc. (1960) Xvid 1cd - Stuart Whitman, May Britt [DDR]\n\nMurder, Inc. is a 1960 gangster film starring Stuart Whitman, May Britt, Henry Morgan, Peter Falk and Simon Oakland. The Cinemascope movie was directed by Burt Balaban and Stuart Rosenberg. The screenplay was based on the true story of Murder Inc., a Brooklyn gang that operated in the 1930s.\nFalk plays Abe Reles, a vicious thug who led the Murder Inc. gang and was believed to have committed thirty murders, for which he was never prosecuted. The film was the first major feature role for Falk, who was nominated for a best supporting actor Academy Award for his performance. In his 2006 autobiography, Just One More Thing, Falk said that Murder Inc. launched his career.\nThe movie was the first film directed by Rosenberg, who later won acclaim for films that included Cool Hand Luke (1967), and also launched Stuart Whitman's career as a leading man.\nA more highly fictionalized film on the same basic events, The Enforcer (1951), starring Humphrey Bogart, was released in the United Kingdom with the title Murder, Inc.\n\n    CAST:-\n    Stuart Whitman - Joey Collins\n    May Britt - Eadie Collins\n    Henry Morgan - Burton Turkus\n    Peter Falk - Abe 'Kid Twist' Reles\n    David J. Stewart - Lepke\n    Simon Oakland - Lt. Detective William Flaherty Tobin\n    Sarah Vaughan - Nightclub Singer\n    Morey Amsterdam - Walter Sage\n\nDirected by Burt Balaban, Stuart Rosenberg\nProduced by Burt Balaban\nWritten by Burton Turkus\nMusic by Frank De Vol\nRunning time 103 minutes\n\nSYNOPSIS:- Murder Inc (1960)\nAbe Reles (Peter Falk) and Bug Workman (Warren Finnerty), two killers from Brooklyn's Brownsville district, meet in the Garment District to meet with Louis &quot;Lepke&quot; Buchalter, kingpin of an organized crime mob, who hires them as the syndicate's hit men.\n\nTheir first job is to kill Walter Sage (Morey Amsterdam), a Catskill resort owner who has been holding back slot machine profits from Lepke. To get close to Sage, Reles forces singer Joey Collins (Stuart Whitman), an old crony of Sage who owes Reles money, to help him. Reles and his henchman kill Sage. Reles visits Joey and threatens to kill him and his dancer wife Eadie (May Britt) if they tell anyone about the murder. Eadie throws Reles out. Reles later returns to the apartment when Joey is gone and brutally rapes her. Despite her urging Joey refuses to run away, and this causes him and Eadie to split up.\n\nReles continues to carry out assassinations at Lepke's direction. Reles reconciles with the couple by giving them a luxurious apartment filled with stolen goods. Under police pressure, Lepke hides out from the police at Joey and Eadie's new apartment. He treats Eadie like a maid.\n\nDistrict Attorney Burton Turkus (Henry Morgan) takes over the law enforcement campaign against Murder, Inc., enlisting local Brownsville police detective Tobin (Simon Oakland). Lepke orders the death of the entire Brownsville gang as well as Joey and Eadie. Eadie visits Turkus and becomes an informant, as does Joey. He then confronts Reles, who has been arrested, in his cell, and threatens to testify against him. In fear of that, Reles agrees to testify against Lepke in exchange for reduced charges. He provides a detailed account of the activities of Murder, Inc.\n\nTurkus puts Joey and Reles in protective custody and hides them at the Half Moon Hotel in Coney Island. Eadie comes to visit Joey, imploring him to testify against Lepke. Joey is reluctant, fearing the mob will kill Eadie in revenge. Despondent, Eadie slips her police escort and wanders alone on the beachfront, where she is murdered. Later that night, Reles is thrown out the window by an assassin. Joey avenges his wife's death by testifying against Lepke, who is executed.\n\nThe film was the screen debut of Sylvia Miles, Seymour Cassel and Sarah Vaughan. Vincent Gardenia, who later became an acclaimed actor for his performance in Moonstruck, plays a small role.\n\nBased on the true-life book of lawman Burton Turkus, this movie chronicles the rise and fall of the organized crime syndicate known as Murder, Incorporated. Focusing on powerful boss Lepke and violent hitman Reles.\nIt's the mid-1930's Brooklyn. Nightclub singer Joey Collins, newly married to a chorus girl named Eadie, is having problems paying off his loan shark, Abe Reles. Reles will wipe the slate clean if Joey &quot;introduces&quot; him to Joey's friend, Catskills based comic Walter Sage, with who Reles has unnamed business. Joey agrees despite knowing that Reles is planning on roughing up Sage. Joey learns the hard way that Reles is a hit man when Reles instead kills Sage in cold blood. Reles is part of the Brownsville Group - or what would be later dubbed by the press as Murder Incorporated - that works for a crime syndicate. Reles is under exclusive contract to crime boss Louis &quot;Lepke&quot; Buchalter to carry out whatever murders required. Joey and Eadie, now knowing too much about Reles' business, are at a loss on what to do to protect themselves. Things for all concerned change when prosecutor Thomas E. Dewey is appointed to head a special commission against the crime syndicate, Dewey who could subpoena any suspects or witnesses to testify at Grand Jury hearings. Choosing not to testify, Lepke goes into hiding where he meets the Collinses, and increases the killings against anyone who may rat on him at the hearings. With crusading new Assistant DA for Brooklyn Burt Turkus taking a tough stance on the unsolved murders and working with longtime Brooklyn Police Sgt. William Tobin, Lepke believes he could be in for trouble unless he gets rid of those who may know too much, including many in the Brownsville Group - including Reles - and the Collinses. As their previous stance of cooperating with Reles and Lepke seems to get them in deeper and deeper, Joey and Eadie reevaluate what to do to save themselves. \n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 103 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 103 mins","torrent":{"xt":"urn:btih:c574989f6fc9d9d6c7242d5b8eadc8e3c8c1ede3","amp;dn":"Murder+Inc.+%281960%29+Xvid+1cd+-+Stuart+Whitman%2C+May+Britt+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c574989f6fc9d9d6c7242d5b8eadc8e3c8c1ede3","infoHashBuffer":{"type":"Buffer","data":[197,116,152,159,111,201,217,214,199,36,45,91,142,173,200,227,200,193,237,227]},"announce":[],"urlList":[]}}