{"title":"Of The Wand &amp; The Moon Discography [3 FLAC albums, 2 APE alb","uid":8303920,"size":1599496283,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c5814e63bbefdb034fc7c44d432486cc48307e22&amp;dn=Of+The+Wand+%26amp%3B+The+Moon+Discography+%5B3+FLAC+albums%2C+2+APE+alb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"100.XY","files":-1,"time":1364322747,"description":" do not know about you guys, but i love pagan-folk music and traditions, especially inspired in German, Danish and the nordic countries. Pagan music and ,Celtic music. Fortunately my country still belongs to the so called celtic crescent (like a crescent moon shape) that unite countries like Scotland, Ireland, Wales, northeast of Spain and Portugal. I went to pagan festivals where the celtic music united this different countries. Music was performed by bands coming from those countries.\nBut now after my likes i would like to present one of my favourite neofolk bands: Of The Wand &amp; The Moon.\nBesides their amazing music i specially like them because they are tied musically with the &quot;Die Weisse Rose&quot; (The White Rose) movement and they performe alive with Die Weisse Rose band.\n\nThe White Rose (German: die WeiÃŸe Rose) was a non-violent, intellectual resistance group in Nazi Germany, consisting of students from the University of Munich and their philosophy professor. The group became known for an anonymous leaflet and graffiti campaign, lasting from June 1942 until February 1943, that called for active opposition to dictator Adolf Hitler's regime.\nThe six most recognized members of the group were arrested by the Gestapo and beheaded in 1943. The text of their sixth leaflet was smuggled by Helmuth James Graf von Moltke out of Germany through Scandinavia to the United Kingdom, and in July 1943 copies of it were dropped over Germany by Allied planes, retitled &quot;The Manifesto of the Students of Munich.&quot;\nAnother member, Hans Conrad Leipelt, who helped distribute Leaflet 6 in Hamburg, was executed on January 29, 1945, for his participation.\nToday, the members of the White Rose are honoured in Germany amongst its greatest heroes, since they opposed the Third Reich in the face of almost certain death.\nSource: Wikipedia\n\nOf The Wand &amp; The Moon is the creative live and recorded music works of Danish musician Kim Larsen and various guest contributors.\n\nOverview\n\nAfter irreconcilable differences with his previous musical project, Saturnus, Larsen began writing music of a different vein, similar in style to his neofolk influences but very different than the doom metal he had previously created.\nIn 1999, the debut :Of The Wand &amp; The Moon: album was released, entitled Nighttime Nightrhymes. Characterized by folk songs with themes ranging from expressions of love, loss, joy and ancestral Germanic paganism, the album was interspersed with experimental dark ambient pieces and tribal drumming. The album marked a new entry for Denmark in a new wave of Germanic post-industrial folk projects alongside contemporaries such as Forseti and Sonne Hagal.\n2001 saw the release of a second :Of The Wand &amp; The Moon: release entitled Emptiness:Emptiness:Emptiness:, with refined production and a continued but expanded sound from previous work, the album further cemented the reputation of the project. A live version of :Of The Wand &amp; The Moon: also debuted in 2001, beginning a long series of shows over the next few years.\nAfter the release of a split album with Sol Invictus and a few vinyl singles, a collection of b-sides was released entitled Lucifer in 2003. Themed after its namesake yet featuring a photograph of a surprised cat on its cover, the record included various outtakes and unreleased tracks from the :Emptiness:Emptiness:Emptiness period. A box set was also released featuring vinyl versions of previous recordings, as well as exclusive material.\nA single entitled &quot;Hail Hail Hail&quot; was released in 2005 as a preview of upcoming material, showcasing a more experimental side of the project and making use of Arabic instrumentation for the title track. This was followed by a full length album entitled Sonnenheim which met to positive critical and fan reviews alike, marking the project as one of the major groups within its genre. The album further showcased themes of Germanic paganism, as exemplified by the title track &quot;Nighttime in Sonnenheim&quot; and introduced a more extroverted and thematically martial side of the project, with considerably less focus on the romantic love songs that had previously been hallmarks of the band's material.\nSource:Wikipedia\n\nSiben, Matt Howden, Current 93, Death In June, Andrew King, Rose Rowine E Amanti, :Of The Wand &amp; The Moon:, HaWthorn, Unveiled)\n\n\n\nCountry: Danish\nGenre: Neofolk\nQuality: FLAC / APE / mp3 @ 320 kbps\nAlbum List:\n\n(1999) Of The Wand &amp; The Moon - Nighttime Nightrhymes [FLAC]\n(2000) Of The Wand &amp; The Moon - Midnight Will [APE]\n(2001) Of The Wand &amp; The Moon - Emptiness Emptiness Emptiness [FLAC]\n(2003) Of The Wand &amp; The Moon - Lucifer [FLAC]\n(2005) Of The Wand &amp; The Moon - Sonnenheim [APE]\n(2011) Of The Wand &amp; The Moon - The Lone Descent [mp3 @ 320 kbps]\n\nNote: Hope you like this wonderful music, cheers mates.\n","torrent":{"xt":"urn:btih:c5814e63bbefdb034fc7c44d432486cc48307e22","amp;dn":"Of+The+Wand+%26amp%3B+The+Moon+Discography+%5B3+FLAC+albums%2C+2+APE+alb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5814e63bbefdb034fc7c44d432486cc48307e22","infoHashBuffer":{"type":"Buffer","data":[197,129,78,99,187,239,219,3,79,199,196,77,67,36,134,204,72,48,126,34]},"announce":[],"urlList":[]}}