{"title":"DC Universe 52 April 2014 (darkhomr) [ALL]","uid":10289448,"size":2296155810,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c6e6cf9b204c77d049dca6b8534b42f8d3f143c4&amp;dn=DC+Universe+52+April+2014+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":-1,"time":1401841347,"description":"Todays pack includes all the DCU titles for March 2014. People ask me where I get my numbering from since i seem to be two weeks ahead of everyone else. Week 1 was a two title week, with only Flashpoint #5 and Justice League #1 being published. Week 14 was a light week with only one title from the 52 Universe. Fact is, its not the numbering that matters, its the content. \n\n Before uploading these, I am opening them with ComicRack, and made sure they all opened there. If there are problems please let me know. As usual, these are not my scans. Thanks to the original scanners and uppers. If you like what you got here, please purchase them in some form. If this torrent has no seeds please msg me privately. I will be glad to reup anything that has no seeds. It is my policy to not publish my weekly packs unless they are complete, but no later than Friday morning. If you have questions or requests, please message me privately. All descriptions are from DC and taken from Comiclist.\n\n\n\n\n***Week of 4/2/2014***\n\n\n\nAction Comics #30 (CBR 4/2/2014)\n\nFollowing the events of FOREVER EVIL, Superman confronts Lex Luthor--but the world has turned around for these two. The hero has become the villain and the villain the hero as forces beyond these two gather to destroy the Man of Steel, beginning with a dormant Doomsday who has crossed over from the Phantom Zone! \n\nAquaman and the Others #1 (CBR 4/2/2014)\n\nA &quot;FUTURES END&quot; prelude! Spinning out of AQUAMAN, the King of Atlantis and his teammates find themselves targeted by an unknown foe that wants their Atlantean artifacts! Don't miss the start of this all-new series! \n\nBatwing #30 (CBR 4/2/2014)\n\nBatwing races Menace to attempt to save his family! But the Gotham Underground is about to boil over with anarchy, and no matter which tribe rises up from below Gotham City, Batwing will be the first target! \n\nDetective Comics #30 (CBR 4/2/2014)\n\nA bold new direction for DETECTIVE COMICS as THE FLASH creative team of Francis Manapul and Brian Buccelato take over the creative reins! Batman finds himself knee-deep in a new mystery involving a deadly new narcotic that has hit the streets of Gotham City. \n\nEarth 2 #22 (CBR 4/2/2014)\n\nWhen all looks lost--Green Lantern returns!\n\nGreen Arrow #30 (CBR 4/2/2014)\n\n&quot;The Outsiders War&quot; Part 5! Arrow and Robert face a mob of Outsiders. It looks bad . . . but the cavalry is about to arrive in the form of Katana, Butcher, Magus and Kodiak! Will they be in time to save the day? \n\nGreen Lantern #30 (CBR 4/2/2014)\n\nHal Jordan is surrounded on the homeworld of the Khund, the bloodthirsty military wing of a cosmic alliance that's determined to crush the Green Lanterns! So why has he volunteered to fight without his ring? \n\nMovement #11 (CBR 4/2/2014)\n\nVirtue's mysterious past is revealed! Plus, The Movement travels outside of Coral City for the first time to rescue their teammate Burden from his demonic brother! \n\nPhantom Stranger #18 (Trinity of Sin) (CBR 4/2/2014)\n\n'The Crack in Creation' begins! Sin Eater and his new master, the mysterious Non, are marshaling an army of these in-between souls! Their goal? To invade the world of the living and set up a new order! Guest-starring Superman and Dr. Light, who is still dead! \n\nStormwatch #30 (CBR 4/2/2014)\n\nFINAL ISSUE A 'FUTURES END' prelude! The original Stormwatch team returns, as this story sets up the organization's role in the future of the DC Universe! \n\nSwamp Thing #30 (CBR 4/2/2014)\n\nAlec Holland contemplates the Sureen's offer to turn him human. but if he does accept, what happens to his almost all-powerful body? He and his warrior companion Capucine must travel to India to find the answersÃ– and to get there, they'll need help from Vandal Savage! \n\n\n\n\n***Week of 4/9/2014***\n\n\n \nBatgirl #30 (CBR 4/9/2014) \n\nIn this issue, after a sinister game gone wrong, Batgirl confronts a supernatural legend risen from the primordial depths: The Midnight Man! \n\nBatman Eternal #1 (CBR 4/9/2014)\n\nDon't dare miss the start of the Bat-story so big it's going to take every week of the month to tell! A massive cast of Gotham City's best (and worst) examines the relationship between Batman, his allies and his city. In this debut issue, Commissioner James Gordon is caught on the wrong side of the law! \n\nConstantine #13 (CBR 4/9/2014)\n\nLost and confused in the face of the fallout from his actions in 'Forever Evil: Blight,' John Constantine has sold himself out to the Cold Flame and is vulnerable to attack by Spellbinder! \n\nGreen Lantern Corps #30 (CBR 4/9/2014)\n\nJohn Stewart and his team are under siege--and things are about to get way worse! It's become impossible to know who can be trusted and who's a shape-shifting Durlan spy! And you won't believe the twisted origin of the Durlan species! \n\nJustice League 3000 #5 (CBR 4/9/2014)\n\nCadmus tries to add a new member to Justice League 3000. We say 'tried to' because the last thing Firestorm wants to do is join what he considers to be a group of losers. It gets complicated. \n\nSuperboy #30 (CBR 4/9/2014)\n\nA FOREVER EVIL aftermath issue! Superboy is returning to the world post-FOREVER EVIL, but it may not be strong enough to survive this twisted Teen of Steel and his allies from the future. His plan is simple: Wipe out all Super Heroes! \n\nSuperman Wonder Woman #7 (CBR 4/9/2014)\n\nDoomsday has awakened and the Earth and heavens tremble! And discover how Superman and Wonder Woman survived a nuclear blast! \n\nWorlds Finest #22 (CBR 4/9/2014)\n\nFollowing their team-up with Batman and Superman, Power Girl and Huntress have some difficult choices ahead. What's next for the Worlds' Finest . . . and what world will they choose? \n\n\n\n\n\n***Week of 4/16/2014***\n\n\n\n\nBatman #30 (CBR 4/16/2014)\n\n'ZERO YEAR - SAVAGE CITY' begins! \n\nBatman And Wonder Woman #30 (CBR 4/16/2014)\n\nThe quest for Damian's remains takes Batman to Paradise Island and into direct conflict with Wonder Woman! \n\nBatman Eternal #2 (CBR 4/16/2014)\n\nA notorious Batman adversary appears for the first time in The New 52 continuity! \n\nBatwoman #30 (CBR 4/16/2014)\n\nAssault on Arkham Asylum! Wolf Spider needs one more painting, and Batwoman will do anything to keep it out of his hands - even if it means entering the notorious asylum! \n\nBirds Of Prey #30 (CBR 4/16/2014)\n\nAs her teammates fall, only Black Canary stands between the utterly helpless Mother Eve and Ra's al Ghul. If she stands aside, her husband will be saved. If she refuses to fold, everybody else will die! What can she possibly do? \n\nGreen Lantern New Guardians #30 (CBR 4/16/2014)\n\nKyle and the New Guardians are trapped between X'Hal and the Godkillers! Both have the power to destroy dozens of planets-so how does Kyle choose who to stop first? \n\nHarley Quinn #5 (CBR 4/16/2014)\n\nSure, Harley has made some enemies along the way. So what happens when a bunch of them show up to kill her dead? She kills them right back, of course! You've been warned: This issue contains violence. \n\nJustice League #29 (CBR 4/16/2014)\n\nThe Crime Syndicate couldn't kill him, but will Grid destroy him? Cyborg heads directly for the Syndicate with the Metal Men at his side. Can Vic Stone stop his cybernetic half? And how will this battle against the most brutal and evil beings in the universe change Cyborg and the Justice League? \n\nRed Hood And The Outlaws #30 (CBR 4/16/2014)\n\nJason and Kori face off against the Agents of S.H.A.D.E. as they embark on a quest to save a kidnapped Roy from his alien abductors! \n\nSinestro #1 (CBR 4/16/2014)\n\nThaal Sinestro has lost everything he's ever loved: his home, his family, his only friend. But no matter how desperate he becomes, Sinestro will never be without fear . . . a lesson his one-time ally, one-time enemy Lyssa Drak is eager to teach him! Can he take back the despicable Yellow Lantern Corps? Or does the universe have a new destiny in mind for Sinestro? \n\nSupergirl #30 (CBR 4/16/2014)\n\nIn &quot;Red Daughter of Krypton&quot; part 2 of 3, the newest, most powerful Red Lantern finally meets her match! Worldkiller-1 is a cosmic menace from the darkest recesses of Kara's past, and he will gladly destroy every one of her crimson teammates to get to her . . . \n\nTrinity Of Sin Pandora #10 (CBR 4/16/2014)\n\nIn the aftermath of 'Forever Evil: Blight,' Pandora has no time to comprehend the burden facing her when she must take on the awesome power of Giganta! \n\nWonder Woman #30 (CBR 4/16/2014)\n\nWonder Woman, the God of War, takes command of the deadliest army ever! The Amazons are back, and they have some scores to settle! \n\n\n\n\n\n\n\n\n***Week of 4/23/2014***\n\n\n\n\nAll Star Western #30 (CBR 4/23/2014)\n\nNow back in the Old West, Hex finds readjusting to his old life a bit more difficult than he expected - especially when he finds out that there's a NEW Jonah Hex! Plus: This extra-sized issue features a back-up story drawn by the legendary Jose Luis Garcia-Lopez that introduces Madam 44 to The New 52! \n\nAquaman #30 (CBR 4/23/2014)\n\nCenturies ago, he aided Atlantis in a time of great need and suffered great betrayal for his efforts. Now he's back--but is he bent on revenge, or has he been consumed by madness? Don't miss The New 52 introduction of . . . Hercules! Good luck, \n\nBatman Eternal #3 (CBR 4/23/2014)\n\nA gang war erupts in Gotham City, but the G.C.P.D. doesn't plan to help Batman stop it. Plus: The return of a fan-favorite Batman supporting character: Stephanie Brown! \n\nBatman Superman #9 (CBR 4/23/2014)\n\n'First Contact' continues from last month's explosive WORLD'S FINEST #20 as Batman, Superman, Huntress and Power Girl battle a massive new threat to the DC Universe! As Kaizan Gamorra unleashes the means to take down Superman, an unbelievable discovery is made that will have major repercussions in 2014! \n\nCatwoman #30 (CBR 4/23/2014)\n\n&quot;The Race of Outlaws&quot; begins! Despite her best efforts, Selina Kyle just can't stop being Catwoman. What's dragged her back into the catsuit? A globe-trotting contest that will have her competing to earn the prize for being the best thief in the world. But watch out, Catwoman--there's no honor among thieves! \n\nFlash #30 (CBR 4/23/2014)\n\nAn all-new creative team makes its debut to show the deadly consequences of The Flash's speed powers. During the traumatic events of FOREVER EVIL, Central City suffered the worst that the Crime Syndicate could dish out. Now The Flash has returned to make things right, but there are limits to what even the Fastest Man Alive can do! \n\nJustice League Dark #30 (CBR 4/23/2014)\n\nAfter the shocking events of &quot;Forever Evil: Blight,&quot; the team has a new leader--and the first order of business is dealing with a traitor in their midst! \n\nJustice League United #0 (CBR 4/23/2014)\n\nTop comics writer Jeff Lemire teams with superstar artist Mike McKone for the all-new monthly series JUSTICE LEAGUE UNITED, starring the new team of powerful heroes Earth calls Justice League Canada! In the aftermath of FOREVER EVIL, Adam Strange is caught up in an adventure across the far reaches of the cosmos that will unite an unexpected team of heroes including Supergirl, Hawkman, Green Arrow, Stargirl, Martian Manhunter and Animal Man--but if they're on the team, who exactly is Canadian? Plus: Don't miss the debut of a new Canadian hero who will have a huge effect on the group! \n\nLarfleeze #10 (CBR 4/23/2014)\n\nIt's a dog-eat-dog world when 'legendary' Green Lantern G'nort shows up to pick a bone with Larfleeze! \n\nRed Lanterns #30 (CBR 4/23/2014)\n\nGuy Gardner's got a missing comrade, a red-ring-wielding Supergirl, and a deeply pissed-off Atrocitus to deal with! The last thing he needs is another new Red Lantern - especially when this one may be the deadliest Red to ever wear the ring! But whose side will this new Lantern join? And will Rankorr survive his close encounter with Atrocitus and Dex-Starr? \n\nSecret Origins #1 (CBR 4/23/2014)\n\nAt last, the SECRET ORIGINS of the World's Greatest Heroes in The New 52 can be revealed! This new series gets off to an awesome start with the origins of The Last Son of Krypton and Kara Zor-El, Supergirl, plus the first Robin, Dick Grayson. \n\nSuperman #30 (CBR 4/23/2014)\n\nEvery man, woman and child in Smallville has suddenly fallen into a coma while the citizens of the Bottled City of Kandor begin to rise again. Meanwhile, Superman has his hands full as Doomsday cuts a swath of destruction through the heart of the earth itself! \n\nTeen Titans #30 (CBR 4/23/2014) (Final Issue)\n\nIn the wake of FOREVER EVIL, The Titans return to learn that Harvest has grown more powerful in their absence! And with the body of Jon Lane Kent gone from its chamber, Harvest is marshaling all the resources of N.O.W.H.E.R.E. to get it back! All this and the return of Bunker and Beast Boy! \n\n\n\n***Week 4/29/2014***\n\n\n\nBatgirl Annual #2 (CBR 4/29/2014)\n\nIt's the start of a new story arc as Batgirl must unravel a mystery centered around her former BIRDS OF PREY teammate, the woman who betrayed her trust - POISON IVY! \n\nBatman Eternal #4 (CBR 4/29/2014)\n\nBatman battles Batgirl as Jim Gordon's troubles take a turn for the worse! \n\nBatwoman Annual #1 (CBR 4/29/2014)\n\nBatwoman vs. Mr. Bones! Will the DEO triumph over Kate, or will she cross the line and free herself for good! Lingering questions are answered as long-standing conflicts reach their final resolutions. \n\nFlash Annual #3 (CBR 4/29/2014)\n\nThe start of a major new arc for the Fastest Man Alive! In the future, The Flash is a broken man. His powers have failed him time and again at great cost to him and the city he has sworn to protect. Now he's coming back to 2014 to stop the one event that destroyed his life. Meanwhile, in the present, Barry Allen must contend with thieves trying to capitalize on the devastation of FOREVER EVIL. It's a tale of two timelines that ushers in one of DC's most storied characters - featuring The New 52 debut of WALLY WEST! \n\nForever Evil Aftermath Batman vs. Bane #1 (CBR 4/29/2014)\n\nThe title says it all! FOREVER EVIL is over! Now, Batman has returned to take Gotham City back--by force! The only thing standing in his way? BANE! Get ready for the grudge match of the year! \n\nGreen Lantern New Guardians Annual #2 (CBR 4/29/2014)\n\nDon't miss &quot;CURSE OF THE WHITE LANTERN&quot;! Kyle Rayner is the only being in the universe to survive passing through the Source Wall, the bizarre barrier at the end of space. He should have known there'd be consequences - terrible ones! Kyle's mind now contains the most dangerous secret in all of creation . . . and that secret is desperate to get out and get to Earth! Don't miss the story that plants a crucial seed for the next GREEN LANTERN epic! \n\n","torrent":{"xt":"urn:btih:c6e6cf9b204c77d049dca6b8534b42f8d3f143c4","amp;dn":"DC+Universe+52+April+2014+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6e6cf9b204c77d049dca6b8534b42f8d3f143c4","infoHashBuffer":{"type":"Buffer","data":[198,230,207,155,32,76,119,208,73,220,166,184,83,75,66,248,211,241,67,196]},"announce":[],"urlList":[]}}