{"title":"BBC = When Pop Went Epic [MP4-AAC](oan)","uid":14678319,"size":689319811,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c6fe02c2ba303102ac6f9d319ed6496356f5020b&amp;dn=BBC+%3D+When+Pop+Went+Epic+%5BMP4-AAC%5D%28oan%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"oneanight","files":5,"time":1463960907,"description":"\n\r\n\r\n\r\nBBC = When Pop Went Epic the Crazy World of the Concept Album [MP4-AAC](oan)\r\n\r\n \nhttp://imgchicken.com/images/37417129065022327002.png\r\n\r\n\r\nIts possibly one of the most denigrated inventions in the history of music\r\nthe greatest signifier of rock star pomposity. Indeed, in some quarters, the\r\nvery mention of it is likely to provoke sniggering derision, conjuring up\r\nimages of quadruple-gatefold album sleeves, songs that go on for weeks and\r\nstraggly-haired rockers prattling on about mystical lands, unicorns, goblins\r\nand dystopian futures. But - back when people actually took the time to sit\r\ndown and listen to records from beginning to end - for many, nothing delivered\r\na more rewarding experience than the concept album. And for some, it's still a\r\nformat that provides rock music with its high watermark moments.\r\n\r\nThis documentary explores the history of a musical format - usually based around\r\na structured narrative, though sometimes tied together by a loose theme - that\r\ndeveloped to become the equivalent of rock 'n' roll theatre, often on an operatic\r\nscale. The legendary cape-wearing keyboardmeister Rick Wakeman - himself the creator\r\nof several of history's most, ahem, 'elaborate' long players - presents this\r\ninsightful and playful exploration of the greatest examples of the art form.\r\n\r\nFrom social commentary to collected songs of loneliness, heartache and introspection\r\nfrom tales of intergalactic rock stars to anthems of isolated youth, the film takes\r\nus on a journey - examining the roots of the concept album in its various forms,\r\nunpacking some of the most ambitious - and ridiculous - projects of the past fifty years\r\nfrom Woody Guthrie's Dustbowl Ballads to Tales from Topographic Oceans by Yes; the Beach\r\nBoys' Pet Sounds to George Clinton's Mothership Connection; The Wall by Pink Floyd to\r\nThe Flaming Lips' Yoshimi Battles the Pink Robots.\r\n\r\nSome of the mavericks who made the maddest and most memorable big ideas happen are here\r\nto provide their own perspectives, including Ian Anderson (Jethro Tull) Laura Marling;\r\nGeorge Clinton; Wayne Coyne (Flaming Lips) J Willgoose Esq (Public Service Broadcasting)\r\nFish (Marillion) Tony Asher (co-writer of lyrics on Pet Sounds); graphic artists such as\r\nRoger Dean (designer of Yes album sleeves) and Aubrey Powell of design partnership\r\nHipgnosis (Pink Floyd's Dark Side of the Moon and Animals, and Genesis's The Lamb Lies\r\nDown on Broadway).\r\n\r\n\r\nSCREENS\r\n \nhttp://imgchicken.com/images/43430523072367608158.png\r\n \nhttp://imgchicken.com/images/58846448506569064211.png\r\n \nhttp://imgchicken.com/images/22432326318053801118.png\r\n\r\nFORMAT:.......................: MP4\r\nFULLSIZE:.....................: 657 MiB\r\nRESOLUTION:...................: 720*404=16:9\r\nFRAME RATE:...................: 25.000 fps\r\nAUDIO AAC:....................: 256 Kbps [stereo]\r\nCHANNELS:.....................: 2 Front: L/R\r\nLANGUAGE:.....................: English\r\nVIDEO BITRATE:................: 1300 Kbps\r\nSUBTITLES:....................: NONE\r\nRUNTIME:......................: 58mn 47s\r\n\r\nPLEASE SEED - PLEASE SHARE - PLEASE UPLOAD","torrent":{"xt":"urn:btih:c6fe02c2ba303102ac6f9d319ed6496356f5020b","amp;dn":"BBC+%3D+When+Pop+Went+Epic+%5BMP4-AAC%5D%28oan%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6fe02c2ba303102ac6f9d319ed6496356f5020b","infoHashBuffer":{"type":"Buffer","data":[198,254,2,194,186,48,49,2,172,111,157,49,158,214,73,99,86,245,2,11]},"announce":[],"urlList":[]}}