{"title":"Devil in the Milk  Illness, Health and the Politics of A1 and A2","uid":8177966,"size":1549798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7a40480755837b0668e9d31bc9669b9bd9778ba&amp;dn=Devil+in+the+Milk++Illness%2C+Health+and+the+Politics+of+A1+and+A2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gusar19","files":-1,"time":1361566229,"description":"Devil in the Milk: Illness, Health and the Politics of A1 and A2 Milk \n\nBy Keith Woodford (pdf)\n\n \n This groundbreaking work is the first internationally published book to examine the link between a protein in the milk we drink and a range of serious illnesses, including heart disease, Type 1 diabetes, autism, and schizophrenia.\n\n These health problems are linked to a tiny protein fragment that is formed when we digest A1 beta-casein, a milk protein produced by many cows in the United States and northern European countries. Milk that contains A1 beta-casein is commonly known as A1 milk; milk that does not is called A2. All milk was once A2, until a genetic mutation occurred some thousands of years ago in some European cattle. A2 milk remains high in herds in much of Asia, Africa, and parts of Southern Europe. A1 milk is common in the United States, New Zealand, Australia, and Europe.\n\n In Devil in the Milk, Keith Woodford brings together the evidence published in more than 100 scientific papers. He examines the population studies that look at the link between consumption of A1 milk and the incidence of heart disease and Type 1 diabetes; he explains the science that underpins the A1/A2 hypothesis; and he examines the research undertaken with animals and humans. The evidence is compelling: We should be switching to A2 milk.\n\n A2 milk from selected cows is now marketed in parts of the U.S., and it is possible to convert a herd of cows producing A1 milk to cows producing A2 milk.\n\nThis is an amazing story, one that is not just about the health issues surrounding A1 milk, but also about how scientific evidence can be molded and withheld by vested interests, and how consumer choices are influenced by the interests of corporate business.\n\n\n","torrent":{"xt":"urn:btih:c7a40480755837b0668e9d31bc9669b9bd9778ba","amp;dn":"Devil+in+the+Milk++Illness%2C+Health+and+the+Politics+of+A1+and+A2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7a40480755837b0668e9d31bc9669b9bd9778ba","infoHashBuffer":{"type":"Buffer","data":[199,164,4,128,117,88,55,176,102,142,157,49,188,150,105,185,189,151,120,186]},"announce":[],"urlList":[]}}