{"title":"Hawkman v3 (1993-1996)","uid":4144432,"size":534881338,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c89223a4499a836c94b45e09c452a8d3624eef6a&amp;dn=Hawkman+v3+%281993-1996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gilgamesh07","files":38,"time":1208650969,"description":"By request from the forums.\nThis torrent contains Hawkman v3\n\nHawkman is a fictional character, a superhero in the DC Comics universe. Created by writer Gardner Fox and artist Dennis Neville, the original Hawkman first appeared in Flash Comics #1 (1940)\n\nSeveral incarnations of Hawkman have appeared in DC Comics, all of them characterized by the use of archaic weaponry and by large, artificial wings, attached to a harness made from the special Nth metal that allows flight. Most incarnations of Hawkman work closely with a partner/romantic interest named Hawkgirl or Hawkwoman.\n\nDC decided to reboot Hawkman, in a limited series (which later lead to an ongoing series) entitled Hawkworld originally by Tim Truman, and later John Ostrander and Grant Miehm. In this series, Thanagar was a class society which conquered other worlds to enrich itself. Katar Hol was the son of a prominent official who rebelled against the status quo. He and his partner Shayera were sent to Earth and remained there for some years until Hol was apparently killed.\n\nThis created a host of continuity errors as the new Katar Hol was established as having only just arrived on Earth, raising the question as to who had been around previously. In an attempt to resolve the problem it was established through retcons that the Golden Age Hawkman and Hawkgirl had also operated throughout the 1940s up to the 1990s, and that Nth metal came from Thanagar. They had remained active and then joined the original incarnation of the JLA. Moreover, yet another Hawkman - Fel Andar, a Thanagarian agent - had been the one who joined the Justice League during the 1980s, pretending to be a hero but secretly seeking to infiltrate it.\n \nThe series Zero Hour muddied the waters further by merging the different Hawkmen into a &quot;Hawkgod&quot;, who had his own series briefly during the mid-1990s, and who had a small role in the alternate-future series Kingdom Come. After the demise of this series, Hawkman&amp;#039;s continuity was considered by DC to be too complicated, and he was absent from comics for several years.\n\nThanks to the scanners and the original sources.\n\nPlease seed. Please enjoy.\n\n","torrent":{"xt":"urn:btih:c89223a4499a836c94b45e09c452a8d3624eef6a","amp;dn":"Hawkman+v3+%281993-1996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c89223a4499a836c94b45e09c452a8d3624eef6a","infoHashBuffer":{"type":"Buffer","data":[200,146,35,164,73,154,131,108,148,180,94,9,196,82,168,211,98,78,239,106]},"announce":[],"urlList":[]}}