{"title":"Instant Kali Linux [PDF]","uid":9304368,"size":3917992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c948a260149d872bf8444709735195693ea7cb11&amp;dn=Instant+Kali+Linux+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"F1restorm","files":-1,"time":1386293020,"description":"Instant Kali Linux\nAuthor: Abhinav Singh\nPublished: October 25, 2013\nPublisher: Packt Publishing\nISBN: 9781849695664\n\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\nPages: 68\n\nThe 'Instant' series is about condensing information and giving it you in a simple, straightforward way. This is a short and sweet guide to installing and using the motherload of tools onboard Kali. Packt release an Instant guide and then usually an in-depth one, hopefully I'll have that up soon.\nKali is specifically designed for penetration testing. Oh Kali, how I love thee. \nHave fun and don't forget to chain those proxies.\n\nTested on the above readers with no problems. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n___________________________________________________________________________________\n\n\nA quick guide to learn the most widely-used operating system by network security professionals\n\nOverview\nLearn something new in an Instant! A short, fast, focused guide delivering immediate results\nCovers over 30 different tools included in Kali Linux\nEasy guide to set up and install Kali Linux under different hardware sets\nStep by step examples to get started with pen-testing tools\n\nIn Detail\nKali Linux is currently the de-facto standard operating system of the security industry. It acts as a Swiss army knife and is a one-stop solution to most of the problems faced by security professionals. The availability of different open source and free tools under a single banner makes it easy and quick while dealing with security assessments.\n\nTeaching you how to use various tools and techniques effectively using Kali while working on real time scenarios, this concise and practical guide wastes no time, moving straight in to the core topic sand covering various important security assessment tools bundled in Kali Linux.\n\nBeginning with the journey through security assessments, from basic features such as information gathering to working on vulnerability assessment tools, web application pen-testing, cracking passwords, and more. The book also moves on to some advanced concepts such as exploitation frameworks and their architecture, forensic tools, and more. The book eloquently covers various levels of information security.\n\nWhat you will learn from this book\nInstall Kali Linux on standalone or virtual machines\nUnderstand the file structure of Kali Linux\nGather information and scanning using tools like Nmap\nUndertake vulnerability assessments and penetration testing\nWork with exploitation frameworks\nPenetration testing with web applications\nBreak passwords, create backdoors, and rooting etc\nComplete forensic analysis using Kali\n\nApproach\nGet to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks. A quick and handy guide for those who are willing to get straight into the business. This book will build a strong foundation for those who are willing to cover different security assessment areas by mastering various tools and techniques.\n\nWho this book is written for\nIf you are a beginners or an experienced security professional who is willing to dive deeper into the world of information security, then this book is perfect for you. The book is written is simple technical language which requires only a basic knowledge of security assessments and the Linux operating system.\n\n","torrent":{"xt":"urn:btih:c948a260149d872bf8444709735195693ea7cb11","amp;dn":"Instant+Kali+Linux+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c948a260149d872bf8444709735195693ea7cb11","infoHashBuffer":{"type":"Buffer","data":[201,72,162,96,20,157,135,43,248,68,71,9,115,81,149,105,62,167,203,17]},"announce":[],"urlList":[]}}