{"title":"Prison Architect - Alpha 24c - Linux","uid":10942251,"size":119344112,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:ca499f9b42a53fdc07c6af8455b68a4d0f64a162&amp;dn=Prison+Architect+-+Alpha+24c+-+Linux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sharpshot94549","files":-1,"time":1409557262,"description":"Prison Architect Alpha 24c\n\nBuild and Manage A Maximum Security Prison. Prison Architect is the world's latest Prison Management Sim. Starting with an empty plot of land you must construct a holding cell with basic water and electricity to house your first batch of prisoners, to buy you enough time to create a proper cell block.\n\nAlpha 24c Change-Log\n\nWhen the cravings get too bad, just take a stroll to the outer wall... ...and whistle. Contraband now gets thrown over walls and smuggled in the Chef's ingredients. You're gonna need some more dogs!\n\nWe've also massively beefed up the automation - remote controls, time locks and daisy chaining of door servos will free up your time (and your guards) for more pressing matters. Also, Chris went mad and implemented a load of logic gates - WTF!\n\nCHANGES\n\n= Mod System V2\nThe modding system has been substantially upgraded. It is now possible to create new versions of just about everything in a mod:\nObjects / Entities\nRooms / Zones\nEquipment / tools / weapons\nMaterials\nResearch / Bureaucracy\nEmergency Callouts (eg Riot Police)\nReform Programs\nGrants (The only area you could add new content previously)\nJobs (eg tend these vegetables)\nNeeds, and Need Providers (eg &quot;Bladder&quot; is a need, &quot;Toilet&quot; is a need provider)\nProduction / Work rules (eg Move sheet metal to the workshop, load it into the Saw, cut it into license plates)\nCustom graphics can be provided by data/sprites.png. \n(Please keep your sprites.png as small/compact as possible - so we can load more mods at once)\nWe currently only support a single graphics patch at a time, however we will upgrade this for next alpha.\nAll objects can use an optional LUA script to drive their behaviour\nWe have created a sample Mod called &quot;The amazing vegetable garden mod&quot;, which demonstrates many of the new features:\nIt adds a new Vegetable Patch, in which seeds can be planted.\nThese seeds are tended by prisoners, and eventually grow and can be harvested as vegetables.\nThose veg are then taken to a (new) Vegetable Preparation Table in the kitchen, where they are chopped\ninto ingredients.\nThose ingredients are then used for cooking meals within your prison.\nNB more information can be found here:\nPrison Architect Wiki\nOfficial Modding Forums\n= Confidential Informants\nPrisoners can sometimes be hired as Confidential Informants, and will provide insight into illicit activity within your prison.\nPrisoners *might* be willing to become CIs in exchange for being released from a long stint in Solitary.\nIn addition, suffering Withdrawal symtoms from drug abuse, or suppressed from heavy handed treatment will help convince them.\nOnce recruited, CIs must be &quot;activated&quot; and will be escorted in cuffs to the nearest security office. They will then reveal their information in the new &quot;Informants&quot; view under &quot;Contraband&quot;. They will reveal:\nAll contraband owned by prisoners\nAll contraband being smuggled in (eg by delivery trucks)\nAll arranged throw-ins, ie near the outer walls\nAll escape tunnels\nPrisoners who have been in your prison for longer will have more information for you.\nEach time you activate a CI, or act on their information, suspicion in that CI will increase. If their suspicion rises too high, their life may be in danger.\n= Remote Access systems continued\n\nServos can now be set to 'Close on trigger', which means they will close their door when triggered instead of opening it.\nPower Switches can now be turned on and off by an incoming wire connection\nNew object : Pressure pad. Activates when stepped on\nNew object : Status light. Lights up when activated\nRendering speed of all wires increased\nPerformance of logic gates much increased (helps with large circuits)\nWires are now rendered only when an object is selected, or &quot;All Wires&quot; is selected in the Utilities menu.\nContraband thrown over walls is now less likely (minimum distance between throws now 15, previously 10)\nHistorical Contraband now pruned to 7 days maximum. This hugely reduces memory requirements and save game file size, and will also help performance in very long running maps.\nTheft of spoons and forks from the Canteen was becoming excessive. The canteen is no longer a source of spoons or forks.\nWhen multiple objects are in a single square, you can now cycle between them by pressing TAB\nFixed : Broken materials will now be dumped, so they can no longer block things from working. Eg 'Broken' uniforms are never used, but also never replaced.\nCleaning Cupboard rooms now require the Cleaning research to be completed.\nTrees now arrive in packs of 10 (saplings in plant pots), ready for planting (instead of one tree in a single crate)\n\nUpdates\n\nAlpha 24c\n\nA hot-fix meant to correct a critical issue that Alpha 24 introduced to the game:\nFixed: Manual saves not working properly.\n","torrent":{"xt":"urn:btih:ca499f9b42a53fdc07c6af8455b68a4d0f64a162","amp;dn":"Prison+Architect+-+Alpha+24c+-+Linux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca499f9b42a53fdc07c6af8455b68a4d0f64a162","infoHashBuffer":{"type":"Buffer","data":[202,73,159,155,66,165,63,220,7,198,175,132,85,182,138,77,15,100,161,98]},"announce":[],"urlList":[]}}