{"title":"Charles Bukowski Locked in the Arms of a Crazy Life - Howard Sou","uid":8313132,"size":7568445,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca6bc145e43319c675e3e7fd66abfab4e36175f0&amp;dn=Charles+Bukowski+Locked+in+the+Arms+of+a+Crazy+Life+-+Howard+Sou&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RAYscum","files":-1,"time":1364521084,"description":"Mobi amd Epub\n\nBiography , first published 1999 .\nA well researched book , a good read + lots of photos . \nBukowski the legend does take a few knocks here ,\nbut I guess not many of us would stand up to too close a look ..\n\n\n''A former postman and long-term alcoholic who did not become a full-time writer until middle age, Charles Bukowski was the author of autobiographical novels that captured the low life--including Post Office, Factotum, and Women--and made him a literary celebrity, with a major Hollywood film (Barfly) based on his life. Drawing on new interviews with virtually all of Bukowski's friends, family, and many lovers; unprecedented access to his private letters and unpublished writing; and commentary from Norman Mailer, Allen Ginsberg, Sean Penn, Mickey Rourke, Lawrence Ferlinghetti, R. Crumb, and Harry Dean Stanton, Howard Sounes has uncovered the extraordinary true story of the Dirty Old Man of American literature. Illustrated with drawings by Bukowski and over sixty photographs, Charles Bukowski is a must for Bukowski devotees and new readers alike. As the Los Angeles Times noted, \n&quot;Bukowski is one of those writers people remember more for the legend than for the work....but, as Howard Sounes shows in this exhaustively researched biography,\nit wasn't the whole story.&quot;\n","torrent":{"xt":"urn:btih:ca6bc145e43319c675e3e7fd66abfab4e36175f0","amp;dn":"Charles+Bukowski+Locked+in+the+Arms+of+a+Crazy+Life+-+Howard+Sou","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca6bc145e43319c675e3e7fd66abfab4e36175f0","infoHashBuffer":{"type":"Buffer","data":[202,107,193,69,228,51,25,198,117,227,231,253,102,171,250,180,227,97,117,240]},"announce":[],"urlList":[]}}