{"title":"Haunted London- Peter Underwood [Epub &amp; Mobi] [StormRG]","uid":10446890,"size":3256041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cbe373a87b52188020deec01ba27a0a9c79f388a&amp;dn=Haunted+London-+Peter+Underwood+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"krystine","files":-1,"time":1403974236,"description":"Haunted London\nAuthor: Peter Underwood\nPublished: 2013\nPublisher: Amberley Publishing\nASIN: B00GGMYXIG\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nThis was the first book on London s ghosts, when Peter Underwood was President of the Ghost Club. He is uniquely qualified to write Haunted London, presenting a parade and gazetteer of the psychic phenomena of Britain s capital city a city with nearly ten million living inhabitants and the ghosts of many dead ones. As well as all the famous hauntings the Cock Lane ghost, the Grey Man at Drury Lane, the Tower ghosts, the haunted house at Berkeley Square etc. the book contains many new and hitherto unpublished findings. Not all ghosts date back to earlier centuries: there are ghost motorcyclists, for instance, and new buildings on the sites of older ones are as likely to have ghosts as those which still stand. For easy reference, Haunted London has divided up London geographically. Ghostly associations are uncovered in churches, theatres, hotels, inns and scenes of murders. Poltergeist infestation is another phenomenon included in this work which is sure to fascinate anyone wanting to get to know London better whether they be visitors, psychic researchers, students of history, of legend or folklore, or simply lovers of one of the world s finest cities.","torrent":{"xt":"urn:btih:cbe373a87b52188020deec01ba27a0a9c79f388a","amp;dn":"Haunted+London-+Peter+Underwood+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbe373a87b52188020deec01ba27a0a9c79f388a","infoHashBuffer":{"type":"Buffer","data":[203,227,115,168,123,82,24,128,32,222,236,1,186,39,160,169,199,159,56,138]},"announce":[],"urlList":[]}}