{"title":"FF S. Anne Gardner Collection","uid":9014055,"size":1089419,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc5d773c91c9c2478c228255680fb6fd76860baa&amp;dn=FF+S.+Anne+Gardner+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kiralou","files":10,"time":1381162983,"description":"Absolution\n\nAn intricately wowen tapestry of madness, passion and love.\n---\nAn Affair of Love\n\nFrom a dark past, a forbidden love, a secret comes. Among the confusion and the chaos of an unwanted reality, two women find something they neither want nor can deny.\n\nBlayne Ashton-Carlyle is aloof, self-sufficient, and used to damage control. She is at the top of her game, has always contained herself, and has never come up against any contention she could not handle.\n\nGabriella Matheson is a sculptor. The perfect daughter, she appears to have the ideal marriage, complete with two lovely children.\nA shocking revelation is approaching with a vengeance, and all that stands in its way will be eradicated. Both women are on a collision course to a passion they cannot fight, to a love they cannot ignore, to an ending that will change everything.\n---\nCompensation\n\nVictoria is a woman tormented with a past she can't forget. She returns to exact revenge and compensation. Danielle is talented painter who becomes a pawn tossed in a plan of vengeance. Sometimes, memories that haunt us show us the way to our future and our salvation. A tale of revenge, passion and love.\n---\nFor the Love of a Woman\n\nIn a land where oil is supreme, passions rule reason and there is the threat of Civil War; men rule like kings. In this jungle of power, Raisa Andieta resides as one of its masters. Carolyn Stenbeck doesn't understand this land and is just trying to keep her marriage together. A storm is brewing. Civil War is on the air and passions, like the coming storms, begin to erupt.\n---\nThe Very Thought Of You\n\nA chance meeting in the middle of a snowstorm triggers a woman who is buried in her grief to see love once more, through misunderstandings, jealousy, arguments, family friendships, and passion. The end can only be love. Alexandra and Reese will make your heart soar.","torrent":{"xt":"urn:btih:cc5d773c91c9c2478c228255680fb6fd76860baa","amp;dn":"FF+S.+Anne+Gardner+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc5d773c91c9c2478c228255680fb6fd76860baa","infoHashBuffer":{"type":"Buffer","data":[204,93,119,60,145,201,194,71,140,34,130,85,104,15,182,253,118,134,11,170]},"announce":[],"urlList":[]}}