{"title":"DiskState v3.00.1099 (Retail)","uid":3399980,"size":1338979,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cc8ce39ff62a2af2d06b630ca002543903423ee9&amp;dn=DiskState+v3.00.1099+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"useros","files":1,"time":1129998305,"description":"This program reports the current state of your disks: Total MegaBytes, GigaBytes, the amount of space used and free, and the useable swap space (or memory usage). Furthermore, one can browse through the folder structure with an intuitive pie chart showing relative folder space used.\n\nDiskState can also eliminate space wasted after program crashes or by temporary files no longer needed.\n\nThe Duplicate Finder of DiskState uses a powerful 128-bit MD5 technology to track down redundant files. CRC32 is also available. Even if the file names are different, DiskState identifies duplicates by content and displays duplicates in a comprehensive list.\n\nGot a lot of MP3s, image files and other multimedia duplicates? Then DiskState can help you with an easy-to-use wizard to remove those hogging duplicate multimedia files!\n\nNext, DiskState can capture the state of all files recursively in a folder tree. This enables the user to compare old states with newly captured ones. Ideally for detecting changes in files, deleted and added files in a given folder structure.\n\nReports can be generated to find the oldest files, archive files etc. on a disk volume. Find files edited within a specified time period, files with given attributes like compressed, read-only, hidden and so forth. The whole report generator is fully user-customizable. Adding new reports is simple.\n\nDiskState provides a deletion engine for scheduling cleanups regularly.\n\nA notification can be given, either by a popup window or email, when a volume has reached its level of capacity.\n\nFile deletions are SAFE. DiskState can easily restore back the state of cleaned file entries.\n\nA cool tool to extract boot blocks in a multi-boot environment. This is useful if e.g. the Windows 2003 Server installer has erased your Linux boot block. Add Linux, BeOS, OS/2 and over 200 known boot blocks to your Windows NT/2000/XP boot menu in a breeze.\n\nDiskState has various cleanup tools. One example is the &quot;Cover Your Tracks&quot; to remove traces you leave after surfing the web. You can remove traces of your browsing from Internet Explorer, Netscape and Opera web browsers. Valuable information can be left intact for malicious users to see and abuse. DiskState can remove this information for you.\n\n\nVersion 3.00.1099 released (Oct 21st 2005)\n\n\nWhat is new in v3.00\n\nAdded UNC support for drives.\nAdded full support for file system reparse points. Volume mount points and symbolic links with circular detection algorithm.\nRewritten duplicate base select engine.\nAdded new option to Base Select: Keep longest name.\nAdded new context menu item for duplicate result window: Deselect all files in this folder.\nImproved the Deletion Engine by adding automatic log and zip archive rotation. Furthermore, the engine is better suited for archival purposes (e.g. archive files older than 5 years).\nNew core data structures are in place. Faster and more maintainable.\nUI Tweaks: Add/Remove programs remembers last selected item after refresh.\nUI Tweaks: About dialog includes button to check for program updates.\nUI Tweaks: Added warning when closing result windows that took a while to gather.\nUI Tweaks: Dupes Results Delete now remembers last selected file. Also highlights portion of result list that contain problems/questions.\nMinor bugfixes: Deletion engine zip safety path.\nMinor bugfixes: When files are already deleted in a result list, no error condition is thrown now.\nPerfectDisk 7 support added.\nOpera 8 support added.\nFirefox support added.\nMiscellaneous fixes and cosmetic touchup.\n","torrent":{"xt":"urn:btih:cc8ce39ff62a2af2d06b630ca002543903423ee9","amp;dn":"DiskState+v3.00.1099+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc8ce39ff62a2af2d06b630ca002543903423ee9","infoHashBuffer":{"type":"Buffer","data":[204,140,227,159,246,42,42,242,208,107,99,12,160,2,84,57,3,66,62,233]},"announce":[],"urlList":[]}}