{"title":"Sign Of the Four","uid":10628647,"size":109386714,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cd79417cc83ffddd16c7f2eae5805a8f5d2ae543&amp;dn=Sign+Of+the+Four&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pigman58","files":2,"time":1406279590,"description":"2 x 60 mins\n\nClive Merrison and Michael Williams are on top form in this two part dramatisation of the Conan Doyle novel. \n\nFor those who require it, the first part of the synopsis herewith, courtesy of Wikipedia:\n\nIn 1888 a client, Mary Morstan, comes with two puzzles for Holmes. The first is the disappearance of her father, British Indian Army Captain Arthur Morstan in December 1878. According to Mary, her father had telegraphed her upon his safe return from India and requested her to meet him at the Langham Hotel in London. When Mary arrived at the hotel, she was told her father had gone out the previous night and not returned. Despite all efforts, no trace has ever been found of him. Mary contacted her father's only friend who was in the same regiment and had since retired to England, one Major Sholto, but he denied knowing her father had returned. The second puzzle is that she has received six pearls in the mail from an anonymous benefactor, one per year since 1882 after answering an anonymous newspaper query inquiring for her. With the last pearl she has received a letter remarking that she has been a wronged woman and asking for a meeting. Holmes takes the case and soon discovers that Major Sholto had died in 1882 and that within a short span of time Mary began to receive the pearls, implying a connection. The only clue Mary can give Holmes is a map of a fortress found in her father's desk with the names of Jonathan Small and three Sikhs named Dost Akbar, Abdullah Khan, and Mahomet Singh.","torrent":{"xt":"urn:btih:cd79417cc83ffddd16c7f2eae5805a8f5d2ae543","amp;dn":"Sign+Of+the+Four","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd79417cc83ffddd16c7f2eae5805a8f5d2ae543","infoHashBuffer":{"type":"Buffer","data":[205,121,65,124,200,63,253,221,22,199,242,234,229,128,90,143,93,42,229,67]},"announce":[],"urlList":[]}}