{"title":"Behula Lakhindar (1977)  Bengali_VCD_No Subs [DDR]","uid":8373296,"size":1421813956,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cdbaa76ab0a1e2a50ce9f3b1d53daa4e9d7fdc95&amp;dn=Behula+Lakhindar+%281977%29++Bengali_VCD_No+Subs+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1365979024,"description":"Behula Lakhindar (1977)  Bengali_VCD_No Subs [DDR]\n\nCAST:-\nAbhi Bhattacharya\nTarun Kumar\nMahua Raychowdhury\nKali Bandyopadhyay\nSubrata Chattopadhyay\nSukhen Das\nSatindra Bhattacharya\n\nDirected by Amal Dutta\nMusic: \tSantosh Mukhopadhyay \nPlayback Singers:- Arundhati Holme Chaudhary, Hemant Kumar, Anita Mazumdar, Amar Pal, Shyamal Mittra, Dhananjay hattacharya\n\nSongs are included in MP3s\nBehula Lakhindar (1977) 00. Title Music Credits, Joy Nitya Sathya Shiv Shankar, Dhananjay Bhattacharya, Santosh Mukhopadhyay\nBehula Lakhindar (1977) 01. Bondibo Bondibo Aaj, Amar Pal, Santosh Mukhopadhyay\nBehula Lakhindar (1977) 02. Dance Only\nBehula Lakhindar (1977) 03. Ami Sajani Sejechhi, Anita Mazumdar\nBehula Lakhindar (1977) 04. Joy Joy Shib Joy Joy Shambo, Hemant Kumar\nBehula Lakhindar (1977) 05. Amader Lakhar abe Biye, Shyamal Mittra\nBehula Lakhindar (1977) 06.Rimi Jhini Baje, Arundhati Holme Chaudhary\nBehula Lakhindar (1977) 07.Jago Jago Debgan, Arundhati Holme Chaudhary\nBehula Lakhindar (1977) 08.Ogo Dukhohara, Arundhati Holme Chaudhary\nBehula Lakhindar (1977) 09. Ma Mago Jagat Gaauri Maa, Arundhati Holme Chaudhary\nBehula Lakhindar (1977) 10. Dukhini Duhita Ami, Arundhati Holme Chaudhary\n\n\nMOVIE REVIEW:- Behula Lakhindar (1977) Bengali\nBehula, is the heroine in the Manasamangal genre of Bengali medieval epics. A number of works belonging to this genre were written between the thirteenth and eighteenth centuries. Though the religious purpose of these works is to eulogise the Hindu goddess Manasa, these works are more well known for depicting the love story of Behula and her husband Lakhindar. \n\nBehula continues to fascinate the Bengali mind, both in Bangladesh and West Bengal. She is often seen as the archetypal Bengali woman, full of love and courage. This image of Behula is reflected in one of the poems of Jibananda Das. Behula was the daughter-in law of Chand Sadagar of Champaknagar.According to myth, two beautiful &quot;apsara's of the kingdom of heaven, Usha and Aniruddha were cursed by Gods as per the plan of Goddess Manasa and sent to earth as Behula and Lakshinder- Behula as the only daughter of Say bene and Lakshinder as the seventh son of Chand sadagar. Chand sadagar was a great devotee of Shiva and for certain reasons he hated Manasa. But Manasa had to get &quot;Anjali&quot; by Chand sadagar's right hand- the Bhaktasreshto to get position of Goddess in the heaven.However, Chand sadagar promised to himself that he will never give anjali to Manasa by the hand he uses to give anjali to Lord Shiva. To get an anjali from Chand, Manasa took away his six sons.They died from poisonous snake bites and manasa had absolute power over all snakes. These deaths infuriated Chand sadagar even more and he vowed to save his last son, lakhinder, in any way possible. Chand found a girl,Behula, whose destiny spoke that she will never be a widow. Chand got his seventh son, Lakshinder married with Behula. Chand also had an iron-palace built without any hole so that not a single snake could enter the house. Bishyakarma made it for the wedding night of Behula-Lakshinder. But due to the request of Manasa, Bishyakarma kept a hole in the palace. The night came and Manasa sent her Kalnagini, the most poisonous snake, to the iron palace. Behula fell asleep due to a spell Manasa cast on her. When Kalnagini was going to bite Lakshinder, she saw that Behula had committed no sin for which she might be given such a harsh punishment. So kalnagini, with the help of the lower end of her body smeared the parting of Behula's hair with the oil of the lamp, which was a sin according to the Hindu mythology. After she bit Lakshinder, Lakshinder shouted aloud. Behula woke up and saw kalnagini going out of the room. In anger, she threw the jaanti towards kalnagini and the lower part of the snake's body was cut off. kalnagini was not eager to bite Lakshinder; Manasa forced her to do so. To get back her husband's life from the Gods in the heavens, Behula sailed with her husband in a raft towards Heaven. She faced many dangers during her incredibly long and difficult journey in the rivers. After reaching Heaven, she pleased all the Gods with her beautiful and enchanting dancing and got the Gods to promise to give back her husband's life on the condition that Chand would give anjali to Manasa. Desperate to save his son's life, finally Chand gave in and gave the anjali by the left hand. Consequentlty Manasa got the position of Goddess in heaven and gave back the life of all the six sons of Chand. Behula is regarded as the epitome of loving and loyal wife in the Bengali culture.\n\nBehula-Lakhindar is a mythological fim inspired and based on the bengali epic Manasamangal. Though its religious purpose is to glorify the Hindu Goddess Manasa, it also depicts the love story of Behula and her husband Lakhindar. Under a curse Aniruddha and Usha are sent to earth as Lakhindar, youngest son of Chand Saodagar of Champaknagar, and Behula, daughter of Sayven of Ujaninagar. Chand Saodagar is an irrational man who abuses Manasa and also threatens to break her bones. This conflict between man and the Goddess brings out social discriminations. Shiva, whom Chand worships gives Manasa a chance to alleviate her position to become a Goddess if Chand worships her, but Chand refuses to do so. Chand does not have the wisdom to offer Manasa a token flower. An angry Manasa eats up six of Chands sons. Chands youngest son is Lakhinder. Lakhinder gets married to Behula. The room of the newly wed couple is made of iron. Kalia the venomous snake enters the room and tries to bite Lakhinder. Behula resuses to accept her husbands death. She places his body on a raft and sets out on a hazardous journey towards the abode of the Gods. She pleads for his life and promises Manasa that Chand will worship her. After Behula returns home with Lakhundar and her six brothers in law, Chand finally bows before the powers of Manasa.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-1\nVideo Bitrate: 1119 kbps\nVideo Resolution: 352x288\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 25.000\nAudio Codec:  MPEG-1 Layer 2\nAudio Bitrate: 224kb/s CBR 44100 Hz\nAudio Streams: 2\nAudio Languages: Hindi\nRunTime: 2:10:57\nSubtitles: NONE\nRipped by: Trinidad [DDR]    \nDuration: 2:10:57","torrent":{"xt":"urn:btih:cdbaa76ab0a1e2a50ce9f3b1d53daa4e9d7fdc95","amp;dn":"Behula+Lakhindar+%281977%29++Bengali_VCD_No+Subs+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdbaa76ab0a1e2a50ce9f3b1d53daa4e9d7fdc95","infoHashBuffer":{"type":"Buffer","data":[205,186,167,106,176,161,226,165,12,233,243,177,213,61,170,78,157,127,220,149]},"announce":[],"urlList":[]}}