{"title":"Paul Desmond - Take Ten (1963) [Jazz][mp3 320][h33t][schon55]","uid":4828973,"size":134219847,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cddefe9d4d36c100ceb9f5a0e6e3552e07553a7c&amp;dn=Paul+Desmond+-+Take+Ten+%281963%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":15,"time":1239056603,"description":"Paul Desmond - Take Ten\nLabel  RCA Victor \nOrig Year  1963\nRelease Date  Mar 09, 1999 \nBitrate: 320 kbps \n\nAlto saxophonist Paul Desmond has been considered one of the avatars of the cool school of jazz. One of the few saxophonists of his generation to not be overly influenced by Charlie Parker, Desmond favored a sound that was somewhat mellow, suave,  Full Description smooth and dry - so much so that critics and fans would liken his style to &quot;a very dry martini.&quot;  These appellations certainly weren't meant to imply that there's no emotion or swing in his playing, only that the focus is away from forced emotionalism.   TAKE TEN was recorded in 1963, with a small crew of sympatico musicians, including one of the finest mainstream jazz guitarists ever, Jim Hall.  Hall and Modern Jazz Quartet drummer Connie Kay are the closest thing to &quot;counterparts&quot; on their instruments to the Desmond approach: tight, economical, tasteful.  Everyone compliments each other perfectly. The program mixes originals, standards ( &quot;Alone Together&quot; ) and several bossa nova pieces ( &quot;Samba De Orpheau,&quot; &quot;Theme From Black Orpheus&quot; ).  Desmond makes each piece his own.  Nicely recorded, this album is recommended for both fans and newcomers. ~ CDUniverse\n\nI guess everybody knows Paul Desmond from &quot;Time out&quot; and from his composition Take Five.  On this recording, it doesn't take much time to recognize his beautiful floating tone, his wonderful solos which are new melodies by themselves, his &quot;cool jazz&quot; signature. On this repertoire -- mostly bossa nova tunes, plus a few standards -- Paul Desmond and Jim Hall (on the guitar) rival of grace: their solos are full of twists and turns, they never hurry and they both contribute to create a very relaxed atmosphere.  Connie Kay's drums add some sun to this session. Everything sounds so clean and sweet! Though, they escape the tentation of playing &quot;too easy&quot;, thanks to their always surprising lines.  The result is very even and this is an extremely pleasant recording overall. ~ Antoine P. MANENS \n\nBeing a musician and buying jazz records for study purposes often, very rarely has a record moved me so to just put down my saxaphone and listen for the pure thrill of listening to great music. Each song here has that loose, casual, joyful feel that can only be attained by musicians of this caliber. They are not playing for other listeners on this album, they are playing for themselves,and that is what captivates you and draws you in to this album on such a personal level.  Paul Desmond and Jim Hall are two of the most unique and original to ever play their particular instrument, but you can infer that from listening to any record with Jim Hall or Paul Desmond.  This album is not about that but about how those two combine their ingenious melodic ideas to form something so incredibly unique and brilliant it can't be can't be put into words in this short review.  The idea of solos that are both textbook in fundamentals and beautiful to listen to is something signature of both these musicians, but it is especially present on this album.  The softness of these tunes is so intense that you must close your eyes and tune out everything around you when you put on this record.  The best tracks are 'Theme for Black Orpheus', 'Embarcedaro', and all the rest. 'Nuff said. Buy the record! ~ sil871\n\nPersonnel:\nPaul Desmond (alto saxophone);\nJim Hall (guitar);\nGene Cherico, Gene Wright (bass);\nConnie Kay (drums).\n\nPaul Desmond - Take Ten Tracks:\n01  Take Ten 3:11\n02  El Prince 3:35\n03  Alone Together 6:53\n04  Embarcadero 4:08\n05  The Theme From Black Orpheus 4:13 \n06  Nancy 6:06\n07  Samba De Orpheu 4:29 \n08  The One I Love Belongs To Somebody Else 5:41\n09  Out of Nowhere 7:00\n10  Embarcadero (alternate take) 4:57 \n11  El Prince (alternate take) 5:39","torrent":{"xt":"urn:btih:cddefe9d4d36c100ceb9f5a0e6e3552e07553a7c","amp;dn":"Paul+Desmond+-+Take+Ten+%281963%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cddefe9d4d36c100ceb9f5a0e6e3552e07553a7c","infoHashBuffer":{"type":"Buffer","data":[205,222,254,157,77,54,193,0,206,185,245,160,230,227,85,46,7,85,58,124]},"announce":[],"urlList":[]}}