{"title":"Black Milk- On Writing, Motherhood, and the Harem Within","uid":8170031,"size":328094,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cdfb335f087c3d7aa3040540ef7b2e8a116bdc81&amp;dn=Black+Milk-+On+Writing%2C+Motherhood%2C+and+the+Harem+Within+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sumofmind","files":-1,"time":1361407207,"description":"Hardcover: 288 pages\nPublisher: Viking Adult (April 28, 2011)\nLanguage: English\nISBN-10: 0670022640\n\nRelease Date: April 28, 2011\nAn acclaimed Turkish novelist's personal account of balancing a writer's life with a mother's life. \n\nAfter the birth of her first child in 2006, Turkish writer Elif Shafek suffered from postpartum depression that triggered a profound personal crisis. Infused with guilt, anxiety, and bewilderment about whether she could ever be a good mother, Shafak stopped writing and lost her faith in words altogether. In this elegantly written memoir, she retraces her journey from free-spirited, nomadic artist to dedicated by emotionally wrought mother. Identifying a constantly bickering harem of women who live inside of her, each with her own characteristics-the cynical intellectual, the goal-oriented go-getter, the practical-rational, the spiritual, the maternal, and the lustful-she craves harmony, or at least a unifying identity. As she intersperses her own experience with the lives of prominent authors such as Sylvia Plath, Virginia Woolf, Alice Walker, Ayn Rand, and Zelda Fitzgerald, Shafak looks for a solution to the inherent conflict between artistic creation and responsible parenting.\n\nWith searing emotional honesty and an incisive examination of cultural mores within patriarchal societies, Shafak has rendered an important work about literature, motherhood, and spiritual well-being.","torrent":{"xt":"urn:btih:cdfb335f087c3d7aa3040540ef7b2e8a116bdc81","amp;dn":"Black+Milk-+On+Writing%2C+Motherhood%2C+and+the+Harem+Within+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdfb335f087c3d7aa3040540ef7b2e8a116bdc81","infoHashBuffer":{"type":"Buffer","data":[205,251,51,95,8,124,61,122,163,4,5,64,239,123,46,138,17,107,220,129]},"announce":[],"urlList":[]}}