{"title":"Me Llamo Earl 3x17[HDTV][Spanish].avi","uid":4332589,"size":181870592,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ce7e6a6dc78da43638718f75b4f4a654e8af911e&amp;dn=Me+Llamo+Earl+3x17%5BHDTV%5D%5BSpanish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":-1,"time":1218128097,"description":"Ã‚Â´Me llamo EarlÃ‚Â´ ha sido unas de las series de culto que laSexta emite de madrugada entre semana, junto a Ã‚Â´The OfficeÃ‚Â´, Ã‚Â´Larry DavidÃ‚Â´, Ã‚Â´ExtrasÃ‚Â´ o Ã‚Â´EntourageÃ‚Â´. Sin embargo, la cadena devuelve este martes a Earl, Randy, Joy, Catalina y &quot;el hombre cangrego&quot; a horarios menos intempestivos (17.00 horas) con el estreno de la tercera temporada, una de las damnificadas por la huelga de guionistas de las que se emitiÃƒÂ³ tan sÃƒÂ³lo diez. Aunque la emisiÃƒÂ³n de la tercera temporada tuvo que ser interrumpida, la NBC emitiÃƒÂ³ 17 capÃƒÂ­tulos antes del parÃƒÂ³n y actualmente ya ha reanudado la emisiÃƒÂ³n de capÃƒÂ­tulos de estreno.\n\n   En esta nueva etapa, los guionistas dieron un giro al desarrollo al meter a Earl en prisiÃƒÂ³n. Tras dos temporadas entregado al 100% a su lista de errores, el protagonista tratarÃƒÂ¡ de sobrevivir entre rejas. Al comienzo de esta nueva temporada, Earl tendrÃƒÂ¡ que adaptarse a su nueva vida en prisiÃƒÂ³n, asunto que no le resultarÃƒÂ¡ nada fÃƒÂ¡cil ya que un matÃƒÂ³n andarÃƒÂ¡ tras sus pasos. A pesar de esto y con el ÃƒÂºnico objetivo de conseguir una reducciÃƒÂ³n de su condena, se ofrecerÃƒÂ¡ para mediar entre las bandas rivales de la cÃƒÂ¡rcel. Por otro lado, la ÃƒÂºnica preocupaciÃƒÂ³n de su hermano, al que ahora cuida Joy porque se siente culpable, es buscar la manera de ingresar en prisiÃƒÂ³n para estar cerca de ÃƒÂ©l.\n\n   En el primer episodio (uno doble de 40 minutos de duraciÃƒÂ³n), Ã‚Â´Mi nombre es preso 28301-016Ã‚Â´, Earl comienza a cumplir su condena en prisiÃƒÂ³n, pero su adaptaciÃƒÂ³n no le resulta nada fÃƒÂ¡cil porque uno de los matones de la cÃƒÂ¡rcel anda en su bÃƒÂºsqueda. Mientras Earl cumple su pena, Joy trata de recompensarle cuidando de su hermano Randy, que se resiste a esta nueva situaciÃƒÂ³n.\n   A continuaciÃƒÂ³n, la cadena emitirÃƒÂ¡ otras dos entregas de estreno del a tercera temporada. El segundo episodio es Ã‚Â´Las bandas de CandemÃ‚Â´, en el que Earl intenta conseguir una reducciÃƒÂ³n de su condena, por ello, se ofrece para solucionar los problemas surgidos entre las bandas de la prisiÃƒÂ³n. Pero este asunto le provocarÃƒÂ¡ algunas consecuencias inesperadas. Mientras, la ÃƒÂºnica preocupaciÃƒÂ³n de Randy es buscar la manera de ingresar en prisiÃƒÂ³n para estar cerca de su hermano. Por ÃƒÂºltimo, el Ã‚Â´El factor FrankÃ‚Â´, Joy visita a Earl en la cÃƒÂ¡rcel, y cuando llega se sorprende al ver que un amigo suyo tambiÃƒÂ©n cumple condena. Una vez reunidos, entre los tres recuerdan su pasado y los motivos por los que estaban unidos.\n\n ","torrent":{"xt":"urn:btih:ce7e6a6dc78da43638718f75b4f4a654e8af911e","amp;dn":"Me+Llamo+Earl+3x17%5BHDTV%5D%5BSpanish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce7e6a6dc78da43638718f75b4f4a654e8af911e","infoHashBuffer":{"type":"Buffer","data":[206,126,106,109,199,141,164,54,56,113,143,117,180,244,166,84,232,175,145,30]},"announce":[],"urlList":[]}}