{"title":"Coast to Coast AM June 30, 2013 - Hoffa &amp; the Mob","uid":8648743,"size":57250175,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:cf016f1cefa23f9222fdf038f77d2b2a5e6a47b2&amp;dn=Coast+to+Coast+AM+June+30%2C+2013+-+Hoffa+%26amp%3B+the+Mob&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1373050444,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-30-13\nHost:\nGeorge Knapp\nGuests:\nCharles  Brandt,                   Paul  Bogard\nIn the course of nearly five years of recorded interviews, Frank Sheeran confessed to investigative author Charles Brandt that he handled more than twenty-five hits for the mob. Brandt joined George Knapp to discuss Sheeran's fascinating story, including details on Jimmy Hoffa's murder, and insights into American crime history. Serving in General Patton's &quot;killer division,&quot; Sheeran became skilled at taking lives while serving on numerous missions in WWII. Later, while working for Mafia boss Rusell Bufalino, he became known as &quot;The Irishman,&quot; and was once again killing on orders.  \nHoffa, who'd been the President of the Teamsters union, was also associated with organized crime. After he served time in jail and was released on a presidential pardon, Hoffa pursued returning to his position as President of the Teamsters against the Mafia's wishes, Brandt recounted. Hoffa began making reckless public comments about exposing the Mob's connection to the Teamsters, and it was at this point they decided to eliminate him, said Brandt. Because Hoffa had become wary of the Mob, they recruited Sheeran, whom they felt could get close to him. According to Sheeran, he picked up Hoffa just outside of Detroit to attend a meeting with another Teamsters official, and took him to a private home, where Sheeran shot him twice, and then his body was cremated at a Detroit funeral home. \nSheeran's story is in development to be a movie called &quot;The Irishman,&quot; directed by Martin Scorsese, with Robert DeNiro playing the older Sheeran, Al Pacino as Hoffa, and Joe Pesci as Bufalino, Brandt reported. He also touched on details connecting the Mob with the JFK assassination. For more, check out this 2006 KLAS-TV video report, in which Brandt first made public his information on Sheeran in regards to Hoffa's murder. \nA Lack of Darkness\nFirst hour guest, author and teacher Paul Bogard talked about how we no longer experience true darkness in the age of artificial light. Light pollution not only takes away our view of the stars, but also affects people and animals in some negative ways, he said. For instance, rampant sleep disorders in humans could be associated with ambient light in their bedrooms, as well as looking at lit-up electronic devices just before going to sleep. To alleviate the excess of night light, he suggested establishing &quot;darkness preserves,&quot; as well as shielding things like street lights so that they only illuminate a given area rather than casting light everywhere. \nWebsite(s):\n hoffasolved.com\n jmu.edu\nBook(s):\n &quot;I Heard You Paint Houses&quot;\n We're Going to Win This Thing: The Shocking Frame-up of a Mafia Crime Buster\n Donnie Brasco: Unfinished Business\n The End of Night\n","torrent":{"xt":"urn:btih:cf016f1cefa23f9222fdf038f77d2b2a5e6a47b2","amp;dn":"Coast+to+Coast+AM+June+30%2C+2013+-+Hoffa+%26amp%3B+the+Mob","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf016f1cefa23f9222fdf038f77d2b2a5e6a47b2","infoHashBuffer":{"type":"Buffer","data":[207,1,111,28,239,162,63,146,34,253,240,56,247,125,43,42,94,106,71,178]},"announce":[],"urlList":[]}}