{"title":"Lord Creator - Don't Stay Out Late (Greatest Hits) FLAC","uid":14673967,"size":135909064,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cf953918ada1b3d80e0962ec172f7b1b99dec9d9&amp;dn=Lord+Creator+-+Don%27t+Stay+Out+Late+%28Greatest+Hits%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"voxish","files":17,"time":1463914146,"description":"After scoring with the calypso hit &quot;Evening News&quot; in 1959, Trinidad singer Lord Creator settled in Jamaica in 1962 and began cutting sides in the ska style. His Caribbean-wide fame gave him entrée to Jamaican studios, paving the way for a slew of hits during the '60s. And while ska is dominant on this excellent collection, Creator mixes in some of his native calypso, Jamaican R&amp;B, and even a little rock steady. The singer's almost formal phrasing and crooning tone set him apart from more earthy sounding ska vocalists, proving to be perfectly suited for doo wop-inspired cuts like &quot;Don't Stay Out Late.&quot; More fine R&amp;B is heard on &quot;Someday&quot; (a version of the Stranger and Patsy hit &quot;Yea Yea Yea Baby&quot;), while Creator's calypso mastery is made evident on &quot;Independent Jamaican&quot; and the very rare side &quot;Ma and Pa.&quot; The collection winds down with a ska remake of &quot;Evening News&quot; and a sweet, end-of-the-dance ballad duet featuring singer Norma Fraser. Throughout the 17 selections, Creator is backed by the Skatalites and various group alumni who freelanced after the great ska outfit's original demise in '65. A great collection, featuring most of the highlights from Creator's fruitful '60s collaboration with producer Vincent &quot;Randy&quot; Chin. Essential","torrent":{"xt":"urn:btih:cf953918ada1b3d80e0962ec172f7b1b99dec9d9","amp;dn":"Lord+Creator+-+Don%27t+Stay+Out+Late+%28Greatest+Hits%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf953918ada1b3d80e0962ec172f7b1b99dec9d9","infoHashBuffer":{"type":"Buffer","data":[207,149,57,24,173,161,179,216,14,9,98,236,23,47,123,27,153,222,201,217]},"announce":[],"urlList":[]}}