{"title":"Sonny Rollins With The Modern Jazz Quartet(mp3@320)[rogercc]","uid":6385704,"size":89934352,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cffd36fd9d852c5e9e193bc800455661d1ecedb3&amp;dn=Sonny+Rollins+With+The+Modern+Jazz+Quartet%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc1","files":13,"time":1305196674,"description":"SONNY ROLLINS WITH THE MODERN JAZZ QUARTET\nLabel Original Jazz Classics \nOriginal Year 1953\nFormat:Mp3@320\n\nAlways gifted with a big band sound and a pure sense of swing, Sonny Rollins did not emerge full-blown from the foam like Venus. He gained polish and experience with Bud Powell, J.J. Johnson, Miles Davis and Thelonious Monk, before making his Prestige debut as a leader at the tender age of 21. With The Modern Jazz Quartet celebrates the tenor saxophonist's first three 10-inch LPs--Mambo Jazz, Sonny Rollins Quartet, and Sonny Rollins with Milt Jackson-and is culled from sessions in December of 1951 and October of 1953.\n\nThere is much joy and rhythmic elation in Rollins' early vamp figures such as &quot;Shadrack&quot; and &quot;Scoops,&quot; where he preaches with a stomping fervor that anticipates the hard bop movement. On &quot;Newk's Fadeaway,&quot; he hints at the harmonic freedom and plasticity of line that would distinguish his early triumphs, while &quot;Mambo Bounce&quot; (sampled early and often by the acid jazz crowd) is a delightful early mixture of Afro-Cuban and swing textures, prefiguring his later uses of calypso melodies and rhythms.\n\nAnd while Rollins' ballad playing doesn't approach the harmonic depths he would routinely invoke in later years, his smoky tone and behind-the-beat phrasing suggest an affinity for middle period Lester Young (&quot;This Love Of Mine&quot; and &quot;With A Song In My Heart&quot;), even as his thicker timbre and robust articulation point to Coleman Hawkins and Ben Webster (&quot;With Time On My Hands&quot;). By the time he takes on Ellington's &quot;In A Sentimental Mood&quot; with the Modern Jazz Quartet, his tone has really filled out and he's improvising with a broader range of inflections. &quot;The Stopper&quot; offers a garish chase with cute starts and stops, while &quot;No Moe&quot; is a classic line that inspires vigorous, easy-going blues interplay. And for hard swinging, &quot;It's Almost Like Being In Love&quot; hints at future virtuoso turns on the popular song.\n\nTracklist :\n1. The Stopper\n2. Almost Like Being in Love \n3. No Moe \n4. In a Sentimental Mood \n5. Scoops \n6. With a Song in my Heart\n7. Newk's Fadeaway\n8. Time on my Hands\n9. This Love of Mine\n10. Shadrak\n11. On a Slow Boat to China\n12. Mambo Bounce\n13. I Know\n\nRecorded on January 17 and December 17, 1951 and on October 7, 1953. Originally released on Prestige (7029). \n\nPersonnel:\nSonny Rollins (tenor saxophone); Miles Davis (trumpet); Milt Jackson (vibraphone); John Lewis, Kenny Drew (piano); Percy Heath (bass); Kenny Clarke, Roy Haynes, Art Blakey (drums).\n","torrent":{"xt":"urn:btih:cffd36fd9d852c5e9e193bc800455661d1ecedb3","amp;dn":"Sonny+Rollins+With+The+Modern+Jazz+Quartet%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cffd36fd9d852c5e9e193bc800455661d1ecedb3","infoHashBuffer":{"type":"Buffer","data":[207,253,54,253,157,133,44,94,158,25,59,200,0,69,86,97,209,236,237,179]},"announce":[],"urlList":[]}}