{"title":"Foundation ActionScript 3.0 AnimationMaking Things Move!.zip","uid":4346160,"size":2943748,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d13c9a6e9b9e3351ce5d2f9237a6f167f7c83bcb&amp;dn=Foundation+ActionScript+3.0+AnimationMaking+Things+Move%21.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bernsteez","files":1,"time":1218845935,"description":" &lt;a href=&quot;http://www.amazon.com/Foundation-Actionscript-3-0-Animation-Making/dp/1590597915&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.amazon.com/Foundation-Actionscript-3-0-Animation-Making/dp/1590597915&lt;/a&gt;\n\nIn this book, you&amp;#039;ll learn\nAll the ActionScript 3.0 (including math and trigonometry functions) and Flash rendering techniques you&amp;#039;ll need to start animating with code\nBasic motion principles such as velocity, acceleration, friction, easing, and bouncing\nHow to handle user interaction via the keyboard and mouse\nAdvanced motion techniques such as springs, coordinate rotation, conservation of momentum, and forward and inverse kinematics\nAll the basic 3D concepts you need to do 3D in Flash, from simple perspective to full 3D solids complete with backface culling and dynamic lighting\nFlash has long been one of the most approachable, user-friendly tools for creating web-based animations, games, and applications. This has contributed to making it one of the most widely used programs for creating interactive web content. With each new version of Flash, ActionScript, its built-in scripting language, has become more powerful and a little more complex, too. ActionScript, now at version 3.0, has significantly matured as a programming language, bringing power and speed only previously dreamed about to Flash-based animation, going far beyond traditionally used keyframes and tweens. The material inside this book covers everything you need to know to harness the power of ActionScript 3.0. First, all the basics of script-based animation and setting up an ActionScript 3.0 project are covered. An introduction to object-oriented programming follows, with the new syntax, events, and rendering techniques of ActionScript 3.0 explained, giving you the confidence to use the language, whether starting from scratch or moving up from ActionScript 2.0. The book goes on to provide information on all the relevant trigonometry you will need, before moving on to physics concepts such as acceleration, velocity, easing, springs, collision detection, conservation of momentum, 3D, and forward and inverse kinematics. In no time at all you&amp;#039;ll both understand the concepts of scripted animation and have the ability to create all manner of exciting animations and games.\nSummary of Contents\nPART ONE - ACTIONSCRIPTED ANIMATION BASICS\nChapter 1 Basic Animation Concepts\nChapter 2 Basics of ActionScript 3.0 for Animation\nChapter 3 Trigonometry for Animation\nChapter 4 Rendering Techniques\nPART TWO - BASIC MOTION\nChapter 5 Velocity and Acceleration\nChapter 6 Boundaries and Friction\nChapter 7 User Interaction: Moving Objects Around\nPART THREE - ADVANCED MOTION\nChapter 8 Easing and Springing\nChapter 9 Collision Detection\nChapter 10 Coordinate Rotation and Bouncing Off Angles\nChapter 11 Billiard Ball Physics\nChapter 12 Particle Attraction and Gravity\nChapter 13 Forward Kinematics: Making Things Walk\nChapter 14 Inverse Kinematics: Dragging and Reaching\nPART FOUR - 3D ANIMATION\nChapter 15 3D Basics\nChapter 16 3D Lines and Fills\nChapter 17 Backface Culling and 3D Lighting\nPART FIVE - ADDITIONAL TECHNIQUES\nChapter 18 Matrix Math\nChapter 19 Tips and Tricks\n\n\nAbout the Author\nKeith lives in the vicinity of Boston, MA, in the USA with his wife Kazumi and their new daughter Kristine. He has been working with Flash since 1999, and has co-authored many books for friends of ED, including Flash MX Studio, Flash MX Most Wanted, and the ground-breaking Flash Math Creativity.\n\nIn 2001 he started the experimental Flash site, BIT-101 (www.bit-101.com), which strives for a new, cutting edge, open source experiment each day. The site recently won an award at the Flashforward 2003 Flash Film Festival in the Experimental category. In addition to the experiments on the site, there are several highly regarded Flash tutorials which have been translated into many languages and are now posted on web sites throughout the world. Keith is currently working full time doing freelance and contract Flash development and various writing projects.\n","torrent":{"xt":"urn:btih:d13c9a6e9b9e3351ce5d2f9237a6f167f7c83bcb","amp;dn":"Foundation+ActionScript+3.0+AnimationMaking+Things+Move%21.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d13c9a6e9b9e3351ce5d2f9237a6f167f7c83bcb","infoHashBuffer":{"type":"Buffer","data":[209,60,154,110,155,158,51,81,206,93,47,146,55,166,241,103,247,200,59,203]},"announce":[],"urlList":[]}}