{"title":"Sexually Broken--Lil pixie Odette Delacroix, world class deep th","uid":9631792,"size":1192592118,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d37607e04e8a0ad95fc397f62ce856262260ae56&amp;dn=Sexually+Broken--Lil+pixie+Odette+Delacroix%2C+world+class+deep+th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1392795810,"description":"Lil pixie Odette Delacroix, world class deep throating champion. Bound, vibrated and throat blasted! | Odette Delacroix | Matt Williams\n\nFebruary 17, 2014\n\n\nMP4 only.\n\n\nOdette Delcroix looks like a fairy that got her wings ripped off. At 4'11 and under 100 pounds, they don't come much smaller and more compact then Odette. But this innocent looking pixie has a secret. She is in the top one percent of deep throaters on the planet. If she chose to quit porn, she could join the circus as a sword swallower. Yes, she is that good.\n\nHere at Sexuallybroken, we appreciate those rare jewels that can perform at that level. Today we are going to put that tender throat meat to the test. Bound on her back in a classic fuck me position with her white cotton panties and training bra in full display with her mouth hole hanging off the edge, Odette is going to get the chance to impress us. And impress us she does. She can take the cock balls deep and just hang out there, not even slightly distressed. Long after most models would be choking and gasping and begging for mercy, Odette is just gazing up at us calmly. This pixie has no gag reflex and evidently no need of air.\n\nWe cut off that useless training bra and hike those white cotton panties up around her ankles while keeping her in the metal bondage. A vibrator is bolted in place directly on her perfect shaved pussy. As calm and collected as she is hanging off the edge of a dick, the vibrator takes that all away. Her cunt is super sensitive and responsive and she cums almost immediately. Odette yelps and moans as multiple orgasms shake through her restrained flesh. We put a stop the the noise by jamming the dick back in her mouth.\n\nNipple clamps are added as the final touch on this perfect package. Clamped, cuffed, panties around ankles and cumming helplessly with a rock hard cock owning her throat is a good look on Odette. She should wear it more often. When we are done, we walk away, leaving her languishing and still cumming. Pixies like this one are keepers, we don't plan on letting her go anytime soon... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/02_17odelacroix/SexuallyBroken-Odette-Delacroix-Matt-Williams-Lil-pixie-Odette-Delacroix-world-class-deep-throating-champion-Bound-vibrated-and-throat-blasted.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/02_17odelacroix/SexuallyBroken-Odette-Delacroix-Matt-Williams-Lil-pixie-Odette-Delacroix-world-class-deep-throating-champion-Bound-vibrated-and-throat-blasted.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:d37607e04e8a0ad95fc397f62ce856262260ae56","amp;dn":"Sexually+Broken--Lil+pixie+Odette+Delacroix%2C+world+class+deep+th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d37607e04e8a0ad95fc397f62ce856262260ae56","infoHashBuffer":{"type":"Buffer","data":[211,118,7,224,78,138,10,217,95,195,151,246,44,232,86,38,34,96,174,86]},"announce":[],"urlList":[]}}