{"title":"The Usual Suspects","uid":3537190,"size":4635209775,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d3ae1b5778c46ba9641636cba59fee740d7f644a&amp;dn=The+Usual+Suspects&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"silvia-","files":15,"time":1160519187,"description":"THE USUAL SUSPECTS\n\n[IMG]http://images-eu.amazon.com/images/P/B00004R72F.02.LZZZZZZZ.jpg[/IMG]\n\nYear: 1995\nGenres: Crime, Mystery, Thriller \nActors: Stephen Baldwin, Gabriel Byrne, Benicio Del Toro, Kevin Pollak, Kevin Spacey, See more \nDirectors: Bryan Singer \nFormat: PAL\nLenght: 106 mns. aprox.\nAspect Ratio: 4:3  \nAudio Dolby Digital 2.0: English, Spanish \nSubtitles: Eglish and Spanish\nExtras included: Synopsis, technical features, artistic features, awards, filmography, curiousities and top-secret.\nDeleted: trailer, documentary, interviews and shooting images.\n\n\nSynopsis: Director Bryan Singer&amp;#039;s labyrinthine crime drama centers on five career criminals (played by Gabriel Byrne, Kevin Spacey, Benicio Del Toro, Kevin Pollak, and Stephen Baldwin) who meet after being rounded up for a standard police line-up. Upon their release, the men band together to pull off an intricate heist involving $3 million worth of emeralds. Their success brings them to the attention of the enigmatic Keyser Soze, an unseen, nefarious, and mythic underworld crime figure who coerces them into pulling off an important and highly dangerous job. The scenes that follow make THE USUAL SUSPECTS one of the most fascinating crime thrillers in cinema history.\n\nWorking from the Oscar-winning screenplay by Christopher McQuarrie, Singer adroitly tells the complex story through flashbacks, cross-cutting, and voice-over narration. Such nimble handling of the intricacies of the nonlinear narrative adds to the suspense, leaving viewers on the edge of their seats until the clever, satisfying finale. Singer?s expertise in the technical aspects of filmmaking--his use of a dioptic filter to keep two close-up faces in focus, as well as his inventive use of six-frame step printing--helped him earn his reputation as a visually impressive and stylish director. Filled with excellent performances from veteran actors (Kevin Spacey won his first Academy Award for his breakthrough role as Verbal Kint), THE USUAL SUSPECTS placed Singer squarely on the cinematic map.\n\n\nDVD9 to DVD5, DvD Rebuilder + CCE (9 pass)\n- Reduction Level for DVD-5: 70,2%\n- Overall Bitrate : 4.060Kbs\n- Space for Video : 3.136.864KB\n- Movie improvement from extra reduction = ,3%\n- HIGH/LOW/TYPICAL Bitrates: 5.264/819/4.060 Kbs\n\nMore Info: www.solodvd.org","torrent":{"xt":"urn:btih:d3ae1b5778c46ba9641636cba59fee740d7f644a","amp;dn":"The+Usual+Suspects","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3ae1b5778c46ba9641636cba59fee740d7f644a","infoHashBuffer":{"type":"Buffer","data":[211,174,27,87,120,196,107,169,100,22,54,203,165,159,238,116,13,127,100,74]},"announce":[],"urlList":[]}}