{"title":"Great music from obscure artists, FLAC, metadata","uid":15506215,"size":1745594408,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d52af8e585e0cab6c5d79534cebf6cddcb0eadb1&amp;dn=Great+music+from+obscure+artists%2C+FLAC%2C+metadata&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rontoolsie","files":53,"time":1470587935,"description":"Over the last 3 or so years, I have downloaded many albums worth of music that was largely unknown to me-based on recommendations, reviews etc. Here I have taken individual tracks from some of them, and I have only added cover art, where the original downloads did not include it. So for the first time, this has not been sourced from my own collection, but neither is it a 'dump'. \r\n\r\nAnd here are individual tracks from many of these albums....I tried to have included music as little known as possible, in an attempt to introduce interested listeners to artists that they may never have come across, and without this-wouldn't come across. The selection is very diverse, so not every track would appeal to everybody...so if there is something you don't like...skip it and move on to the next. It does have a weight towards classic electric rock, and more contempory acoustic folky sounds. \r\n\r\nI won't give a thumbnail sketch on the artists here....if you are interested then you have the same resources as I do.But I will make a few honorary mentions\r\n\r\nJun Kamikubo\r\nSpeed, Glue and Shinki\r\nThese are two Japanese bands who emulate with enormous success classic rock sounds. The former could easily be mistaken for Cream due the the exceptionally fluid guitar runs and supergroup-like tightness between the musicians. \r\n\r\nMartha Velez-was a contempory of Jimi Hendrix who asked her to join him at Woodstock. She refused and remained an obscure artist since that time. Her talents were sufficent that in the album sampled (Fiends and Angels), she enlisted the chops of BOTH Eric Clapton and Paul Kossoff (Free). Jimi Page had also agreed to lend a hand, but was unavailable during the recording sessions. This alone should tell you that this is an exceptional album. There distinctive styles of Clapton and Kossoff are obvious from the first notes they play.The sampled track has Kossoff playing. MV was also a formally trained operatic singer, so when she hits the notes...she NAILS them. \r\n\r\nMick Softley-This guy could have been as huge as Dylan, but for some reason did not become a commercial success. \r\n\r\nRodriguez-Again he could have taken over the torch from Dylan, except the world was not ready of a Hispanic bohemian singer songwriter at the time. He gained huge success in South Africa through bootleg copies and was at one time bigger than the Beatles there. \r\n\r\nMostly Autumn-splintered off into Breathing Space. This one track (Hollow) is their swan song with blistering yet melodic guitar riffs worthy of any guitar god. Just beautiful....and one of my favorite tracks in this compilation. \r\n\r\nThe Innocense Mission-a husband/wife duo with beautiful acoustic renderings. This particular track proved to be an ear-worm for many weeks. \r\n\r\nThe slow paced languid sounds of the Smoke Fairies are another highlight for me. As this was from a double album (Ghosts), I included two tracks. \r\n\r\nYezda Urfa-a prog rock banded intially founded in America's heartland who were very similar (very, very) to the best of the Yes era. The vocalist has an uncanny resemblance to Jon Anderson, and the melodic bass runs could easily be mistaken for Chris Squires. \r\n\r\nThe Shiver-Swedish pschedelic rock band, with their take (and improvement I believe) on a Procul Harem instrumental.\r\n\r\nMy Solid Ground-German psychedelic rock in the mould of the best of Pink Floyd. \r\n\r\nKeith Cross and Peter Ross-why this album did not become a classic folk/prog superseller, I will never know","torrent":{"xt":"urn:btih:d52af8e585e0cab6c5d79534cebf6cddcb0eadb1","amp;dn":"Great+music+from+obscure+artists%2C+FLAC%2C+metadata","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d52af8e585e0cab6c5d79534cebf6cddcb0eadb1","infoHashBuffer":{"type":"Buffer","data":[213,42,248,229,133,224,202,182,197,215,149,52,206,191,108,221,203,14,173,177]},"announce":[],"urlList":[]}}