{"title":"THE BEATLES - Vidthology 170 Vintage Videos Complete Collection","uid":9749549,"size":4216935079,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d59193229c7e84d9ec066c3d09fe58efa8f307b5&amp;dn=THE+BEATLES+-+Vidthology+170+Vintage+Videos+Complete+Collection+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"grp777","files":173,"time":1394645140,"description":"The effort put into this incredible collection was quite a challenge! It took weeks and hours to complete. Please read the setlist of Beatle video songs I typed up on notepad. I laid out all the videos in chronological order taken from the albums, so you get a look at history from start to finish of The Beatles careers! The entire video collection is less than 4 GB's! All 170 videos were made in Flash Video format (FLV). They are small in size in that format and play easily through Real Player! No more searching or downloading different apps to play each video. Just load the videos into Real Player and then burn them on a DVD through your computer for the ultimate collection! I was determined to make it the best collection of The Beatles history of songs from 1963 through 1970 and turn them into videos! EVERY video song is included in this collection from The Beatles first album, &quot;Please Please Me&quot; through &quot;Yesterday And Today.&quot; Starting with &quot;Revolver&quot; through &quot;Let It Be&quot; their final album, most of those songs were made into video songs. \n\nI would say with this collection of videos, about 95% of Beatle's songs were created into videos, while some were already out there, but improved with better picture quality and stereo sound on most of the audio. Many older Beatle songs from the early to mid 60's were mono. I replaced most of those mono songs with stereo and remastered tracks and then lined up the video together with the audio to get the complete video! I even improved grainy old footage with clearer footage. Some videos are promos while others are live from tv shows. Some videos have Spanish Subtitles. Some have lyrics to them. Some are mono, but most of the videos are in stereo! Some videos were done with Video Maker and Creator with real concert footage and other videos were made with moving pictures. Some videos also have a storyline to them. This is a MUST collection for The Beatle fan! Tell your family and friends about it. I want everyone out there to have this great collection of videos. Please everyone SEED, for a while before leaving so everyone can download this collection. I will SEED to get the leechers going until the seeders start to multiple, but I want to see double digit numbers in seeders and leechers once this collection takes over.\n\nOnce that is achieved, I will be more than happy to share also my KARAOKE Beatle collection I've been building for over 5 years now where I currently have 198 karaoke Beatle songs! That's even more than this collection of videos! If you love singing Beatle songs like I do, you will also LOVE the karaoke collection too. The karaoke Beatle collection is in CDG + MP3 format. So that is 396 total files that equal 800 MB. These are all professional karaoke songs from companies like, Soundchoice, SBI, All Hits, Zoom, Chartbusters and more! I put all my Beatles karaoke songs on a 2 GB flashdrive and then plug that into my Acesonic karaoke player hooked up through my powerful stereo system for some serious concert hall singing! Please comment about this video collection and let me know if you want me to upload my 198 complete karaoke Beatle collection? So enjoy the show and thanks for viewing!!!!  \n","torrent":{"xt":"urn:btih:d59193229c7e84d9ec066c3d09fe58efa8f307b5","amp;dn":"THE+BEATLES+-+Vidthology+170+Vintage+Videos+Complete+Collection+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d59193229c7e84d9ec066c3d09fe58efa8f307b5","infoHashBuffer":{"type":"Buffer","data":[213,145,147,34,156,126,132,217,236,6,108,61,9,254,88,239,168,243,7,181]},"announce":[],"urlList":[]}}