{"title":"Eric Dolphy - Out To Lunch! (1964) {1996 Toshiba-EMI Japan, TOCJ","uid":6841640,"size":350692987,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d643010aeac296005c9b12dcdb13523f1ae8eabf&amp;dn=Eric+Dolphy+-+Out+To+Lunch%21+%281964%29+%7B1996+Toshiba-EMI+Japan%2C+TOCJ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bartoko","files":15,"time":1322188063,"description":"Eric Dolphy - Out To Lunch! (1964) {1996 Toshiba-EMI Japan, TOCJ-4163}\n\n\n\n\nFinally, a non-RVG edition of this great album. Enjoy!\n\n\nPersonnel: Eric Dolphy (alto saxophone, flute, bass clarinet); Freddie Hubbard (trumpet); Bobby Hutcherson (vibraphone); Richard Davis (bass); Tony Williams (drums).\n\ntracklist:\n01. Hat and Beard\n02. Something Sweet, Something Tender\n03. Gazzelloni\n04. Out to Lunch\n05. Straight Up and Down\n\n\n\nOut to Lunch stands as Eric Dolphy's magnum opus, an absolute pinnacle of avant-garde jazz in any form or era. Its rhythmic complexity was perhaps unrivaled since Dave Brubeck's Time Out, and its five Dolphy originals -- the jarring Monk tribute &quot;Hat and Beard,&quot; the aptly titled &quot;Something Sweet, Something Tender,&quot; the weirdly jaunty flute showcase &quot;Gazzelloni,&quot; the militaristic title track, the drunken lurch of &quot;Straight Up and Down&quot; -- were a perfect balance of structured frameworks, carefully calibrated timbres, and generous individual freedom. Much has been written about Dolphy's odd time signatures, wide-interval leaps, and flirtations with atonality.\n\nAnd those preoccupations reach their peak on Out to Lunch, which is less rooted in bop tradition than anything Dolphy had ever done. But that sort of analytical description simply doesn't do justice to the utterly alien effect of the album's jagged soundscapes. Dolphy uses those pet devices for their evocative power and unnerving hints of dementia, not some abstract intellectual exercise. His solos and themes aren't just angular and dissonant -- they're hugely so, with a definite playfulness that becomes more apparent with every listen. The whole ensemble -- trumpeter Freddie Hubbard, vibist Bobby Hutcherson, bassist Richard Davis, and drummer Tony Williams -- takes full advantage of the freedom Dolphy offers, but special mention has to be made of Hutcherson, who has fully perfected his pianoless accompaniment technique. His creepy, floating chords and quick stabs of dissonance anchor the album's texture, and he punctuates the soloists' lines at the least expected times, suggesting completely different pulses. Meanwhile, Dolphy's stuttering vocal-like effects and oddly placed pauses often make his bass clarinet lines sound like they're tripping over themselves. Just as the title Out to Lunch suggests, this is music that sounds like nothing so much as a mad gleam in its creator's eyes.","torrent":{"xt":"urn:btih:d643010aeac296005c9b12dcdb13523f1ae8eabf","amp;dn":"Eric+Dolphy+-+Out+To+Lunch%21+%281964%29+%7B1996+Toshiba-EMI+Japan%2C+TOCJ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d643010aeac296005c9b12dcdb13523f1ae8eabf","infoHashBuffer":{"type":"Buffer","data":[214,67,1,10,234,194,150,0,92,155,18,220,219,19,82,63,26,232,234,191]},"announce":[],"urlList":[]}}