{"title":"Football Outsiders Almanac 2014","uid":10890539,"size":46961761,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d6a0e3970cf0e52bd7fda8c0ece3e593021cf6ea&amp;dn=Football+Outsiders+Almanac+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"agathonia","files":-1,"time":1409101907,"description":"The most authoritative and innovative guide to professional football (previously known as &quot;Pro Football Prospectus&quot;) is back for an all-new season with more cutting-edge statistical analysis, obsessive film study, and trademark humor. Includes comprehensive coverage of all 32 NFL teams, analysis of offseason personnel changes, over 500 KUBIAK fantasy football projections, and breakdowns of every team from the five major college football conferences plus the top independent and mid-major college teams.\n\n\n\nWith numerous statistical measures that go far beyond standard NFL stats, Football Outsiders Almanac 2014 gives NFL fans the kind of sabermetric-like statistical analysis that revolutionized the fan's understanding of baseball. It's also written with a knowing dry wit that gets under the skin of America's most popular spectator sport.\n\n\n\nGroundbreaking team and player DVOA ratings that correct for situation and opponent to reveal which offenses and defenses are truly superior, and which players really help win games.\n\nExclusive data from the Football Outsiders Game Charting Project, unavailable in standard NFL stats, tells you which running backs face the most men in the box; which quarterbacks benefit the most from yards after catch; which teams most often blitz or run specific offensive formations; and which defensive backs stop the other team's passing game, measured by pass coverage on every single play rather than just tackles.\n\nDetailed information on each team's performance in 2013 by offensive and defensive personnel package.\n\nDetailed individual stats for offensive linemen and defensive players.\n\nExtensive coverage of all 32 teams with week-by-week stats from the 2013 season, five-year performance trends, and analysis of off-season personnel changes.\n\nExclusive 2014 predictions that give the odds on each team as a Super Bowl contender ... or a contender for the top pick in the 2015 draft.\n\n2014 fantasy football projections for more than 500 skill position players based on the KUBIAK forecasting system.\n\nBreakdowns on more than 60 different college football teams and full win-loss projections for all 128 Division I-A (FBS) teams.\n\n\n\n&quot;A book that any self-respecting NFL fan needs to purchase.&quot; -- Bill Simmons, GRANTLAND.com\n\n\n\n&quot;Football Outsiders has now built a system that has some serious traction behind it. I personally find it fascinating.&quot; -- John Schneider, General Manager, Seattle Seahawks\n\n\n\n&quot;Exhausting, enlightening, surprising in many cases, and an absolute must-read if you like the NFL. -- Peter King, Sports Illustrated\n","torrent":{"xt":"urn:btih:d6a0e3970cf0e52bd7fda8c0ece3e593021cf6ea","amp;dn":"Football+Outsiders+Almanac+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6a0e3970cf0e52bd7fda8c0ece3e593021cf6ea","infoHashBuffer":{"type":"Buffer","data":[214,160,227,151,12,240,229,43,215,253,168,192,236,227,229,147,2,28,246,234]},"announce":[],"urlList":[]}}