{"title":"Stephen A. Merrill - Copyright in the Digital Era [2013][A]","uid":10085677,"size":6889682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d70058d91e128af14428345e882a5518c8af6703&amp;dn=Stephen+A.+Merrill+-+Copyright+in+the+Digital+Era+%5B2013%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1399087255,"description":"Description\nProduct Details\nBook Title: Copyright in the Digital Era: Building Evidence for Policy\t\nBook Author: Stephen A. Merrill and William J. Raduchel, Editors; Committee on the Impact of Copyright Policy on Innovation in the Digital Era; Board on Science, Technology, and Economic Policy; Policy and Global Affairs; National Research Council\nPaperback: 85 pages\nPublisher: National Academies Press (May 14, 2013)\nLanguage: English\nISBN-10: 0309278953\nISBN-13: 978-0309278959\n\n===================================================================================\nBook Description\nPublication Date: May 14, 2013 | ISBN-10: 0309278953 | ISBN-13: 978-0309278959\nOver the course of several decades, copyright protection has been expanded and extended through legislative changes occasioned by national and international developments. The content and technology industries affected by copyright and its exceptions, and in some cases balancing the two, have become increasingly important as sources of economic growth, relatively high-paying jobs, and exports. Since the expansion of digital technology in the mid-1990s, they have undergone a technological revolution that has disrupted long-established modes of creating, distributing, and using works ranging from literature and news to film and music to scientific publications and computer software.\nIn the United States and internationally, these disruptive changes have given rise to a strident debate over copyright's proper scope and terms and means of its enforcement--a debate between those who believe the digital revolution is progressively undermining the copyright protection essential to encourage the funding, creation, and distribution of new works and those who believe that enhancements to copyright are inhibiting technological innovation and free expression.\nCopyright in the Digital Era: Building Evidence for Policy examines a range of questions regarding copyright policy by using a variety of methods, such as case studies, international and sectoral comparisons, and experiments and surveys. This report is especially critical in light of digital age developments that may, for example, change the incentive calculus for various actors in the copyright system, impact the costs of voluntary copyright transactions, pose new enforcement challenges, and change the optimal balance between copyright protection and exceptions.\n===================================================================================","torrent":{"xt":"urn:btih:d70058d91e128af14428345e882a5518c8af6703","amp;dn":"Stephen+A.+Merrill+-+Copyright+in+the+Digital+Era+%5B2013%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d70058d91e128af14428345e882a5518c8af6703","infoHashBuffer":{"type":"Buffer","data":[215,0,88,217,30,18,138,241,68,40,52,94,136,42,85,24,200,175,103,3]},"announce":[],"urlList":[]}}