{"title":"Marston Moor 1644: The Beginning of the End","uid":11839783,"size":48040663,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d76794babbdbad1d512af50502a96b7a03805307&amp;dn=Marston+Moor+1644%3A+The+Beginning+of+the+End&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1429832224,"description":"The entry into the English Civil War of the Scots on the side of Parliament radically changed the balance of power in the North of England. The Royalists were forced onto the defensive and the Marquis of Newcastle found his army besieged in York. Prince Rupert proposed a bold plan to relieve York. With cavalry from the King's army he would seize lightly defended Lancashire, a county sympathetic to the Royalist cause, raise a new force, relieve York and unite with the Marquis of Newcastle. He executed his plan with spectacular success and, as the Parliamentarian and Scots armies marched out to meet him outside York, he skilfully marched around their flank and entered York unopposed. Rupert could now have re-supplied the garrison and marched south to rejoin the King. Unfortunately, having received what appeared to be a direct Royal command to fight at any odds, Rupert decided to march out to attack his enemies. Delayed in attacking by Newcastle's slowness, Rupert was forced to watch on 2 July as his enemies formed up on the ridge in front of him. Rupert decided to await the new day before mounting his attack, but it became clear that the Allied armies were advancing. After a desperately hard-fought battle the Royalist army broke. The Parliamentarian and Scots armies wasted their hard won victory and allowed the king to keep the war going, but the loss of the North had decisively tilted the balance of military power in favour of Parliament","torrent":{"xt":"urn:btih:d76794babbdbad1d512af50502a96b7a03805307","amp;dn":"Marston+Moor+1644%3A+The+Beginning+of+the+End","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d76794babbdbad1d512af50502a96b7a03805307","infoHashBuffer":{"type":"Buffer","data":[215,103,148,186,187,219,173,29,81,42,245,5,2,169,107,122,3,128,83,7]},"announce":[],"urlList":[]}}