{"title":"Love Match 2015 WEB-DL Split Scenes","uid":12807469,"size":845852102,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d7904a7f28531ebd0941acaad05d002847142e1f&amp;dn=Love+Match+2015+WEB-DL+Split+Scenes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EndYou","files":4,"time":1448140184,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/image/ZhA \nhttp://imgpremium.com/image/ZhM \nhttp://imgpremium.com/image/Zhc \nhttp://imgpremium.com/image/Zhm \nhttp://imgpremium.com/image/ZhI\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nYear: 2015\r\nCountry: USA\r\nGenre: All Girl / Lesbian, All Sex\r\nDuration: 1:32:21\r\nLanguage English\r\nDirector: Guy Ranieri Sblattero\r\nStudio: Viv Thomas - Girlfriends Films\r\n\r\nAnissa Kate, Erica Fontes, Ava Courcelles, Jimena Lago, Ena Sweet, Talia Mint\r\n\r\nIn an exciting first, the script for &quot;Love Match&quot; was written entirely by a Viv Thomas fan. The erotic tale starts with Erica Fontes proposing marriage to Anissa Kate. Although Anissa accepts, it becomes clear she is having doubts when gorgeous Talia Mint visits, and Anissa pulls her into a passionate clinch. Talia is vocal in her enjoyment as Anissa's tongue flicks rapidly over her hot pink folds. Talia sucks on Anissa's big breasts and kisses her way down to her pussy, eating her enthusiastically. They entwine and grind to a sticky mutual climax. Can Anissa's engagement survive this infidelity? Meanwhile, Ena Sweet's relationship with Jimena Lago is thrown into turmoil when she receives a wedding invitation from Anissa, her ex-girlfriend. An argument leads to sweet make-up sex, Jimena giggling with pleasure as Ena eats and fingers her. Ena straddles Jimena's face, riding hard, but the mood between the lovers shifts again, as she rubs herself to orgasm and then abruptly dismounts, leaving Jimena to masturbate to a lonely climax. Seamstress Ava Courcelles notices her assistant Jimena's sad mood as they are measuring Anissa for alterations to her wedding dress. Ava's hug of consolation turns amorous as she slides her hand inside Jimena's panties to rub her pussy, then pulls her panties down around her ankles to lick her to an orgasm. Ava bends over the table and Jimena spreads her peachy ass cheeks and fingers her pussy until she is squealing in uncontrollable ecstasy. As Anissa gets dressed up in her sexy white lingerie and stockings for her wedding day. Erica proclaims her love. The busty beauties touch and stroke each other continually, Erica sucking Anissa's nipples and eating her skillfully. Anissa devours Erica's pierced pussy and then moves onto her knees for Erica to lick her ass. They finish in scissors, gazing lovingly into each other's eyes as they rub to a simultaneous orgasm. It seems their &quot;Love Match&quot; is destined for success after all.\r\n\r\nVideo Quality: WEB-DL\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 704x396 ~ 1020kbps 25fps\r\nAudio: AAC 44100Hz 2ch 192kbps","torrent":{"xt":"urn:btih:d7904a7f28531ebd0941acaad05d002847142e1f","amp;dn":"Love+Match+2015+WEB-DL+Split+Scenes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7904a7f28531ebd0941acaad05d002847142e1f","infoHashBuffer":{"type":"Buffer","data":[215,144,74,127,40,83,30,189,9,65,172,170,208,93,0,40,71,20,46,31]},"announce":[],"urlList":[]}}