{"title":"Make Fitness A Priority: How to win the fight against your excus","uid":13871404,"size":154346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d833d94956ef8e7881dd3420c0d7fbf805275d5e&amp;dn=Make+Fitness+A+Priority%3A+How+to+win+the+fight+against+your+excus&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":3,"time":1458100671,"description":"Make Fitness A Priority: How to win the fight against your excuses\r\n\r\n\r\n\r\nIf I asked you what are your top priorities in life, how would you answer? I think most people would answer by saying family and career. Everyone sees health and fitness as something that is important, but we always seem to put it off until later. We all have obstacles in our lives that we use as excuses as to why we can’t make our own health a priority at the moment. We use these obstacles as validation to ourselves that it is just not in the cards for us to get in shape right now. Our fitness is always the thing we plan to get to later … you know, when we have more time. \r\n\r\nThe problem with that way of thinking is that that magical day we are waiting for when all of sudden we won’t be busy anymore and we will have tons of free time - that day will never come. It does not exist. That is the realization you need to make right now. I really hate to be the one to break it to you, but there will never be a shortage of excuses. There will always be excuses you can use to skip your workout and validate going through the drive through. \r\n\r\nBy reading this book you will learn… \r\n*How to win the fight against your excuses \r\n*The most important word in fitness \r\n*Healthy habits everyone should follow \r\n*Why everyone should do resistance training \r\n*The importance of cardio training \r\n*How to become a donut slayer \r\n*How to break through plateaus when you hit them \r\nand most importantly… \r\n*Anyone can learn to make fitness a priority in their lives. All you have to do is make a decision to do it!\r\n\r\nIt's decision time! Are you ready to overcome your excuses and Make Fitness A Priority in your life...or are you too busy?","torrent":{"xt":"urn:btih:d833d94956ef8e7881dd3420c0d7fbf805275d5e","amp;dn":"Make+Fitness+A+Priority%3A+How+to+win+the+fight+against+your+excus","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d833d94956ef8e7881dd3420c0d7fbf805275d5e","infoHashBuffer":{"type":"Buffer","data":[216,51,217,73,86,239,142,120,129,221,52,32,192,215,251,248,5,39,93,94]},"announce":[],"urlList":[]}}