{"title":"David Bowie Montreal Forum  Jul 12, 1983 Set 1 FM","uid":7263272,"size":104309118,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d96666d842dd2a289cfd2b2222c4b5ab7d09b7a3&amp;dn=David+Bowie+Montreal+Forum++Jul+12%2C+1983+Set+1+FM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":19,"time":1336794426,"description":"mp3\nfm broadcast\nvery nice quality\n\nset 1 of 2 (Jul 12th ) of a 2 night fm recording ( Jul 12th and Jul 13th)\n\nDavid Bowie - vocals, guitar\nDavid LeBolt - keyboards\nLenny Pickett - saxophone\nStan Harrison - baritone sax\nSteve Elson - tenor sax\nCarlos Alomar - guitar\nEarl Slick - lead guitar\nCarmen Rojas - bass\nTony Thompson - drums\nGeorge and Frank Simms - backing vocals\n\nThis set is taken from the two-night stand David Bowie gave at the Montreal Forum in 1983. Each show during this Serious Moonlight tour had two sets with a 20-minute intermission, resulting in over 90 two hour-plus concerts in 15 countries in 1983.\n\nAfter a period of releasing dark, more experimental albums such as Low, The Lodger and Scary Monsters in collaboration with Brian Eno while living as a single man in Berlin, Germany, a string of only semi-successful commercial hits and battling a well-publicized cocaine addiction, David Bowie overcame his demons and teamed up with Chic member and producer, Nile Rodgers. The result was 1983's Let's Dance, a commercial record that most critics continue to regard as one of his best.\n\nSmiling and obviously happy with his newfound artistic muse, David Bowie greeted a sold out Montreal forum on this night, and launched into a brilliant show full of both hits from Let's Dance and some of the more radio-friendly tracks he had done during his Berlin sojourn. Fronting a killer band, Bowie began the evening with three lesser known hits - &quot;Look Back In Anger,&quot; &quot;Breaking Glass&quot; and &quot;Scary Monsters (And Super Creeps)&quot; - before launching into &quot;Rebel, Rebel,&quot; his 1974 hit single from the Diamond Dogs LP. This tour reunited Bowie with guitarist Earl Slick, who had replaced Mick Ronson for the Diamond Dogs recording sessions. Slick delivers the rock edge that had been missing from his music made during the Berlin years. The band is propelled by former Chic/Power Station drummer Tony Thompson, who, along with members of the Tower of Power horn section, helps make this one of the best backing bands in his long musical career.\n\nThe majority of the set is essentially a collection of Bowie hits that includes &quot;Heroes,&quot; &quot;Life on Mars?,&quot; &quot;Fashion&quot; and his two big radio hits from Let's Dance: the title track and the ever infectious &quot;China Girl.&quot; Other highlights include Bowie's version of the classic 1967 Pretty Things hit, &quot;Sorrow,&quot; (which he originally recorded for 1973's Pin Ups record) and his modern re-make of The Velvet Underground classic &quot;White Light, White Heat.&quot;","torrent":{"xt":"urn:btih:d96666d842dd2a289cfd2b2222c4b5ab7d09b7a3","amp;dn":"David+Bowie+Montreal+Forum++Jul+12%2C+1983+Set+1+FM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d96666d842dd2a289cfd2b2222c4b5ab7d09b7a3","infoHashBuffer":{"type":"Buffer","data":[217,102,102,216,66,221,42,40,156,253,43,34,34,196,181,171,125,9,183,163]},"announce":[],"urlList":[]}}