{"title":"How to Locate Acupuncture Points","uid":6644523,"size":1928850790,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d9b1acd57e1999866f129fc87c3017b65e0b5264&amp;dn=How+to+Locate+Acupuncture+Points&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Oleg3005","files":27,"time":1314894741,"description":"How to Locate Acupuncture Points - The Definitive DVD\n\nNB.  This title is published by Silence Speaks in collaboration with Primal Pictures and is excluded from any customer special offer mailings or discounts.\n\nComplete coverage of the 12 primary channels, the conception and governing vessels, and some of the most commonly used extra points.\n\nStep-by-Step instruction on properly determining body distances using Chinese Cun measurements.\nA virtual tour of the human body highlighting most of the major surface anatomy landmarks using stunning, medically accurate imagery from Primal Pictures.\nFull body-length photographs detailing the meridian pathways.\nMulti-camera perspective recreating the experience of having one-to-one expert tuition.\nA true video production,- designed to play on your computer, or better yet, on your television/dvd player where you can view the approximately 4 hours of training footage in the comfort of your living room.\n\nSuitable for all healthcare professionals who incorporate acupuncture or acupressure in their practice, HOW TO LOCATE ACUPUNCTURE POINTS - THE DEFINITIVE DVD promises to be the most sophisticated and informative acupuncture training video produced to date.\n\nTechnical Specification\nLanguage: English \nDuration: 240 minutes\nPicture format: PAL 16:9 Widescreen\nDisc format: DVD-9 R0 (Region Free)\nPlayability: All computers and PAL ready dvd/television players.\nClassification: Exempt - Please note this DVD contains nudity but is exempt from classification. Parents are advised to review material beforehand to determine suitability for young children.","torrent":{"xt":"urn:btih:d9b1acd57e1999866f129fc87c3017b65e0b5264","amp;dn":"How+to+Locate+Acupuncture+Points","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9b1acd57e1999866f129fc87c3017b65e0b5264","infoHashBuffer":{"type":"Buffer","data":[217,177,172,213,126,25,153,134,111,18,159,200,124,48,23,182,94,11,82,100]},"announce":[],"urlList":[]}}