{"title":"Sid Meier's Railroads! [PeterSonic]","uid":4009771,"size":485064127,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:da0af831773eb403b830c962079f7f81b0285aac&amp;dn=Sid+Meier%5C%27s+Railroads%21+%5BPeterSonic%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"petersonic","files":-1,"time":1202020617,"description":"About the Game\n\nSid Meier's Railroads! marks the return of the watershed title in simulation/strategy gaming that launched the popular &quot;tycoon&quot; genre, and inspired a new generation of games. Sid Meier's Railroads! comes home to its original creator, the legendary Sid Meier, who, together with his team at Firaxis Games, will take this game to a whole new level of fun!\n\nThe greatest railroad building game of all time is back in a vibrant 3D world delivering exciting multiplayer options, streamlined interface and unmatched gameplay, that's easy to learn yet challenging to master. Creators of the world's best strategy game, Civilization IV, Sid Meier and Firaxis Games put you in charge of building the greatest rail empire in the nation - managing trains, cargo and your bottom line - while engaging in all-out corporate warfare against rival tycoons, slick entrepreneurs, and robber barons!\nSystem Requirements\n\n      Minimum: Windows 2000 (plus Service Pack 1 or higher), Windows XP Home or Professional (plus Service Pack 1 or higher), 1.4GHz Intel Pentium 4 or AMD Athlon processor or equivalent, 512MB RAM, 64 MB video card with hardware pixel and vertex shaders (GeForce 3, Radeon 8500 or better), DirectX 7 compatible sound card, 1.7 GB of free hard drive space, DirectX 9.0c (included)\n\n      Recommended: 2.0 GHz Intel Pentium 4 or AMD Athlon processor or equivalent (or better), 1Gb RAM, 128 MB video card with pixel shader 2.0 support (Radeon x800, nVidia 6800)\n\n","torrent":{"xt":"urn:btih:da0af831773eb403b830c962079f7f81b0285aac","amp;dn":"Sid+Meier%5C%27s+Railroads%21+%5BPeterSonic%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da0af831773eb403b830c962079f7f81b0285aac","infoHashBuffer":{"type":"Buffer","data":[218,10,248,49,119,62,180,3,184,48,201,98,7,159,127,129,176,40,90,172]},"announce":[],"urlList":[]}}