{"title":"The Devil's Cormorant - A Natural History - PDF","uid":9759273,"size":4723862,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dadf6480be0ebc7bb4d11f7074aa78235e39e51b&amp;dn=The+Devil%27s+Cormorant+-+A+Natural+History+-+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AtomTPB","files":1,"time":1394789630,"description":"Pages: 360 pages\nPublisher: University Press of New England (30 October 2013)\nLanguage: English\nISBN-10: 1611682258\nISBN-13: 978-1611682250\nFormat: PDF\n\n\nBehold the cormorant: silent, still, cruciform, and brooding; flashing, soaring, quick as a snake. Evolution has crafted the only creature on Earth that can migrate the length of a continent, dive and hunt deep underwater, perch comfortably on a branch or a wire, walk on land, climb up cliff faces, feed on thousands of different species, and live beside both fresh and salt water in a vast global range of temperatures and altitudes, often in close proximity to man. Long a symbol of gluttony, greed, bad luck, and evil, the cormorant has led a troubled existence in human history, myth, and literature. The birds have been prized as a source of mineral wealth in Peru, hunted to extinction in the Arctic, trained by the Japanese to catch fish, demonized by Milton in Paradise Lost, and reviled, despised, and exterminated by sport and commercial fishermen from Israel to Indianapolis, Toronto to Tierra del Fuego. In The Devil's Cormorant, Richard King takes us back in time and around the world to show us the history, nature, ecology, and economy of the world's most misunderstood waterfowl.","torrent":{"xt":"urn:btih:dadf6480be0ebc7bb4d11f7074aa78235e39e51b","amp;dn":"The+Devil%27s+Cormorant+-+A+Natural+History+-+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dadf6480be0ebc7bb4d11f7074aa78235e39e51b","infoHashBuffer":{"type":"Buffer","data":[218,223,100,128,190,14,188,123,180,209,31,112,116,170,120,35,94,57,229,27]},"announce":[],"urlList":[]}}