{"title":"Esbjorn Svensson Trio - Retrospective 1998-2008","uid":6658859,"size":455589294,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:db05bbcc957e87b9621dcfd1ca9aba46be6c5b36&amp;dn=Esbjorn+Svensson+Trio+-+Retrospective+1998-2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1315430966,"description":"How to sum up the legacy of e.s.t. in words? As a jazz band, they created some of the most popular, enduring, forward-thinking and simply enjoyable music the genre has seen for many years. Over the course of a dozen albums released through ACT, both studio and live sessions, Esbjorn Svensson, Dan Berglund and Magnus OstrÃƒÂ¶m captured the hearts and minds of jazz fans with their innovative and imaginative approach to the classic piano trio setting. The first ever European band to feature on the front cover of US jazz bible Downbeat, they were undoubtedly one of the most popular groups to have come out of the genre.\n\nAnd yet they were so much more than just a jazz band - their music confounded the expectations of audiences who thought they knew what jazz sounded like, blew away preconceptions about where the boundaries between genres lie, and introduced countless non-jazz listeners around the world to the idea that instrumental, improvised music could be as intelligent, interesting, satisfying and accessible as more traditionally popular styles. Their tunes could encompass the energy and hypnotic thrall of dance music, the drive and riotous power of rock, or the meditative solemnity of quiet chill-out electronica. Distorted, effects-laden bass lines would crash against pounding piano chords; gentle spacey melodies overlapped scattered, haunting drum patterns. Their popularity outside of the jazz sphere is evidenced by their impressive record sales, shifting albums in the hundreds of thousands. Their videos were played on MTV, they opened for k. d. lang on tour in America, and played to sold-out stadium concert crowds around the world.\n\nEsbjorns tragic death in June 2008, at the age of just 44, shocked the music world. Jazz had lost an ally, an ambassador and a friend, but greater still was the loss to music as a whole. Unwilling to squeeze themselves into a particular box or niche, e.s.t.s was a universal sound that had something any listener could connect with, regardless of where theyd come to it from.\n\nRetrospective - The Very Best Of e.s.t. is a fantastic and reflective insight into this extraordinary band, an excellent starting point for newcomers to their music and a definitive signpost along the way for those who have already begun their journey into the world of e.s.t. This collection brings together their finest pieces taken from their various releases on ACT, 1999s From Gagarins Point Of View was the first album to get a release outside their native Scandinavia and brought them their first real taste of worldwide acclaim. Dodge The Dodo was a standout track from that album, demonstrating early on the groups willingness to experiment with ideas from outside the jazz world. The title track from 2000s Good Morning Susie Soho was written on the streets of London following an early UK performance, and is included here along with the sensuous ballad Believe, Beleft, Below from 2003s Seven Days Of Falling.\n\nFrom Viaticum (2005) we have the playful A Picture of Doris Travelling With Boris, along with the title track - the album graced the Top 50 in both the German and French pop charts and reached no 4 in Sweden, while Tuesday Wonderland (2006) garnered the group their sixth Swedish Grammy award. Retrospective ends with Leucocyte (taken from the album of the same name), recorded just weeks before Esbjorns death and an audacious reinvention of their sound that was even more of a departure from their jazz origins than anything heard before.\n\nWriting in the booklet for Retrospective, Dan and Magnus write, His music is his legacy and will stay with us forever. Perfectly documented on this album, Esbjorns playing still says more than any words ever could. (actmusic.com)\n\n- - -\n\nEsbjÃƒÂ¶rn Svensson Trio - Retrospective 1998-2008\n(MÃƒÂ¼nchen Act 2009)\n\n 1. From Gagarin's point of view \n 2. Dodge the dodo \n 3. Good morning Susie Soho \n 4. Spam-boo-limbo \n 5. Behind the Yashmak \n 6. Viaticum \n 7. Seven days of falling \n 8. Strange place for snow  \n 9. Believe, beleft, below \n10. A picture of Doris travelling with Boris \n11. Goldwrap \n12. Dolores in a shoestand \n13. Leucocyte\n","torrent":{"xt":"urn:btih:db05bbcc957e87b9621dcfd1ca9aba46be6c5b36","amp;dn":"Esbjorn+Svensson+Trio+-+Retrospective+1998-2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db05bbcc957e87b9621dcfd1ca9aba46be6c5b36","infoHashBuffer":{"type":"Buffer","data":[219,5,187,204,149,126,135,185,98,29,207,209,202,154,186,70,190,108,91,54]},"announce":[],"urlList":[]}}