{"title":"Combinatorics: Ancient &amp; Modern - Wilson and Watkins (2013).","uid":10178605,"size":7880733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db3e65ebb644a6cb0b9d37e2bffa3703ae9db969&amp;dn=Combinatorics%3A+Ancient+%26amp%3B+Modern+-+Wilson+and+Watkins+%282013%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SectorVector","files":-1,"time":1400500748,"description":"Combinatorics: Ancient &amp; Modern \n\nby Robin Wilson, John J. Watkins, Ronald Graham (foreword).\n\n\n# ISBN-13: 9780199656592 \n# Publisher: Oxford University Press, USA\n# Publication date: 8/24/2013\n# Pages: 368\n\n\nWho first presented Pascal's triangle? (It was not Pascal.)\nWho first presented Hamiltonian graphs? (It was not Hamilton.)\nWho first presented Steiner triple systems? (It was not Steiner.) \n\nThe history of mathematics is a well-studied and vibrant area of research, with books and scholarly articles published on various aspects of the subject. Yet, the history of combinatorics seems to have been largely overlooked.\n\nThis book goes some way to redress this and serves two main purposes: 1) it constitutes the first book-length survey of the history of combinatorics; and 2) it assembles, for the first time in a single source, researches on the history of combinatorics that would otherwise be inaccessible to the general reader.\n\nIndividual chapters have been contributed by sixteen experts. The book opens with an introduction by Donald E. Knuth to two thousand years of combinatorics. This is followed by seven chapters on early combinatorics, leading from Indian and Chinese writings on permutations to late-Renaissance publications on the arithmetical triangle. The next seven chapters trace the subsequent story, from Euler's contributions to such wide-ranging topics as partitions, polyhedra, and latin squares to the 20th century advances in combinatorial set theory, enumeration, and graph theory. The book concludes with some combinatorial reflections by the distinguished combinatorialist, Peter J. Cameron.\n\nThis book is not expected to be read from cover to cover, although it can be. Rather, it aims to serve as a valuable resource to a variety of audiences. Combinatorialists with little or no knowledge about the development of their subject will find the historical treatment stimulating. A historian of mathematics will view its assorted surveys as an encouragement for further research in combinatorics. The more general reader will discover an introduction to a fascinating and too little known subject that continues to stimulate and inspire the work of scholars today.\n\n\nContents\n========\n\n  INTRODUCTION\n  Two Thousand Years of Combinatorics, DONALD E. KNUTH\n\n  PART I: ANCIENT COMBINATORICS\n   1. Indian Combinatorics, TAKANORI KUSUBA and KIM PLOFKER\n   2. China, ANDREA BREARD\n   3. Islamic Combinatorics, AHMED DJEBBAR\n   4. Jewish Combinatorics, VICTOR J. KATZ\n   5. Renaissance Combinatorics, EBERHARD KNOBLOCH\n   6. The Origins of Modern Combinatorics, EBERHARD KNOBLOCH\n   7. The Arithmetical Triangle, A. W. F. EDWARDS\n\n  PART II: MODERN COMBINATORICS\n    8. Early Graph Theory, ROBIN WILSON\n    9. Partitions, GEORGE E. ANDREWS\n   10. Block Designs, NORMAN BIGGS and ROBIN WILSON\n   11. Latin Squares, LARS DOVLING ANDERSEN\n   12. Enumeration (18th-20th Centuries), E. KEITH LLOYD\n   13. Combinatorial Set Theory, IAN ANDERSON\n   14. Modern Graph Theory, LOWELL BEINEKE and ROBIN WILSON\n\n  AFTERMATH\n  A Personal View of Combinatroics, PETER J. CAMERO\n\n\nAuthors:\n=======\n\nRobin Wilson is an Emeritus Professor of Pure Mathematics at the Open University, Emeritus Professor of Geometry at Gresham College, London, and a former Fellow of Keble College, Oxford.\n\nHe is currently President of the British Society for the History of Mathematics. He has written and edited many books on graph theory, including Introduction to Graph Theory and Four Colours Suffice, and on the history of mathematics, including Lewis Carroll in Numberland.\n\nHe is involved with the popularization and communication of mathematics and its history, and was awarded a Polya prize by the Mathematical Association of America for 'outstanding expository writing'.\n\n\nJohn J. Watkins is an Emeritus Professor of Mathematics at Colorado College, USA. He received his doctorate from the University of Kansas, specializing in commutative ring theory. His main research interest, however, has been in graph theory and he has published mainly in this area, including many papers with undergraduates as co-authors.\n\nHe has written several books, including Graphs: An Introductory Approach, Across the Board: The Mathematics of Chessboard Problems, and Topics in Commutative Ring Theory, and has recently finished his latest book, Elementary Number Theory. Colorado College presented John Watkins with the 2005 Boettcher Award for Faculty Excellence.\n\n-_-","torrent":{"xt":"urn:btih:db3e65ebb644a6cb0b9d37e2bffa3703ae9db969","amp;dn":"Combinatorics%3A+Ancient+%26amp%3B+Modern+-+Wilson+and+Watkins+%282013%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db3e65ebb644a6cb0b9d37e2bffa3703ae9db969","infoHashBuffer":{"type":"Buffer","data":[219,62,101,235,182,68,166,203,11,157,55,226,191,250,55,3,174,157,185,105]},"announce":[],"urlList":[]}}