{"title":"[FSX] Accu-Sim Captain of the ship B377 TORRENT","uid":7074344,"size":295608314,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dbefa5f6f1dae858cfd9836f1a40bd7c92353e63&amp;dn=%5BFSX%5D+Accu-Sim+Captain+of+the+ship+B377+TORRENT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iCrackPrograms","files":1,"time":1330782464,"description":"Accu-Sim Captain of the ship B377 for FSX brought to you by iCrackProgramsâ„¢\n\nPLEASE SEED!!\n\n-----------------------------------------\n\nSome features..\n\nReal-world conditions affect system conditions, including engine temperatures. Manage temperatures with engine cowl flaps and oil cooler flaps.\n\nSpark plugs can clog and eventually fowl if engines are allowed to idle too low for too long. Throttling up an engine with oil-soaked spark plugs can help clear them out and smoke will pour out of exhaust as oil is burned off.\n\nRealistic water injection (ADI) turns on gradually when enabled. Pushing the engine too hard without water injection automatically injects more fuel to keep cylinders cooler, creating realistic black smoke from unburned fuel.\n\nOn hot summer days you will need to pay very close attention to your systems, possibly expediting your takeoff to avoid overheating due to radiant ground heat.\nSystems are influenced based on real world conditions.\n\nNaturally speaking crew (American and British crews included). Your crew can help you, the captain, fly the plane by giving you critical information when you need it. For example, the Stratocruiser has a built-in takeoff flap warning system that sounds if you apply more than 3/4 throttle and the flaps are not set to takeoff position. If you apply throttle with flaps not properly set and hear this warning, your copilot will make a comment like, &quot;Captain, you need to set your flaps to 25 degrees for takeoff.&quot; Your flight engineer gives you advanced updates on systems, giving you time to react. Crew speech is not robotic but quick and natural. This system was created to help you fly the plane, just like a real crew, and to make your experience more pleasurable.\n\n-----------------------------------------\n\nSubscribe my youtube page!\nThank-you!","torrent":{"xt":"urn:btih:dbefa5f6f1dae858cfd9836f1a40bd7c92353e63","amp;dn":"%5BFSX%5D+Accu-Sim+Captain+of+the+ship+B377+TORRENT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbefa5f6f1dae858cfd9836f1a40bd7c92353e63","infoHashBuffer":{"type":"Buffer","data":[219,239,165,246,241,218,232,88,207,217,131,111,26,64,189,124,146,53,62,99]},"announce":[],"urlList":[]}}