{"title":"Crime and the City Solution - American Twilight (2013) [FLAC]","uid":8374823,"size":261223019,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dd1b2245a4e38a9e1e28aa5f3363a6a95cc51bf3&amp;dn=Crime+and+the+City+Solution+-+American+Twilight+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1366023608,"description":"\n  Crime &amp; the City Solution - American Twilight (2013) [FLAC]\n\n  Released: 2013\n  Duration: 41:08\n  Genre: Pop/Rock\n  Style: Alternative, Singer/Songwriter, Indie Rock\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 950 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Goddess \n  02 Riven Man \n  03 My Love Takes Me There \n  04 Domina\n  05 The Colonel (Doesn't Call Anymore) \n  06 Beyond Good and Evil \n  07 American Twilight \n  08 Streets of West Memphis\n\n  Detroit was the perfect location for Crime &amp; the City Solution to record their first album in 22 years. They couldn't have been framed by a better metaphor than setting up in a city consumed with the fight -- often against itself -- for survival. Founder, lead vocalist, and lyricist Simon Bonney is joined by longtime collaborators violinist Bronwyn Adams and guitarist Alexander Hacke. They are accompanied by drummer Jim White (Dirty Three), David Eugene Edwards (16 Horsepower, Woven Hand), visual artist Danielle DePicciotto, and Detroit natives Matthew Smith (Outrageous Cherry) on keyboards, and Troy Gregory (Witches, Dirtbombs) on bass. Everybody sings. \n\n  Co-produced with the Motor City's Dave Feeny, American Twilight retains C&amp;CS's trademark senses of cinematic drama and dynamics, but the sound is meatier, denser, and grimier, and Adams' violin has a much more prominent role than it has in the past (a real plus). &quot;Riven Man&quot; is a sonic collision of basic Detroit rock and expansive Motor City funk (courtesy of Gregory's bassline, Smith's horn sounds, and the urgent backing chorus). Bonney's deep baritone retains its authoritative power, alternately growling and plaintively singing. In &quot;Goddess,&quot; with its charging guitars (one can hear traces of the riff from Grand Funk's &quot;We're an American Band&quot; crossed with the dirty-assed strut of the Stooges; the irony is no doubt intentional -- and it works), rumbling bass, and tom-toms, Bonney offers an urgent homage to the Divine Feminine; it's underscored by the entire band as a backing chorus. Bonney expresses both reverence and longing in &quot;Domina,&quot; a spiritual waltz combining gospel hymnody, country, and wide-open, labyrinthine, rockist drones driven by Adams, White, and Hacke's slide guitars. &quot;The Colonel (Doesn't Call Anymore)&quot; combines C&amp;CS's iconic, shapeshifting sense of the epic with droning, swirling blues and stormy post-psych rock. \n\n  Despite its musical urgency, &quot;My Love Takes Me There&quot; is a testament to its subject's transcendent power. Its jagged theatrical guitars contrast beautifully with Smith's mariachi horns, and Bonney's voice articulates it all with conviction and aplomb. &quot;Beyond Good and Evil&quot; is Gothic country music infused with a heartbreaking tenderness. The title track's relentlessly unhinged rock &amp; roll is framed lyrically as an admonition of warning as the threat of darkness approaches. Though Bonney poetically offers observations around the notion that &quot;Armageddon is coming in the city of fun&quot; and accepts it, his vocal holds an unwavering faith for the survival of those who dare to love and hope in enduring it. This makes his urgent delivery the voice of sanity in the ensuing musical maelstrom. American Twilight is more than just a triumphant comeback by C&amp;CS -- who were not fully appreciated for their uniqueness the first time around -- it is a literate, sprawling, bruising rock &amp; roll record that convincingly addresses the crises we face -- cultural, spiritual, integral -- and the choices we make. What could be more necessary?","torrent":{"xt":"urn:btih:dd1b2245a4e38a9e1e28aa5f3363a6a95cc51bf3","amp;dn":"Crime+and+the+City+Solution+-+American+Twilight+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd1b2245a4e38a9e1e28aa5f3363a6a95cc51bf3","infoHashBuffer":{"type":"Buffer","data":[221,27,34,69,164,227,138,158,30,40,170,95,51,99,166,169,92,197,27,243]},"announce":[],"urlList":[]}}