{"title":"The Simpsons - Season 5 Complete [DVDRIP VP7 KEGGERMAN]","uid":3820335,"size":4022153569,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dde17be2e5272f3bbf92f8783ef78e09f56a579d&amp;dn=The+Simpsons+-+Season+5+Complete+%5BDVDRIP+VP7+KEGGERMAN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"KEGGERMAN","files":25,"time":1190835934,"description":"SHOW........[ The Simpsons - Season 5 ]\nRIPPER......[ KEGGERMAN ]\nAUDIO.......[ MP3 48000Hz 128kb/s CBR (2 Channel) ]\nLANGUAGE....[ English ]\nCODEC.......[ VP7 ]\nRESOLUTION..[ 576 x 384 ]\nFRAME RATE..[ 23.976 FPS ]\nSUB TITLES..[ NONE ]\nSOURCE......[ NTSC DVD ]\nEPISODES....[ 22 ]\n\n\nNOTES.......[ VP7 CODEC CAN BE DOWNLOADED HERE: ]\n             &lt;a href=&quot; http://www.on2.com/cms-data/downloads/on2_vp7_personal_edition.exe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.on2.com/cms-data/downloads/on2_vp7_personal_edition.exe&lt;/a&gt;\nSUPPORT.....[ http://www.66trader.com ]\n\n \n\n\n\nEPISODE 1\nTITLE.......[ Homer&amp;#039;s Barbershop Quartet ]\nRUNTIME.....[ 22:54 ]\nFIRST AIRED.[ 9/30/93 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ After Bart and Lisa find one of his old records, Homer recalls his \ndays as a member of a Beatles-esque barbershop quartet, told via flashbacks. ]\n\n\n\nEPISODE 2\nTITLE.......[ Cape Feare ]\nRUNTIME.....[ 22:49 ]\nFIRST AIRED.[ 10/7/93 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ After Bart starts receiving death threats from his nemesis \nSideshow Bob, the Simpsons enter the Witness Relocation Program and move to a \n&quot;Cape Fear&quot;-esque town several miles away. ]\n\n\n\nEPISODE 3\nTITLE.......[ Homer Goes to College ]\nRUNTIME.....[ 22:54 ]\nFIRST AIRED.[ 10/14/93 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ After learning that Homer is seriously underqualified for his own \njob, Mr. Burns enrolls him at Springfield University. While there, he befriends \nthree nerds and accidentally gets them expelled. ]\n\n\n\nEPISODE 4\nTITLE.......[ Rosebud ]\nRUNTIME.....[ 22:58 ]\nFIRST AIRED.[ 10/21/93 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ Yearning for his lost youth and innocence, Mr. Burns searches for \nhis beloved childhood teddy bear, Bobo. When Maggie comes across the bear, she \nclaims it as her own. Mr. Burns tries to get his Bobo back by any means \nnecessary. ]\n\n\n\nEPISODE 5\nTITLE.......[ Treehouse of Horror IV ]\nRUNTIME.....[ 23:25 ]\nFIRST AIRED.[ 10/28/93 ]\nDATA RATE...[ 124 kbps ]\nDESCRIPTION.[ With a Night Gallery style opening, Bart introduces three tales.\nTHE DEVIL AND HOMER SIMPSON: Homer falls asleep, while Carl and Lenny eat all the\ndoughnuts. When he realizes that all the nearest doughnuts are gone, he sells his\nsoul for a doughnut. The devil comes up and signs a contract with him, causing \nmore mischief than Homer thought. His family saves him from an eternity of \ndamnation by a fair trial.\nTERROR AT 5 1/2 FEET: Bart dreams about his death on the schoolbus, and later \nrealizes, that his dream is starting to become real when he is the only one to \nsee a gremlin taking down the bus piece by piece. Nobody sees it except for him,\nso he tries to get it off.\nBART SIMPSON&amp;#039;S DRACULA: Mr. Burns is a vampire and Bart falls victim to his bite,\nLisa convinces the rest of the family they must go to his castle and put an end \nto the curse. ]\n\n\n\nEPISODE 6\nTITLE.......[ Marge on the Lam ]\nRUNTIME.....[ 22:55 ]\nFIRST AIRED.[ 11/14/93 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ Homer has to cancel his plans with Marge because he got his arms \nstuck in two vending machines, so Marge goes out with their neighboor Ruth. It \nturns out, Ruth is somewhat of a wanted criminal. In a Thelma and Louise style \nstory, Marge and Ruth are being chased by Chief Wiggum and Homer. All the while, \nLionel Hutz is left to babysit the children. ]\n\n\n\nEPISODE 7\nTITLE.......[ Bart&amp;#039;s Inner Child ]\nRUNTIME.....[ 22:57 ]\nFIRST AIRED.[ 11/11/93 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ Homer sees an ad in the paper for a trampoline and he goes to \nKrusty&amp;#039;s and picks it up. The kids love it and he charges the neighbors to use \nit. When all the children get injured on it, Marge makes him get rid of it. He \npushes it off a cliff, a la Wile E. Coyote. Homer and Marge have an argument in \nwhich he says that Marge is no fun. With this realization, she gets very angry \nand goes to her sisters&amp;#039; house. Patty and Selma show her a self-help video. When\nMarge starts looking at the self-help information starring Brad Goodman with \nHomer their relationship improves. They go to a seminar with the kids. Bart acts\nout while there and the lecturer brings him on stage. The guru tells the town \nthat Bart is the &quot;inner child&quot; that they should all strive to be. Lisa of course\nis skeptical, thinking that the guru is just selling easy answers, but the town\nis buying it. So much so, they hold a &quot;do what you feel&quot; festival. It breaks out\ninto a riot when everybody starts to act irresponsibly and the &quot;be like Bart&quot; \nera comes to an end. We end with the Simpsons watching the newest episode of \n&quot;MacArnagle&quot; together. ]\n\n\n\nEPISODE 8\nTITLE.......[ Boy-Scoutz &amp;#039;N the Hood ]\nRUNTIME.....[ 22:55 ]\nFIRST AIRED.[ 11/18/93 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Bart and Milhouse find $20 which they use to go on a Squishee \nbender in downtown Springfield. With no memories of what accured, Bart is \nshocked to find out he joined the Junior Campers. Now a full fledged member, he\nmust attend the father son rafting trip with Homer. ]\n\n\n\nEPISODE 9\nTITLE.......[ The Last Temptation of Homer ]\nRUNTIME.....[ 22:58 ]\nFIRST AIRED.[ 12/9/93 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ A female employee is hired at the plant. She has an attraction for\nHomer and Homer must fight his equal attraction for her. In the mean time, Bart\nbecomes an outcast and makes friends with a group of nerds after he is \nprescribed glasses, scalp salve, special shoes, and throat spray which changes \nhis voice. ]\n\n\n\nEPISODE 10\nTITLE.......[ $pringfield (Or, How I Learned to Stop Worrying and Love Legalized Gambling) ]\nRUNTIME.....[ 23:02 ]\nFIRST AIRED.[ 12/16/93 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ During a town meeting, Principal Skinner pitches the idea of \nopening a casino. Mr. Burns adopts this notion and builds the &quot;Mr. Burns&amp;#039; \nCasino.&quot; Homer takes a job as a blackjack dealer and Marge takes up gambling. \nAt home, Lisa is having difficulties with her school project and Bart opens a \ntreehouse casino. ]\n\n\n\nEPISODE 11\nTITLE.......[ Homer the Vigilante ]\nRUNTIME.....[ 22:57 ]\nFIRST AIRED.[ 1/16/94 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ A cat burglar robs everyone on Evergreen Terrace, including Lisa. \nHomer gives Lisa a jug to replace her sax. When she is unsatisfied with the jug,\nhe vows to get it back for her. The police are far too incompetent to get \nanywhere, so Flanders starts a neighborhood watch. Homer becomes the leader \nand lets the power go to his head. They beat unruly people with sacks of \ndoorknobs and commit other crimes. The burglar steals a jewel from the museum,\nfrom under Homer&amp;#039;s watch. Abe figures out it was his neighbor, Mulloy. Upon his\narrest, Mulloy charms everyone. Homer mocks him in his cell and Mulloy tells \neveryone that he hid a large sum of money underneath a tree. They all rush to\nthe location and dig for it, finding nothing. Mulloy uses this time to escape\nfrom prison. ]\n\n\n\nEPISODE 12\nTITLE.......[ Bart Gets Famous ]\nRUNTIME.....[ 22:57 ]\nFIRST AIRED.[ 2/3/94 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ After Bart sneaks away from a field trip to the box factory, he \nfinds himself working as Krusty&amp;#039;s assistant. Krusty lets Bart act out a scene on\none of his gags, but Bart messes up the line and says, &quot;I didn&amp;#039;t do it.&quot; The \nphrase is an instant success and leads Bart to his fifteen minutes of fame. ]\n\n\n\nEPISODE 13\nTITLE.......[ Homer and Apu ]\nRUNTIME.....[ 22:57 ]\nFIRST AIRED.[ 2/10/94 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Apu loses his job at the Kwik-E-Mart after he sells Homer tanted \nmeat. Homer feels bad and lets Apu live at the Simpson&amp;#039;s home while he is \nunemployed. In an attempt to get his job back, Apu and Homer travel to India to\ntalk with the head of the Kwik-E-Mart corporation. Back in Springfield, James \nWoods fills in Apu&amp;#039;s position. ]\n\n\n\nEPISODE 14\nTITLE.......[ Lisa vs. Malibu Stacy ]\nRUNTIME.....[ 22:56 ]\nFIRST AIRED.[ 2/17/94 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ Grampa realizes that he is no spring chicken and he gives the \nfamily their inheritance before he dies. They immediately go to the mall to \nspend it. Lisa uses her portion to buy a talking Malibu Stacy doll, but when she\npulls the string, she is very disappointed in what it says. It spouts nothing \nbut sexist remarks. Lisa goes to complain to the Malibu Stacy company executives,\nbut it doesn&amp;#039;t work. She finds out from Mr. Smithers where she can find the \ncreator of Malibu Stacy. She meets with her and together they decide to create a\nfeminist doll: Lisa Lionheart. In the mean time, Grampa decides to recapture his\nyouth, so he gets a job at a fast food restaurant. ]\n\n\n\nEPISODE 15\nTITLE.......[ Deep Space Homer ]\nRUNTIME.....[ 22:51 ]\nFIRST AIRED.[ 2/24/94 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ At the plant, Homer never gets to be employee of the month; they \neven choose an inanimate carbon rod over him. At NASA the ratings are down, so \nthey begin a campaign to recruit an everyday loser for the next pointless \nmission. Naturally, Homer and Barney are among the finalists. The family gets to\ngo to Florida while they train. Barney is kicking Homer&amp;#039;s butt, but alcoholism \nends his quest. Homer gets really nervous about the mission. He will go with two\nformer astronauts, so he can&amp;#039;t screw up like he always does, right? Nope! He \nbrings potato chips into space and wreaks havoc on the mission. James Taylor \ncomes up with a plan to save them, but Homer screws up again. An inanimate \ncarbon rod finally saves them for their reentry. Homer once again fails to get \nany recognition, because a rod takes the spotlight. ]\n\n\n\nEPISODE 16\nTITLE.......[ Homer Loves Flanders ]\nRUNTIME.....[ 22:56 ]\nFIRST AIRED.[ 3/17/94 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ Homer reluctantly goes to a football game with Ned. After Ned shows\nHomer a good time, they become close friends. Little to Homer&amp;#039;s realization, Ned\nactually starts to have negative feelings toward him. ]\n\n\n\nEPISODE 17\nTITLE.......[ Bart Gets an Elephant ]\nRUNTIME.....[ 22:56 ]\nFIRST AIRED.[ 3/31/94 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ Bart wins a radio contest which allows him to choose between two \nprizes: $10,000 or an elephant. Bart picks the elephant and names him Stampy. \nHomer and Marge decide to give the elephant away because he cost to much to feed,\nso Bart and Stampy run away together. ]\n\n\n\nEPISODE 18\nTITLE.......[ Burns&amp;#039; Heir ]\nRUNTIME.....[ 22:56 ]\nFIRST AIRED.[ 4/14/94 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ Mr. Burns watches as Homer cleans the plant as a human chimney \nsweep. Later Burns nearly drowns in his bathtub when Smithers neglects him. He \nmakes the realization that he has no heir. Smithers would like Burns to consider\nhim, but Burns has other ideas. He announces before a movie that he will hold \nauditions for his heir. All of Springfield&amp;#039;s children show up, but Burns hates \nall of them. Bart&amp;#039;s audition goes terribly when Homer writes down his speech on\nindex cards. (Homer is so dumb in this episode that he cannot even form \ngrammatical sentences.) Bart comes back at night and vandalizes his mansion. \nBurns is impressed with Bart&amp;#039;s destructive side, so he makes him his heir. Burns\nis still all alone, so Bart agrees to come and stay with him. Burns likes Bart a\nlot, but Bart thinks Burns is creepy. When Bart returns home, he is bored and he\ngoes back to Burns. Burns tries to trick Bart into thinking that his real family\nno longer loves him. He does this by hiring famous actors to play his family, \nbut Bart has trouble keeping friends and is lonely. At the plant Burns fires \npeople for kicks and he tries to make Bart fire his father, but Bart proves his \nloyalty to his family and opens a trap door under Burns. ]\n\n\n\nEPISODE 19\nTITLE.......[ Sweet Seymour Skinner&amp;#039;s Baadasssss Song ]\nRUNTIME.....[ 22:54 ]\nFIRST AIRED.[ 4/28/94 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ Bart doesn&amp;#039;t have anything for show-and-tell, so he brings his dog\nto school. Santa&amp;#039;s Little Helper finds his way into the ventilation ducts and \nstarts wreaking havoc. Principal Skinner sends Willie after him and \nSuperintendent Chalmers shows up just in time to see that Skinner has lost \ncontrol. He fires Skinner and obtains a replacement. The new principal is none \nother than Ned Flanders! Bart starts to feel guilty about ruining Skinner&amp;#039;s life\nand he befriends him. Meanwhile, Flanders turns out to be quite a pushover as \nprincipal and Bart misses the challenge that Skinner offered as principal. \nSkinner reenlists in the Army and Bart tries to get Skinner his job back by \ngetting Flanders fired. Skinner leaves the Army when Superintendent Chalmers \nhears Flanders preaching the word of God to the school and fires him. When \nSkinner returns he and Bart are back to being enemies. ]\n\n\n\nEPISODE 20\nTITLE.......[ The Boy Who Knew Too Much ]\nRUNTIME.....[ 22:56 ]\nFIRST AIRED.[ 5/5/94 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ We begin with Bart and Lisa heading to school. Bart is bored in \nclass, so he forges a note from Marge to cut class and goes to see &quot;Boobarama.&quot;\nMeanwhile, Skinner is trying to track him down after becoming suspicious of the\nnote. Bart narrowly escapes his grasp by stowing away in Quimby&amp;#039;s nephew&amp;#039;s car.\nAt a Quimby party, the nephew gets in an argument with a waiter. Bart witnesses\nthe waiter clumsily injuring himself. No one else sees it, so the waiter claims\nQuimby&amp;#039;s nephew assaulted him. The trial is a media event, but Bart cannot come\nforward or Skinner will give him detention. The jury consists of Homer, Skinner,\nApu, et cetera. Homer is an incompetant juror and wants to be sequestered at the\ncity&amp;#039;s nicest hotel. After watching &quot;MacArnagle,&quot; Bart decides to come forward\nto the Judge. Bart&amp;#039;s testimony frees the innocent Quimby, but gets him four \nmonths of detention. ]\n\n\n\nEPISODE 21\nTITLE.......[ Lady Bouvier&amp;#039;s Lover ]\nRUNTIME.....[ 22:51 ]\nFIRST AIRED.[ 5/12/94 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ It is Maggie&amp;#039;s birthday, so the whole family gathers to celebrate.\nAbe seems especially pathetic and lonely and Marge decides to set him up with her\nmother, who has the same problem. They hit it off, or so Abe thinks. Bart decides\nto order a souvenir from &quot;Itchy &amp; Scratchy,&quot; so he steals Homer&amp;#039;s wallet but the\nitem turns out to be a waste of $350. Abe soon falls in love. He wants to impress\nMarge&amp;#039;s mother by taking her out on the town, but when he does, she falls for \nMr. Burns. Abe is heartbroken. When Mr. Burns come over to the Simpsons&amp;#039; house \nto pick her up for a date we learn that Marge is against her mother&amp;#039;s new love \ninterest. Bart gets $350 out of Mr. Burns which he uses to pay Homer back. Mr. \nBurns asks for his love&amp;#039;s hand in marriage, but when the wedding date arrives, \nAbe breaks up the ceremony. Marge&amp;#039;s mother leaves with him, although she is not\nin love with Abe OR Mr. Burns. We get a loose, yet obvious, homage to &quot;The \nGraduate&quot;, complete with a Simon &amp; Garfunkel parody. ]\n\n\n\nEPISODE 22\nTITLE.......[ Secrets of a Successful Marriage ]\nRUNTIME.....[ 22:53 ]\nFIRST AIRED.[ 5/19/94 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ Homer fears he may be a little slow, so he goes to the Adult \nEducation Annex. While there, he decides to teach a class of his own on the \nsecrets of a successful marriage, since that is the only thing he is good at. ]\n\n                       \n","torrent":{"xt":"urn:btih:dde17be2e5272f3bbf92f8783ef78e09f56a579d","amp;dn":"The+Simpsons+-+Season+5+Complete+%5BDVDRIP+VP7+KEGGERMAN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dde17be2e5272f3bbf92f8783ef78e09f56a579d","infoHashBuffer":{"type":"Buffer","data":[221,225,123,226,229,39,47,59,191,146,248,120,62,247,142,9,245,106,87,157]},"announce":[],"urlList":[]}}