{"title":"How God Made the English - 3 Part BBC Documentary","uid":7189031,"size":1517614166,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:df17f8aeef49489e5b0663c7fac3205cae7021a6&amp;dn=How+God+Made+the+English+-+3+Part+BBC+Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1334560514,"description":"How God Made the English Typical Episode Notes\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 999kbps \nDuration.............: 59:27.840\nResolution...........: 608*336 \nFramerate............: 25.000 \nAudio Codec..........: 0x0055 MPEG-1 Layer 3 \nAudio Bitrate........: 128 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 507,164,672 \nNO SUBTITLES\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2335307/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2335307/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/pAoCCAADb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/pAoCCAADb&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b01dxrhg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b01dxrhg&lt;/a&gt;\n\nA Chosen People?\n\nThe first in a three-part series in which Diarmaid MacCulloch, Professor of Church History at Oxford University, explores both what it means to be English and what has shaped English identity, from the Dark Ages, through the Reformation to modern times. In this first episode, Professor MacCulloch chronicles the roots of the idea that the English think themselves better than others and duty-bound to play a leading role in world affairs. He argues that the roots of this attitude lie in a tangle of religious motives. He traces its origins to the notion of a 'chosen people' - a Biblical idea which the monk and historian, the Venerable Bede, took lock, stock and barrel from the Jewish scriptures and applied to the early English.\n\nA Tolerant People?\n\nThe second in a three part series in which Diarmaid MacCulloch, Professor of Church History at Oxford University, explores both what it means to be English and what has shaped English identity through history. Professor MacCulloch challenges the commonly held assumption that the English have a long and glorious tradition of tolerance. Rather, history shows that until recently the English were among the least tolerant peoples in the world. In a provocative take on English history, he challenges the fashionable wisdom that it is secular forces and the humanistic values of the Enlightenment that have influenced this English trait. Instead he argues that the root of English tolerance lies in its Christian history - although it's been a journey of accident rather than design.\n\nA White and Christian People?\n\nA documentary series in which Diarmaid MacCulloch, Professor of Church History at Oxford University, explores both what it means to be English and what has shaped English identity through history. The final programme examines the idea that there is an ethnic core to Englishness. Is there any basis for the claim that to be truly English you have to be Anglo-Saxon? And what about the fact that until very recently being English also meant being Church of England Christian? In this series Professor Diarmaid MacCulloch has been arguing that God made the English. But did he also make them white and Christian?","torrent":{"xt":"urn:btih:df17f8aeef49489e5b0663c7fac3205cae7021a6","amp;dn":"How+God+Made+the+English+-+3+Part+BBC+Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df17f8aeef49489e5b0663c7fac3205cae7021a6","infoHashBuffer":{"type":"Buffer","data":[223,23,248,174,239,73,72,158,91,6,99,199,250,195,32,92,174,112,33,166]},"announce":[],"urlList":[]}}