{"title":"Audio Book - Diary of a Nobody. read by Arthur Lowe.360kbps","uid":3462698,"size":242388391,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:df49c6f38800212a29ba7da342a8277906bcd8c0&amp;dn=Audio+Book+-+Diary+of+a+Nobody.+read+by+Arthur+Lowe.360kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"myth1","files":5,"time":1143429133,"description":"Synopsis\nThis is the fictional diary of a nobody. The \n\n&amp;#039;Nobody&amp;#039; in question is Charles Pooter, a clerk \n\nliving in Holloway, of prison fame. He worked in \n\na office in the city. He is married to Carrie, \n\nand has a son, Lupin. Lupin Pooter sounds like \n\nthe medical name for a heavy drinkers boko to \n\nme. Although I have looked it up in Grays and of \n\ncourse it isn&amp;#039;t there but on page....... I will \n\ncome back to Lupin later.\n\nCharles is vain, self-important, gullible, at \n\nthe constant mercy of insolent tradesmen and \n\nimpudent junior clerks at work who are obviously \n\nmuch more clever than he is. Even worse, he gets \n\nsent insulting Christmas cards. Above all, he \n\nhas a deplorable taste in excruciating jokes and \n\npuns. At a party, he says he hopes it won&amp;#039;t be \n\nlong before he meets Mr Short. His more tiresome \n\nacquaintances and neighbours include a Mr \n\nGowing, who always seems to be coming, and a Mr \n\nCumming - who is always going. Gowing not only \n\ncomes, but is also a hooligan given to chucking \n\nfood around at the supper table. Mr Pooter tries \n\nto remonstrate with him, only to be told that \n\nit&amp;#039;s no good his trying to look indignant, with \n\nhis hair full of parsley.\n\nHe gets to hear about how good enamel paint is, \n\nand buys a tin of red, and paints their flower \n\npots, coal scuttle (for those young &amp;#039;uns out \n\nthere, it&amp;#039;s where posh people kept their coal.) \n\nand the backs of their set of Shakespeare, as \n\nthe bindings have almost worn out. Then he \n\npaints the bath (where my family kept the coal). \n\nSome days later he feels unwell, and decides the \n\nanswer is to have a hot bath. After soaking \n\nhimself for some time, he takes his hand out of \n\nthe water and finds his hand bleeding badly. Has \n\nhe ruptured an artery, and is he about to meet \n\nhis maker? Nope the bloomin paint ain&amp;#039;t dried!\n\nLupin (what a blooming silly name, blooming? Get \n\nit?) hates being seen with his old man who wears \n\nstrange suits. Dad buys his clobber in the \n\nevening, when he can only choose his suiting by \n\ngaslight, and discovers the next day how \n\nterrible they suddenly look. Lupin seems always \n\nto be making the wrong choices with women. He is \n\nalso out of work a lot.\n\nSomebody wrote If you can remember that far \n\nback, or have caught the occasional recent \n\nrepeat on TV, you might draw parallels between \n\nCharles Pooter and Eric Sykes. The latter used \n\nto star in as well as write the scripts for a \n\nlate 60s and early 70s sitcom, as an amiable, \n\nslightly accident-prone fool continually worsted \n\nby his more clever twin sister Hattie Jacques and \n\nsupercilious neighbour Charles Brown (Richard \n\nWattis). Maybe Eric modelled himself in part on \n\nthe oh-so-ordinary but likeable Charles Pooter.","torrent":{"xt":"urn:btih:df49c6f38800212a29ba7da342a8277906bcd8c0","amp;dn":"Audio+Book+-+Diary+of+a+Nobody.+read+by+Arthur+Lowe.360kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df49c6f38800212a29ba7da342a8277906bcd8c0","infoHashBuffer":{"type":"Buffer","data":[223,73,198,243,136,0,33,42,41,186,125,163,66,168,39,121,6,188,216,192]},"announce":[],"urlList":[]}}