{"title":"Slayer - Christ Illusion (2006) - Metal","uid":3963944,"size":74545769,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:df55bcefc7eca487822e504b020fd0a56fb56b3a&amp;dn=Slayer+-+Christ+Illusion+%282006%29+-+Metal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Apeface","files":14,"time":1199580320,"description":"ARTiST   : Slayer\nALBUM    : Christ Illusion\nLABEL    : American Recordings\nGENRE    : Metal\n\nRELEASE  : 2006-08-01\nSTREET   : 2006-08-08\n\nENCODER  : LAME 3.90.3\nQUALiTY  : 258kbps avg / 44.1kHz / Joint Stereo\nSiZE     : 72.7 MB\nPLAYTiME : 00:38:28\n\n+ TRACK LiSTiNG +\n-----------------\n\n[#] [Track Name]                                                  [Time]\n\n1.  Flesh Storm                                                    4:15\n2.  Catalyst                                                       3:07\n3.  Skeleton Christ                                                4:22\n4.  Eyes Of The Insane                                             3:23\n5.  Jihad                                                          3:31\n6.  Consfearacy                                                    3:08\n7.  Catatonic                                                      4:55\n8.  Black Serenade                                                 3:16\n9.  Cult                                                           4:40\n10. Supremist                                                      3:51\n                                                                  38:28\n\n\n+ RELEASE iNFORMATiON +\n-----------------------\nThe band was originally known as Dragonslayer before shortening its name \nto Slayer.  Contrary to what some believe, the name was not chosen as an \nacronym for Satan Laughs As You Eternally Rot; rather, this wording, \nfound on the liner notes to Divine Intervention, was added as a \nbackronym after the name was shortened.  Araya has jokingly stated that \nthey chose Slayer because &quot;it was cool, easy to chant&quot;. [3] The \nbackronym might orginate from the line &quot;Laughing as you eternally rot&quot; \nfrom the song &quot;Live Undead&quot; (South of Heaven, 1988).\n\nSlayer&amp;#039;s first album, Show No Mercy, was released in 1983 on Metal Blade \nRecords.  It contains fan favorites such as &quot;Die By the Sword&quot;, &quot;The \nAntichrist&quot; and &quot;Black Magic.&quot; It was essential in gaining the band a \ncult following and respect in the metal community.\n\nThe band&amp;#039;s second release, the Haunting the Chapel EP, was considerably \ndarker and more thrash-oriented than its predecessor, and is considered \nto have laid the groundwork for what the band&amp;#039;s classic sound would \nbecome.  It opens with the now classic &quot;Chemical Warfare,&quot; which is \ntypically one of two songs the band plays as a live closer.\n\nThe band&amp;#039;s second full-length release, Hell Awaits, expanded on the \ndarkness of Haunting the Chapel, as hell and Satan were common song \nsubjects.  Musically it is the band&amp;#039;s most progressive offering, \ncontaining only seven tracks, three of which clocked in at over six \nminutes.  The intro to the album is a demonic-sounding voice repeating \n&quot;Join us,&quot; reversed on tape to play backward, and ending with an ironic \n&quot;Welcome back&quot; before the title track proper begins.\n\nAfter being offered a recording deal by Rick Rubin&amp;#039;s Def Jam Recordings, \nthe band signed and quickly began working on its third album with Rubin \nas co-producer.  The result, 1986&amp;#039;s Reign in Blood, has been called a \n&quot;thrash metal masterpiece&quot; and even credited with almost single-handedly \ninspiring the entire death metal genre, at least in North America. \nKerrang!  called Reign in Blood as &quot;the heaviest album of all time&quot;.  In \n2003 Slayer played the album in its entirety throughout their fall tour \n(something they never did on the original album tour).  A DVD of one of \nthese performances was released with the title Still Reigning.  Closer \n&quot;Raining Blood&quot; culminated with the band being drenched in a rain of \nfake blood.  In 2006 Metal Hammer named Reign In Blood their number one \nof their top two hundred albums in Metal Hammer&amp;#039;s lifetime.  It also came \nin at number one in their top twenty thrash albums.\n\nSouth of Heaven, released in 1988, marked a significant musical \ndeparture.  To contrast the aggressive assault put forth on Reign in \nBlood, Slayer consciously slowed down the tempo of the album as a whole. \nThey also added elements like undistorted guitars and toned-down vocal \nstyles not heard on previous albums.  Some critics praised the album as \ndemonstrating Slayer&amp;#039;s desire to grow musically and avoid repeating \nthemselves.  But the new sounds disappointed some of the band&amp;#039;s fans who \nwere more accustomed to the style of earlier releases.  Even though fans \nremain divided on the subject, two songs from the album (&quot;Mandatory \nSuicide&quot; and &quot;South of Heaven&quot;) have become almost permanent additions \nto the band&amp;#039;s live setlist.  Following the release of South of Heaven, \nthe band recorded a thrash-metal cover of Iron Butterfly&amp;#039;s signature \nsong, In-A-Gadda-Da-Vida.  This song was included on the soundtrack to \nthe movie Less Than Zero.\n\nThe follow-up album, Seasons in the Abyss, was more of a return to the \nsound of Reign in Blood and was greeted warmly by fans.  A video clip for \nthe title track had the band playing in the Middle East, shortly before \nthe start of the Gulf War.  Vocal overdubs on &quot;Temptation&quot; and a child&amp;#039;s \nvoice pleading underneath the track &quot;Dead Skin Mask&quot; (about necrophile \nEd Gein)?as well as the title track, which originally made use of a \nflute?were the most obvious signs of the band&amp;#039;s growth.\n\nA double live album, Decade of Aggression, was released in 1991, and \naside from a brief tour the next year (including an appearance at the \n1992 Monsters of Rock festival at Castle Donington, nothing new would be \nheard from Slayer until 1994&amp;#039;s Divine Intervention.  The new record \nboasted songs about Jeffrey Dahmer (&quot;213,&quot; his apartment number) and \nReinhard Heydrich (&quot;SS-3&quot;) amongst other themes of murder and the evils \nof church and government.  Live Intrusion, a video of concert footage, \nwas released the next year and features a joint cover of Venom&amp;#039;s \n&quot;Witching Hour&quot; with Machine Head, who were Slayer&amp;#039;s support on the \nspring 1995 tour. (Relations between Kerry King and Robb Flynn have \nsince badly deteriorated.)\n\nUndisputed Attitude (1996) found Slayer reaffirming their love for \nhardcore punk.  The band covered songs by Minor Threat, T.S.O.L., D.R.I., \nD.I., Dr.  Know, Verbal Abuse, and even Iggy and the Stooges.  Song&amp;#039;s \n&quot;Can&amp;#039;t Stand You&quot; and &quot;Ddamm&quot; were previously unreleased punk songs \nwritten by Hanneman in 1984-1985 while in an unnamed side project.  The \nalbum&amp;#039;s ending track was an original song entitled &quot;Gemini&quot;.\n\nDiabolus in Musica (Latin for &quot;The Devil in Music&quot;) was released in 1998 \nand marked, along with an altered logo, a change in compositional style \nfor the band.  This style incorporated a new groove into some song \nstructures and fan reaction was divided.  Nevertheless, a successful \nworld tour followed.\n\nGod Hates Us All, Slayer&amp;#039;s most recent studio album, was released on \nSeptember 11, 2001.  Some promotional material announcing the album title \nand release date drew an unintended connection with the 9/11 terrorist \nattacks.  They have also released a live DVD (War at the Warfield) and \nbox set (Soundtrack to the Apocalypse) featuring rarities, live CD and \nDVD performances and various Slayer paraphernalia.\n\nIn 1996, a lawsuit was brought against the band by the parents of Elyse \nPahler, who accused the band of encouraging their daughter&amp;#039;s murderers \nthrough their lyrics.  The lawsuit was thrown out in 2001, for multiple \nreasons including &quot;principles of free speech, [lack of a] duty and [lack \nof] foreseeability&quot; - California Superior Court of San Luis Obispo \nCounty.\n\nThe band received their first Grammy nomination for &quot;Best Metal \nPerformance&quot; on January 8, 2002.\n\nSlayer&amp;#039;s new album, Christ Illusion to be released on August 8th, 2006.\n","torrent":{"xt":"urn:btih:df55bcefc7eca487822e504b020fd0a56fb56b3a","amp;dn":"Slayer+-+Christ+Illusion+%282006%29+-+Metal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df55bcefc7eca487822e504b020fd0a56fb56b3a","infoHashBuffer":{"type":"Buffer","data":[223,85,188,239,199,236,164,135,130,46,80,75,2,15,208,165,111,181,107,58]},"announce":[],"urlList":[]}}