{"title":"POtHS 4 - Conspiracy Facts - Part 39 - Chemical Dumbing Down of ","uid":7469356,"size":1376447394,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e084dcb2afa6dfd3e081a4cf5623681ba5e7cf7b&amp;dn=POtHS+4+-+Conspiracy+Facts+-+Part+39+-+Chemical+Dumbing+Down+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"POtHS11","files":52,"time":1343100445,"description":"\n\n\nPOtHS 4 - Conspiracy Facts - Part 39 - Chemical Dumbing Down of a Nation\n\n\n\nPOtHS Comments on This one: They are coming!!!\n\nDescription:\n\nWhat have aspartame, compulsory schooling, toxic vaccines, fluoridation, watching TV, and multiculturalism all have in common?  Dr. Russell blaylock accuses Industry and Government of dumbing down society with Chemical Toxins.  \n\nVaccinations have been used to chemically dumb down people.  Preservatives are used to chemically dumb down people.  Chemicals in many foods today are toxic and are designed to dumb down Americans.  Science and Government are behind poisoning people by design.  Neoro Toxins are being multiply stupid people and to reduce smart people across America.  Fluoridation in the water supply is a poison and it's helping to keep Americans sleepy, stupid.  The research in these documents will shock and anger you.\n\n\nIn the past 40 years, thousands of new and unnatural chemicals have been added to our food, water and air.  From fluoride in the water (industrial waste product we import from China) to artificial flavors, artificial sweeteners, artificial colors, synthetic flavor enhancers, emulsifiers and preservatives in our food, and sulfur dioxide, hydrogen sulfide, hydrocarbons, barium and aluminum compounds dumped into the air we breathe, health in the USA on the decline, along with our life expectancy.  The average American drinks fluoridated tap water, eats genetically modified (GM) food, and consumes vast quantities of fast food and processed food which are loaded with chemicals, anitbiotics, and synthetic hormones.\n\n","torrent":{"xt":"urn:btih:e084dcb2afa6dfd3e081a4cf5623681ba5e7cf7b","amp;dn":"POtHS+4+-+Conspiracy+Facts+-+Part+39+-+Chemical+Dumbing+Down+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e084dcb2afa6dfd3e081a4cf5623681ba5e7cf7b","infoHashBuffer":{"type":"Buffer","data":[224,132,220,178,175,166,223,211,224,129,164,207,86,35,104,27,165,231,207,123]},"announce":[],"urlList":[]}}