{"title":"The House of War and Witness by Mike Carey","uid":11092269,"size":1286474,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e135fb0ec4c25fe10c30d407ddcaafe80ca598f6&amp;dn=The+House+of+War+and+Witness+by+Mike+Carey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":2,"time":1411541628,"description":"\nIn the year 1740, with the whole of Europe balanced on the brink of war, a company of Austrian soldiers is sent to the village of Narutsin to defend the border with Prussia. But what should be a routine posting is quickly revealed to be anything but. \n\nThe previous garrison is gone, the great house of Pokoj, where they're to be billeted, a dilapidated ruin, and the people of Narutsin sullen and belligerent. Convinced the villagers are keeping secrets - and possibly consorting with the enemy - the commanding officer orders his junior lieutenant, Klaes, to investigate.\n\nWhile Klaes sifts through the villagers' truths, half-truths and lies, Drozde, the quartermaster's woman, is making uncomfortable discoveries of her own - about herself, her man, and the house where they've all been thrown together. \n\nBecause far from being the empty shell it appears to be, Pokoj is actually teeming with people. It's just that they're all dead. And the dead know things - about Drozde, about the history of Pokoj, and about the terrible event that is rushing towards them all, seemingly unstoppable.\n\nThe ghosts of Pokoj, the soldiers of the empress and the villagers of Narutsin are about to find themselves actors in a story that has been unfolding for centuries. It will end in blood - that much is written - but how much blood will depend on Klaes' honour, Drozde's skill and courage, and the keeping of an impossible promise\n\nGenre: Fantasy, Historical Fiction","torrent":{"xt":"urn:btih:e135fb0ec4c25fe10c30d407ddcaafe80ca598f6","amp;dn":"The+House+of+War+and+Witness+by+Mike+Carey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e135fb0ec4c25fe10c30d407ddcaafe80ca598f6","infoHashBuffer":{"type":"Buffer","data":[225,53,251,14,196,194,95,225,12,48,212,7,221,202,175,232,12,165,152,246]},"announce":[],"urlList":[]}}