{"title":"What Is Life? Lynn Margulis","uid":14953518,"size":127476023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e205de280bcf04929d064fbe3b5e59c1bdf6971d&amp;dn=What+Is+Life%3F+Lynn+Margulis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twp6045","files":1,"time":1466102413,"description":"Half a century ago, before the discovery of DNA, the Austrian physicist and philosopher Erwin Schrödinger inspired a generation of scientists by rephrasing the fascinating philosophical question: What is life? Using their expansive understanding of recent science to wonderful effect, acclaimed authors Lynn Margulis and Dorion Sagan revisit this timeless question in a fast-moving, wide-ranging narrative that combines rigorous science with philosophy, history, and poetry. The authors move deftly across a dazzling array of topics—from the dynamics of the bacterial realm, to the connection between sex and death, to theories of spirit and matter. They delve into the origins of life, offering the startling suggestion that life—not just human life—is free to act and has played an unexpectedly large part in its own evolution. Transcending the various formal concepts of life, this captivating book offers a unique overview of life’s history, essences, and future.\r\n\r\nSupplementing the text are stunning illustrations that range from the smallest known organism (Mycoplasma bacteria) to the largest (the biosphere itself). Creatures both strange and familiar enhance the pages of What Is Life? Their existence prompts readers to reconsider preconceptions not only about life but also about their own part in it.\r\n\r\nThere is much art as well as science in this beautifully illustrated treatment of topics relating to the genesis, organization and diversity of life forms on Earth. Margulis, a well-known professor of botany at the University of Massachusetts, and her son, Sagan, who previously collaborated on other works (Origins of Sex; Microcosmos) present a wide-ranging compendium that samples key facets of biology in conjunction with philosophic ideas and historical perspectives. The volume is configured for browsing. Numerous color photographs and charts convey a sense of wonder. While hugely informative, the text itself tends to the lyrical, sometimes lapsing into disconcerting private language. The issues emphasized reflect the authors' sympathy for a less dogmatically mechanistic and more phenomenological overview of what constitutes life, as exemplified by the Gaia hypothesis, which posits that the whole earth is a unified living organism. Library of Science, Natural Science, Astronomy and Reader's Subscription book clubs alternates.\r\n\r\nThis PDF is not available for purchase anywhere. I had it made for myself, and to share with the world. Enjoy!","torrent":{"xt":"urn:btih:e205de280bcf04929d064fbe3b5e59c1bdf6971d","amp;dn":"What+Is+Life%3F+Lynn+Margulis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e205de280bcf04929d064fbe3b5e59c1bdf6971d","infoHashBuffer":{"type":"Buffer","data":[226,5,222,40,11,207,4,146,157,6,79,190,59,94,89,193,189,246,151,29]},"announce":[],"urlList":[]}}