{"title":"A Vida Sobre Rodas - Life On Wells (2011) Subtitles Pt-BR, Eng,","uid":6346799,"size":838365495,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e239463b2b86423873ac7d9c052291b04817e993&amp;dn=A+Vida+Sobre+Rodas+-+Life+On+Wells+%282011%29+Subtitles+Pt-BR%2C+Eng%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1303860804,"description":"&quot;Life On Wheels&quot; tells the story of the brazilian skating in recent decades through depositions and maneuvers of the four largest national idols today: Bob Burnquist, Cristiano Mateus, Lincoln Ueda and Sandro Dias. Testimonials and pictures of skaters, journalists and businessmen form a set that depicts the obstacles overcome by skate today so this second most practiced sport in the country. &quot;Life On Wheels&quot; is a film of many stories, but, above all, the trajectory of young people, often with nothing in common other than a passion for skateboarding, which transformed the sport in the Brazil.\nSubtitles: Portuguese (Brazil), English, Spanish\n \n&quot;Vidas Sobre Rodas&quot; conta a histÃƒÂ³ria do skate nacional nas ÃƒÂºltimas dÃƒÂ©cadas atravÃƒÂ©s de depoimentos e manobras dos 4 maiores ÃƒÂ­dolos nacionais da atualidade: Bob Burnquist, Cristiano Mateus, Lincon Ueda e Sandro Dias. Depoimentos e imagens de skatistas, jornalistas e empresÃƒÂ¡rios formam um conjunto que retrata os obstÃƒÂ¡culos superados pelo skate, hoje o seguno esporte mais praticado no paÃƒÂ­s. &quot;Vida Sobre Rodas&quot; ÃƒÂ© um filme de muitas histÃƒÂ³rias, mas ÃƒÂ©, acima de tudo, a trajetÃƒÂ³ria de jovens, muitas vezes sem nada em comum alÃƒÂ©m da paixÃƒÂ£o pelo skate, que transformaram o esporte no paÃƒÂ­s.\nElenco: Bob Burnquist, Tony Hawk, Danny Way, Thronn, Daniel Bourqui, Christian Hosoi, Digo Menezes\n\n\n","torrent":{"xt":"urn:btih:e239463b2b86423873ac7d9c052291b04817e993","amp;dn":"A+Vida+Sobre+Rodas+-+Life+On+Wells+%282011%29+Subtitles+Pt-BR%2C+Eng%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e239463b2b86423873ac7d9c052291b04817e993","infoHashBuffer":{"type":"Buffer","data":[226,57,70,59,43,134,66,56,115,172,125,156,5,34,145,176,72,23,233,147]},"announce":[],"urlList":[]}}