{"title":"A Charm of Magpies","uid":12769580,"size":1318154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2b8a959f2254ffb112a2705a843d636691a0ee4&amp;dn=A+Charm+of+Magpies&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ventrego","files":9,"time":1447646772,"description":"This is a series of MM fiction books by KJ Charles:\r\n\r\nThe Smuggler and the Warlord [0.5]\r\nThe Magpie Lord [1.0]\r\nInterlude with Tattoos [1.5]\r\nA Case of Posession [2.0]\r\nA Case of Spirits [2.5]\r\nFlight of Magpies [3.0]\r\nFeast of Stephen [3.5]\r\n\r\nKJ charles offers several of these for free download from her website, http://kjcharleswriter.com/ . They are collected here and converted to .epub format, flush left, for easy reading.\r\n\r\n\r\nBook descriptions:\r\n\r\nThe Smuggler and the Warlord [0.5]:\r\nNo description available\r\n\r\n\r\nThe Magpie Lord [1.0]:\r\nExiled to China for twenty years, Lucien Vaudrey never planned to return to England. But with the mysterious deaths of his father and brother, it seems the new Lord Crane has inherited an earldom. He’s also inherited his family’s enemies. He needs magical assistance, fast. He doesn’t expect it to turn up angry.\r\n\r\nMagician Stephen Day has good reason to hate Crane’s family. Unfortunately, it’s his job to deal with supernatural threats. Besides, the earl is unlike any aristocrat he’s ever met, with the tattoos, the attitude…and the way Crane seems determined to get him into bed. That’s definitely unusual.\r\n\r\nSoon Stephen is falling hard for the worst possible man, at the worst possible time. But Crane’s dangerous appeal isn’t the only thing rendering Stephen powerless. Evil pervades the house, a web of plots is closing round Crane, and if Stephen can’t find a way through it—they’re both going to die.\r\n\r\nWarning: Contains hot m/m sex between a deeply inappropriate earl and a very confused magician, dark plots in a magical version of Victorian England, family values (not the good kind), and a lot of swearing.\r\n\r\n\r\nInterlude with Tattoos [1.5]:\r\nA short story set just after the end of The Magpie Lord. Stephen Day and Lord Crane return to London. Neither is quite sure where their fledgling relationship is going. It seems unlikely that there can be much of a future for them, under the circumstances, with Stephen going back to work and Crane returning to China. Until they encounter an unexpected moment of magic.\r\n\r\n\r\nA Case of Posession [2.0]:\r\nLord Crane has never had a lover quite as elusive as Stephen Day. True, Stephen's job as justiciar requires secrecy, but the magician's disappearing act bothers Crane more than it should. When a blackmailer threatens to expose their illicit relationship, Crane knows a smart man would hop the first ship bound for China. But something unexpectedly stops him. His heart. Stephen has problems of his own. As he investigates a plague of giant rats sweeping London, his sudden increase in power, boosted by his blood-and-sex bond with Crane, is rousing suspicion that he's turned warlock. With all eyes watching him, the threat of exposure grows. Stephen could lose his friends, his job and his liberty over his relationship with Crane. He's not sure if he can take that risk much longer. And Crane isn't sure if he can ask him to. The rats are closing in, and something has to give... Warning: Contains m/m sex (on desks), blackmail, dark pasts, a domineering earl, a magician on the edge, vampire ghosts (possibly), and the giant rats of Sumatra.\r\n\r\n\r\nA Case of Spirits [2.5]:\r\nAs torrential rains wash away the stench of a London heat wave, another kind of wave is sweeping through the city streets. A rash of ghost sightings, followed quickly by madness—and horrifying, eye-melting blindness.\r\n\r\nThe outbreak hits close to home when Lord Crane’s manservant, Merrick, becomes the newest victim. Desperate to find the cause of the malady, Crane and his magician lover, Stephen Day, are in a race against time—to put an end to the magical assault and put to rest the painful memories resurrected by ghosts of the past.\r\n\r\nWarning: Magical horror, strong language, and strange brews disguised as strong drink. \r\n\r\n\r\nFlight of Magpies [3.0]:\r\nWith the justiciary understaffed, a series of horrifying occult murders to be investigated, and a young student who is flying-literally-off the rails, magical law enforcer Stephen Day is under increasing stress. And his relationship with his aristocratic lover, Lord Crane, is beginning to feel the strain. Crane chafes at the restrictions of England's laws, and there's a worrying development in the blood-and-sex bond he shares with Stephen. A development that makes a sensible man question if they should be together at all. When a thief strikes at the heart of Crane's home, a devastating loss brings his closest relationships into bitter conflict-especially his relationship with Stephen. And as old enemies, new enemies, and unexpected enemies paint the lovers into a corner, the pressure threatens to tear them apart. Warning: Contains hot-blooded sex, cold-blooded murder, sinister magical goings-on and a lot of swearing.\r\n\r\n\r\nFeast of Stephen [3.5]:\r\nStephen and Crane have finally got away on their long-awaited Christmas break, along with Crane’s henchman Merrick and Jenny Saint. A promised gift is made, and a request unexpectedly and magically fulfilled… This story comes after Flight of Magpies and is not a standalone read","torrent":{"xt":"urn:btih:e2b8a959f2254ffb112a2705a843d636691a0ee4","amp;dn":"A+Charm+of+Magpies","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2b8a959f2254ffb112a2705a843d636691a0ee4","infoHashBuffer":{"type":"Buffer","data":[226,184,169,89,242,37,79,251,17,42,39,5,168,67,214,54,105,26,14,228]},"announce":[],"urlList":[]}}