{"title":"Warehouse 13 - Season 1 - Episodes 7 thru 12","uid":13915179,"size":7337126697,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e3e2f5c63ffaa21c6657a4cd25e9be4f0bdacad2&amp;dn=Warehouse+13+-+Season+1+-+Episodes+7+thru+12&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":22,"time":1458340856,"description":"Warehouse 13 - Season 1 - Episodes 7 thru 12 (Size: 6.83 GB)\r\n \t\tWarehouse.13.S01E07.Implosion.720p.HDTV.x264.ac3.mkv\t1.09 GB\r\n \t\tWarehouse.13.S01E08.Duped.720p.HDTV.x264.ac3.mkv\t1.09 GB\r\n \t\tWarehouse.13.S01E09.Regrets.720p.HDTV.x264.ac3.mkv\t1.09 GB\r\n \t\tWarehouse.13.S01E10.Breakdown.720p.HDTV.x264.ac3.mkv\t1.09 GB\r\n \t\tWarehouse.13.S01E11.Nevermore.720p.HDTV.x264.ac3.mkv\t1.09 GB\r\n \t\tWarehouse.13.S01E12.MacPherson.720p.HDTV.x264.ac3.mkv\t1.09 GB\r\n \t\r\nXtras\r\nDescription\r\nWarehouse 13 - Season 2 - Episodes 7 thru 13\r\n\r\n\r\nSeason two begins right after the events of the season finale of season one. Pete and Myka find that Artie has survived the explosion thanks to the Phoenix artifact which was slipped into his pocket by MacPherson during their struggle. Though the Phoenix saves Artie from the explosion, in exchange it causes Mrs. Frederic's driver to die and to then explode with Mrs. Frederic barely surviving by jumping out of the car before the explosion. While still under MacPherson's control, Leena locates another past Warehouse agent named H.G. Wells and reverses the bronzing process, freeing her to assist MacPherson in penetrating into the Escher Vault inside the Warehouse. Wells eventually turns on MacPherson and kills him after taking an artifact from the Vault. Mrs. Frederic realizes that Leena was the one stealing Artifacts from the Warehouse for MacPherson while under the control of the Pearl of Wisdom, and helps remove the artifact from Leena's brain. Later, when Artie starts seeing MacPherson over the Warehouse, Leena explains that the visions may indicate that he has some unfinished business with MacPherson. Meanwhile Leena keeps having waves of vertigo and it is revealed that her condition is due to residual energy from MacPherson trapped in her brain, which was removed by Mrs. Frederic and The Regents.\r\n\r\nLater in season two H.G. Wells returns and starts helping them collect artifacts and is then reinstated as an agent which annoys Artie since he doesn't trust her. After Warehouse 2 is reactivated, Mrs. Frederic starts to have visions of Warehouse 2 that are slowly killing her and in the event of Mrs. Frederic's death, Claudia finds out that she would then take over as the new Warehouse caretaker, which upsets her. Pete, Myka, H.G. and Benedict Valda attempt to deactivate Warehouse 2 and so the other can continue onward, Valda ends up sacrificing himself. When they finally deactivate Warehouse 2 they find out that H.G. was looking for Warehouse 2 so she could get the Minoan Trident and create another ice age. Myka and Artie track H.G. down and stop her from causing another ice age and due to the preceding events, Myka realizes that she was wrong to trust H.G. and resigns as a warehouse agent, worrying that the mistake will haunt her and keep her from being an effective agent","torrent":{"xt":"urn:btih:e3e2f5c63ffaa21c6657a4cd25e9be4f0bdacad2","amp;dn":"Warehouse+13+-+Season+1+-+Episodes+7+thru+12","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3e2f5c63ffaa21c6657a4cd25e9be4f0bdacad2","infoHashBuffer":{"type":"Buffer","data":[227,226,245,198,63,250,162,28,102,87,164,205,37,233,190,79,11,218,202,210]},"announce":[],"urlList":[]}}