{"title":"The Romantics - One in a Million [promo].VOB","uid":9423914,"size":286889984,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e62afd772203cd5921383085a7f71e33f5fb1a39&amp;dn=The+Romantics+-+One+in+a+Million+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1388647548,"description":"The Romantics - One in a Million [promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;One in a Million&quot; is a song from  In Heat, the fourth album by The Romantics. It was released in 1983 on Nemperor Records. It was the Romantics' most commercially successful album, and featured the Romantics's biggest hit single: &quot;Talking in Your Sleep&quot;, peaking at #3, and a second top 40 hit, &quot;One in a Million&quot;, charted #37. \n\nThe Romantics is an American new wave band from Detroit, Michigan, formed in 1977. The band adopted the name &quot;The Romantics&quot; because they formed on Valentine's Day, 1977. The Romantics achieved popularity in the United States, Canada, parts of Asia, Australia, Europe, and Latin America during the first half of the 1980s on the strength of the band's songs and music videos. They were influenced by 1950s American rock and roll and 1960s American garage rock as well as British Invasion music.\n\nThe Romantics' original lineup consisted of lead vocalist, rhythm guitarist, and harmonicist Wally Palmar, lead guitarist and backing vocalist Mike Skill, bassist and backing vocalist Rich Cole, and drummer and lead vocalist Jimmy Marinos. All four band members made songwriting contributions to the group, but Palmar and Skill were considered the band's primary tunesmiths. After a few years of playing local and regional gigs in Detroit and the Midwest, this lineup of the Romantics recorded the band's self-titled debut album for Nemperor Records in 1980 with British producer Pete Solley. The group's true record debut was the 1978 single on Spider Records, &quot;Little White Lies&quot; / &quot;I Can't Tell You Anything&quot;, followed that year by the Bomp single &quot;Tell It to Carrie&quot; / &quot;First in Line&quot; (on the Bomp Records label). All of these were re-recorded later for the first LP.\n\nThe album yielded the hit &quot;What I Like About You,&quot; which reached No. 49 in the US, No. 12 in the Netherlands, and No. 2 in Australia, where the band was especially popular.\n\nThe Romantics continue to play live concerts today (with occasional guest performances by previous members Jimmy Marinos, Rich Cole, Clem Burke and David Petratos). The band is said to currently be working on a follow up to 61/49.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/In_Heat_(The_Romantics_album)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/In_Heat_(The_Romantics_album)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/FafkmaaFL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/FafkmaaFL&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7999kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:57\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.1\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:e62afd772203cd5921383085a7f71e33f5fb1a39","amp;dn":"The+Romantics+-+One+in+a+Million+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e62afd772203cd5921383085a7f71e33f5fb1a39","infoHashBuffer":{"type":"Buffer","data":[230,42,253,119,34,3,205,89,33,56,48,133,167,247,30,51,245,251,26,57]},"announce":[],"urlList":[]}}