{"title":"Die Beunruhigung [DEFA 1982]","uid":12662055,"size":731116938,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e854b9810fc05df8ecc1a5ecab5c378566898b5e&amp;dn=Die+Beunruhigung+%5BDEFA+1982%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mesothorax","files":1,"time":1446308524,"description":"Die Beunruhigung ist ein deutscher Spielfilm der DEFA von Lothar Warneke aus dem Jahr 1982. Die Low-Budget-Produktion der DEFA wurde als teilweise improvisierter Spielfilm mit dokumentarem Charakter in Schwarzweiß realisiert. Der Frauenfilm gehörte zu den besucherstärksten DEFA-Filmen in der DDR und erhielt zahlreiche Auszeichnungen.\r\n\r\n\r\nHandlung\r\n\r\nInge Herold ist Ende 30, geschieden und arbeitet als Psychologin bei der Fürsorge. Sie lebt mit ihrem 15-jährigen Sohn Mike zusammen und hat ein Verhältnis mit dem verheirateten Joachim, der von Mike abgelehnt wird.\r\n\r\nEines Tages entdeckt Inge in ihrer Brust ein Knötchen. Es erfolgt eine Erstuntersuchung. Wenig später erhält Inge auf Arbeit einen Anruf, dass sie in die Klinik kommen muss. Hier erfährt sie, dass die Geschwulst am nächsten Tag operativ entfernt werden soll. Erweist sie sich als gutartig, ist die Behandlung damit abgeschlossen. Stellt sich jedoch heraus, dass der Krebs bösartig ist, würde Inge die Brust amputiert werden. Inge ist zunächst verzweifelt, fängt sich jedoch. Sie sucht Joachim auf Arbeit auf und bittet ihn, abends vorbeizukommen. Zu Hause trifft sie auf Mike, der zahlreiche Freunde in seinem Zimmer hat und laut Musik hört. Inge wirft die Freunde raus und stellt die Musik ab. Als Mike sie kritisiert, ohrfeigt sie ihn. Mike geht.\r\n\r\nInge sucht ihre Mutter auf. Das Verhältnis ist distanziert, beide haben sich nicht viel zu sagen. Als Inge andeutet, am nächsten Tag ins Krankenhaus zu müssen, glaubt ihre Mutter, Inge sei schwanger. Inge bittet sie, während ihrer Zeit im Krankenhaus auf Mike aufzupassen. Sie geht und sagt ihr nur, dass sie nicht schwanger ist. Selbst das Krankenhaus nennt sie nicht, will sie doch von ihrer Mutter nicht besucht werden. Inge vertreibt sich die Zeit in einem Café und sucht schließlich Richterin Katharina Weber auf, mit der sie in dieselbe Abiturklasse gegangen ist. Katharina hat einen geradlinigen Weg hinter sich. Sie ist erfolgreich im Beruf, teilt sich mit ihrem Mann in die Hausarbeit, hat zwei Kinder und ein Auto. Inge schlägt vor, ein Klassentreffen zu veranstalten und Katharina verspricht zu kommen, wenn sie Zeit findet. Sie gibt Inge die Adresse von Dieter Schramm, der Inges Jugendliebe war und mit dem beide ebenfalls in einer Klasse waren.\r\n\r\nAm späten Nachmittag trifft sich Inge mit Brigitte. Katharina hatte einst den Kontakt zu Brigitte abgebrochen, nachdem deren Eltern in den Westen geflüchtet waren. Inge ist jedoch immer noch mit ihr befreundet. Brigitte lebt allein, ist beruflich erfolgreich und verdrängt Gedanken über ihr Leben im Alter. Sie kann sich nicht mehr vorstellen, mit jemandem zusammen zu leben. Beide begeben sich in eine Theaterkantine und reden über ihr Leben. Brigitte meint, solange sie nicht krank werde, könne sie weiter so leben wie bisher. Erst jetzt gesteht ihr Inge, dass sie ins Krankenhaus muss. Bevor die Situation sentimental wird, verabschiedet sich Inge, und Brigitte verspricht, sie anzurufen. Inge sucht nun Dieter Schramm auf, der nach einer Weile mit seiner kleinen Tochter Susanne nach Hause kommt. Er ist seit kurzer Zeit geschieden und freut sich, Inge wiederzusehen. Sie schlägt ihm das Klassentreffen vor, wolle sie doch sehen, was andere aus sich und ihrem Leben gemacht haben. Von ihrer Krankheit verrät sie ihm nichts, fragt jedoch, was er tun würde, wenn er nur noch kurz zu leben hätte. Er gibt zu, dass er sich an das Leben klammern würde, denn nur Menschen, die glücklich gelebt hätten, seien bereit, früh zu sterben. Sie gibt zu, in ihrem Leben zu wenig Quatsch gemacht zu haben.\r\n\r\nZu Hause bereitet Inge ein Festessen für ihren Sohn und Joachim vor. Sie schminkt sich stark, verkleidet sich ein wenig und wartet lange Zeit vergeblich. Mike kommt heim und Inge erkennt, dass er verliebt ist. Sie freut sich für ihn und eröffnet ihm nebenbei, dass sie eine Woche lang im Krankenhaus sein werde. Es sei jedoch nichts Ernstes. Mike merkt, dass sie auf Joachim wartet und schlägt vor, ihn anzurufen. Inge lehnt jedoch ab. Sie wartet die ganze Nacht vergeblich auf ihn. Er erscheint am frühen Morgen, kurz vor Arbeitsbeginn und eine Stunde, bevor Inge ins Krankenhaus muss. Er gibt zu, am Abend auf einer Feier gewesen zu sein und nicht eher weggekonnt zu haben. Sie eröffnet ihm, dass sie in Kürze ins Krankenhaus muss. Er soll sie begleiten, da die Ärzte nur der Begleitperson die Wahrheit über ihren Gesundheitszustand sagen würden.\r\n\r\nEinige Zeit später ist die Behandlung vorbei. Inge muss nur noch in größeren Abständen zu Nachuntersuchungen, hat jedoch stets Bedenken vor dem Ergebnis. Sie lebt inzwischen mit Dieter Schramm zusammen, der ihr die Angst vor den Nachuntersuchungen nimmt. Als sie mal wieder ins Krankenhaus muss, verspricht er, sie anschließend abzuholen","torrent":{"xt":"urn:btih:e854b9810fc05df8ecc1a5ecab5c378566898b5e","amp;dn":"Die+Beunruhigung+%5BDEFA+1982%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e854b9810fc05df8ecc1a5ecab5c378566898b5e","infoHashBuffer":{"type":"Buffer","data":[232,84,185,129,15,192,93,248,236,193,165,236,171,92,55,133,102,137,139,94]},"announce":[],"urlList":[]}}