{"title":"Paper Bubble - Scenery 1969 (2008) (Flac)","uid":10069292,"size":300563685,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e8b49693b867466aab4e8fbe3598570d82b6c217&amp;dn=Paper+Bubble+-+Scenery+1969+%282008%29+%28Flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":null,"files":-1,"time":1398827651,"description":"eac secure cue log scans\n\nPaper Bubble - Scenery [1969]\n2008 - RPM / RETRO831 / CD\n\n01. Paper Bubble - Fillin' a Gap\n02. Paper Bubble - Being Human Being\n03. Paper Bubble - She\n04. Paper Bubble - I'm Laughing\n05. Paper Bubble - Just an Actor\n06. Paper Bubble - Energy\n07. Paper Bubble - Scenery\n08. Paper Bubble - MM of LA\n09. Paper Bubble - Silly Bit of Sentiment\n10. Paper Bubble - Mother Mother Mother\n11. Paper Bubble - Tomorrow Never Comes Likes a Silver Spoon\n\nThis quite obscure British pop-folk-rock effort might hold some interest for intense fans of British folk-rock of the late 1960s and early '70s, if only because it was produced by two members of one of the major bands in that genre (Dave Cousins and Tony Hooper of the Strawbs). Compared to the Strawbs, however -- and, for that matter, most British folk-rock acts -- Paper Bubble were far more lightweight. Emphasizing the close, merry harmonies of guitarists Terry Brake and Brian Crane, many of the tracks have a bouncy, singalong feel that's too happy-go-lucky, in fact, if you're in the wrong mood, though there are occasional breaks into more wistful numbers. Though bassist Neil Mitchell was the only other member of the group, the sound is thickened with some piano, light orchestration, and vague psychedelic textures. Like much American sunshine pop of the period, however, it has an upbeat vibe that verges on the sappy at times, even if this particular record isn't too strongly related to the sunshine pop style, with an innocent childlike escapist quality found in much British psychedelia of the time. And like many such efforts, it has pleasant surface qualities, but lacks memorable depth or truly standout compositions. In this context, the least characteristic track, &quot;Mother Mother Mother,&quot; rocks like the devil, with berserk organ breaks, effective distorted electric guitar licks, a hard cheery folk-rockin' verve absolutely missing from the rest of the LP. It's the standout number on the record -- and was, in fact, anthologized in 1983 on the Broken Dreams, Vol. 3 compilation of psychedelic British rock rarities -- but, unfortunately, was the only hint of such brazen energy Paper Bubble ever displayed.","torrent":{"xt":"urn:btih:e8b49693b867466aab4e8fbe3598570d82b6c217","amp;dn":"Paper+Bubble+-+Scenery+1969+%282008%29+%28Flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8b49693b867466aab4e8fbe3598570d82b6c217","infoHashBuffer":{"type":"Buffer","data":[232,180,150,147,184,103,70,106,171,78,143,190,53,152,87,13,130,182,194,23]},"announce":[],"urlList":[]}}