{"title":"Bach Unaccompanied Sonatas for Violin - Jascha Heifetz","uid":7572266,"size":68263424,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e90961bc14392cc12ad14fce2577a7469850070d&amp;dn=Bach+Unaccompanied+Sonatas+for+Violin+-+Jascha+Heifetz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eixman","files":12,"time":1346020621,"description":"This Heifetz performance of the &quot;Sonatas for Unccompanied Violin&quot; by J.S. Bach can hardly be surpassed by any other violinist(as brilliant as he might be) because Heifetz was a perfectionist and possessed an outstanding control of the instrument what enabled him to play these pieces not only faithfully to the metronome but also displaying a show of interpretation, as far as allowable by works of this kind.The masterful &quot;cleanness&quot; of the playing give us the impression of hearing several &quot;voices&quot;, it is, not only just one violin but two, three, four all playing together and separately! For the ensemble of his work, always performed with the highest degree of professionalism, perfectionism and passion, Jascha Heifetz(1901-1987) is considered by many to be the supreme violinists of the 20th century.\n\n\nTrack Listing\n\n1. Sonata No. 1, BWV 1001, in G Minor: Adagio\n2. Sonata No. 1, BWV 1001, in G Minor: Fugue: Allegro\n3. Sonata No. 1, BWV 1001, in G Minor: Siciliano\n4. Sonata No. 1, BWV 1001, in G Minor: Presto \n5. Sonata No. 2, BWV 1003, in A Minor: Grave\n6. Sonata No. 2, BWV 1003, in A Minor: Fugue\n7. Sonata No. 2, BWV 1003, in A Minor: Andante\n8. Sonata No. 2, BWV 1003, in A Minor: Allegro\n9. Sonata No. 3, BWV 1005, in C: Adagio\n10. Sonata No. 3, BWV 1005, in C: Fugue: Alla breve\n11. Sonata No. 3, BWV 1005, in C: Largo\t\n12. Sonata No. 3, BWV 1005, in C: Allegro assai\n\n\n\n--eixman","torrent":{"xt":"urn:btih:e90961bc14392cc12ad14fce2577a7469850070d","amp;dn":"Bach+Unaccompanied+Sonatas+for+Violin+-+Jascha+Heifetz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e90961bc14392cc12ad14fce2577a7469850070d","infoHashBuffer":{"type":"Buffer","data":[233,9,97,188,20,57,44,193,42,209,79,206,37,119,167,70,152,80,7,13]},"announce":[],"urlList":[]}}