{"title":"Heroes of the East [Heavydiamond][Retail]","uid":6406189,"size":4179889934,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e9323c088e7d882fa7a3836a8429f36464f09d1d&amp;dn=Heroes+of+the+East+%5BHeavydiamond%5D%5BRetail%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"heavydiamond","files":-1,"time":1305814804,"description":"Heroes of the East [Heavydiamond][Retail]\n\nmenu's n extras\n\n\n\nAh To (played by Gordon Liu) is a Kung Fu student. His rich father has set up an arranged marriage for him with the daughter of a Japanese business associate. Ah To initially objects and feigns illness, but soon thereafter agrees to the marriage when he finds bride to be, Yumiko Koda (&quot;Kung Zi&quot; in Mandarin), is attractive. After the wedding, he finds out that she is also a martial artist. Ah To finds her style of karate to be violent, unladylike, and potentially immodest and tries to persuade her to learn feminine but also effectual styles of Chinese kung-fu. She is later offended during an argument over which nation has the superior martial arts styles and eventually leaves to Japan. When he travels to Japan to entreat Kung Zi to be reconciled with her husband, Ah To's father finds Kung Zi in training by her childhood friend and rather too attentive martial arts sensei Takeno.\nAs a ruse to bring her back to China, Ah To sends her a letter challenging Japanese martial arts and their inferiority to their Chinese roots. Ah To hopes that the letter will infuriate Kung Zi enough to return to prove that her Japanese styles are as good as the Chinese ones. Once back in China, Ah To hopes to reconcile with her. But the plan backfires when Takeno reads the letter instead of Kung Zi. Takeno reads the challenge as an affront to Japanese martial arts and declares its contents with other Japanese martial-arts masters who travels to China to take up Ah To's challenge.\nIn the first duel, Ah To misinterprets a respectful gesture from the Japanese fighter and thus further antagonizes the Japanese contingent. Due to this cultural misunderstanding, the Japanese no longer treat the subsequent duels as exhibitions of their styles but rather as an all-out fights. Kung Zi, seeing the gravity of the situation, helps out Ah To by warning him of Takeno's mastery of ninjutsu.\n\nPlease seed 4 others as long as u can, enjoy this cracking movie on of my favorites","torrent":{"xt":"urn:btih:e9323c088e7d882fa7a3836a8429f36464f09d1d","amp;dn":"Heroes+of+the+East+%5BHeavydiamond%5D%5BRetail%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9323c088e7d882fa7a3836a8429f36464f09d1d","infoHashBuffer":{"type":"Buffer","data":[233,50,60,8,142,125,136,47,167,163,131,106,132,41,243,100,100,240,157,29]},"announce":[],"urlList":[]}}