{"title":"Futanari Insanity Part 6 - Futa Manga","uid":5363499,"size":809646268,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:ecbac2c68214c870dc05d2bc2fc097ac613bc5e2&amp;dn=Futanari+Insanity+Part+6+-+Futa+Manga&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"JessterKing654","files":75,"time":1266184250,"description":"Futanari Insanity Part 6 - Futa Manga | From Pr0n_Glutton/black_dragon\nPossibly Hosted by others on various trackers.\n\n*NEW* OPTIONAL: In the creation of this torrent, I realized that I skipped a folder I was actually planning to be part 6. That folder was supposed to be the last of category futa. Since this is a completely new main folder of my futa collection, this DOES NOT go into the &quot;Category Futa&quot; folder as my last optional instructions mentioned. When you're done with this torrent, move the &quot;Manga&quot; folder into the same root as your Category Futa folder. Again, this is optional, but organizing hentai early is better than slapping a bunch of the same pics in one folder.\n\nThe funny thing is, despite the thousands, perhaps millions of independent futanari pictures out there, I think the futanari mangas/doujins may actually trump their file size. I only had a few manga (compared to most manga collectors&quot; and my collection was alread about 3-500MB's. After grabbing all Misty Moon Metropolis Manga I could find as well as a few from RaTe, it jumped to over 700MB. Still, this means I can smoothly transition into bigger file sizes with my parts (instead of instantly jumping to 1.2GB as planned)\n\nThe following list show what sub-folders are available for this part. This torrent is actually an Improved version of what I have so if you're copying my optional instructions, it will be different (but I will copy/paste this torrent back to my original folders)\nFanatic Fetish - Not necessarily a manga. At one point I thought it was because of the paragraph sized writing on each picture. I believe this collection is complete.\nFutanari Palace - a couple manga's from FP members. These aren't the best one there, just ones I happened to download at one time. (search for Linty @ Futanari Palace)\nJapanese - I assume most collectors actually have a folder for manga that is translated instead of untranslated, as they expect most of it to be Japanese and can probably read it to. I don't like to bother too much with untranslated manga (unless it has good pics) which is why I have this folder. Misty Moon Metropolis is in this folder\nRaTe - This artist (I think) makes some pretty good ones. I didn't actually have any futa manga from him (I think I have non-futa ones) and I just got these for the torrent. I could have got more, but I would be spending a long time downloading all of them, and then completing other collections. Soon the size would be tons of gigs.\nThe Amanoja 9 - Perhaps my favorite Manga artist. Does the excellent &quot;TS I Love you&quot; manga which are often about men falling in love with transexuals. The translation seems to state that these &quot;futanari&quot; are actually men transitioned into pre-op shemales (Full cock and balls). This may put you off, but the &quot;she was a man&quot; fetish isn't the focus of this series. Just excellent sex scenes including plenty of frottage in some chapters. The naming of some parts can be confusing and you may find a handful of duplicate chapters in this folder.\nVarious - Various translated manga with series/artist's I've never completed.\n\nIf you want more Manga G.E-Hentai.org is a excellent place to start. Futanari Palace also has a massive Doujin Library for Futa. You can complete the RaTe, Bankanyu Fullnerson and other collections at these places. You may also want to look for &quot;futabu vol 3&quot; which was removed because it might be against some tracker rules. Find it yourself.\n\nI've stated my torrents will gradually be bigger, and the next part should be 1.2GBs unless I break it up. Leave a comment if you're ok with that. I hope you enjoy this and be sure to leave feedback (Comments, Votes, Ratings Thanks, Seeds)","torrent":{"xt":"urn:btih:ecbac2c68214c870dc05d2bc2fc097ac613bc5e2","amp;dn":"Futanari+Insanity+Part+6+-+Futa+Manga","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecbac2c68214c870dc05d2bc2fc097ac613bc5e2","infoHashBuffer":{"type":"Buffer","data":[236,186,194,198,130,20,200,112,220,5,210,188,47,192,151,172,97,59,197,226]},"announce":[],"urlList":[]}}