{"title":"Grateful Dead - Dick's Picks Vol 12 1974-06-26,28 [FLAC]","uid":10854441,"size":1145861240,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ed38bace516e059b522ee728f66392ee4cbb5211&amp;dn=Grateful+Dead+-+Dick%27s+Picks+Vol+12+1974-06-26%2C28+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":43,"time":1408830557,"description":" Review by William Ruhlmann  [-]\n\nNominally speaking, the Grateful Dead were promoting their new album, Grateful Dead From the Mars Hotel, on their summer 1974 tour; in fact, the album was released on the day off between the two concerts in Providence and Boston excerpted on this disc. But being the Grateful Dead, they were not so much interested in doing that (though one can hear versions of the album cuts &quot;U.S. Blues,&quot; &quot;Scarlet Begonias,&quot; and &quot;Ship of Fools&quot; here) than in continuing to explore music from their previous album, Wake of the Flood, which, after all, they'd only released eight months before. If ever the old saw about learning the material on the road after recording it was appropriate, it is so on this triple-CD set, notably on an elaboration of Wake's &quot;Weather Report Suite,&quot; which takes up the first 55 minutes of the third disc. It is precisely this performance that makes the 12th volume of Dick's Picks valuable to Deadheads who have had to live all these years with tapes of the performance that were interrupted 45 minutes in! Tape archivist Dick Latvala and company have gradually taken more editorial liberties with their choices in the series, and volume 12 is a good example of this. It starts with the third song of the second set from June 26, 1974, at the Providence Civic and continues to the end of the set on CD one, featuring an extended version of &quot;Truckin'&quot; and a particularly rambunctious &quot;Sugar Magnolia.&quot; CD two begins with the June 26 encore, &quot;Eyes of the World&quot; (another extended version of a Wake of the Flood track), then picks up with the second set from June 28, 1974, at Boston Garden, starting with Dead bassist Phil Lesh and partner Ned Lagin performing their electronic music piece &quot;Seastones&quot; (later spun off into a full-length album). The rest of CD two and all of CD three present the entire June 28 second set. What, you may ask, was wrong with the first sets? Nothing, but it was the second sets on both nights that fans remember best, and so Latvala, instead of choosing between two well-regarded shows, has given listeners the best of both. (By the way, the two missing songs from the start of the second set on June 26 are &quot;U.S. Blues&quot; and &quot;Me &amp; My Uncle,&quot; both of which were performed in the second set on June 28, so their omission just avoids repetition.)\n","torrent":{"xt":"urn:btih:ed38bace516e059b522ee728f66392ee4cbb5211","amp;dn":"Grateful+Dead+-+Dick%27s+Picks+Vol+12+1974-06-26%2C28+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed38bace516e059b522ee728f66392ee4cbb5211","infoHashBuffer":{"type":"Buffer","data":[237,56,186,206,81,110,5,155,82,46,231,40,246,99,146,238,76,187,82,17]},"announce":[],"urlList":[]}}