{"title":"Polar Bear - Spy on the Ice   (BBC 2010)","uid":6075943,"size":733384200,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ed57e8d4ab079f09380f58da4ffdb53d23caab94&amp;dn=Polar+Bear+-+Spy+on+the+Ice+++%28BBC+2010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucy1948","files":1,"time":1293843825,"description":"Nature Documentary hosted by David Tennent, published by BBC in 2010 - English narration\n\n\n\nInformation\n------------------------------\n\nPolar Bear: Spy on the Ice\n\nShot mainly using spy cameras, this film gets closer than ever before to the world's greatest land predator.\n\nIcebergcam, Blizzardcam and Snowballcam are a new generation of covert devices on a mission to explore the Arctic islands of Svalbard in Norway. Backed up by Snowcam and Driftcam, these state-of-the-art camouflaged cameras reveal the extraordinary curiosity and intelligence of the polar bear. The cameras are just a breath away when two sets of cubs emerge from winter maternity dens. They also capture the moment when the sea-ice breaks away from the island in the Spring. As one set of mother and cubs journey across the drifting ice in search of seals, the other is marooned on the island with very little food. How they cope with their different fates is captured in revelatory close-up detail. The cameras also follow the bears as they hunt seals, raid bird colonies, dive for kelp and indulge in entertaining courtship rituals. Icebergcam even discovers their little-known social nature as seven bears share a washed-up whale carcass. Often just a paw's swipe from the play-fighting and squabbling bears, the spy cameras face their most challenging subject yet. When their curious subjects discover the cameras, they are subjected to some comical-but-destructive encounters.\n\nAs the film captures its intimate portrait of polar bears' lives, it reveals how their intelligence and curiosity help them cope in a world of shrinking ice.","torrent":{"xt":"urn:btih:ed57e8d4ab079f09380f58da4ffdb53d23caab94","amp;dn":"Polar+Bear+-+Spy+on+the+Ice+++%28BBC+2010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed57e8d4ab079f09380f58da4ffdb53d23caab94","infoHashBuffer":{"type":"Buffer","data":[237,87,232,212,171,7,159,9,56,15,88,218,79,253,181,61,35,202,171,148]},"announce":[],"urlList":[]}}