{"title":"Cum Swallowing Auditions Vol. 18 (2015) [DvdRip].mp4","uid":11695152,"size":1401316629,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:edc9ef290d5c866d54589da835469397b951e07f&amp;dn=Cum+Swallowing+Auditions+Vol.+18+%282015%29+%5BDvdRip%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Artrage","files":1,"time":1423678774,"description":"\nCum Swallowing Auditions Vol. 18 (2015) [DvdRip].mp4\n\n\nPosters and Screenshots\n\n\n\nCast\n\nJessie Andrews, Lucy Tyler, Lola Foxx, Ava Taylor, Samantha, Tabetha\n\n\nDescription\n\n&quot;Where Nice Girls Come To Swallow Cum!Tabetha is here to start some trouble. This little darling really knows how to fuck and suck. She takes a nice shot glass full of cum and swallows it down! The fun starts here!Her name is Jessie Andrews and she is only 18 years old and from Miami, Florida. She is an absolutely stunning five foot, nine inch blonde bombshell and she totally loves swallowing cum. Jessie sucks Ray off like a pro and swallows two big loads in her Amateur Allure debut!Samantha is 20 years old and is one hot little lady. This college cutie is also an Amateur Allure member and has been for about 6 months. She asked if she could come down and show me exactly what she can do. Turns out, she gives pretty good head. So I had her swallow two loads!Lola Foxx wastes no time getting down on her knees for another couple of loads. Ray gives it to her good. Lola sucks &amp; deep throats his thick cock, then bounces her tasty round ass on it before jerking and sucking his cum all over her tongue. What a hot little girl!Ray &amp; Lucy Tyler take on beautiful bubble-butt teen Ava Taylor! The girls jump down and give Ray an amazing double blowjob. Ava jerks &amp; sucks out a huge load and gets her pretty mouth FILLED with cum. Next, the girls get busy fucking and Ray gives Ava a second load on her sweet shaved pussy!&quot;\n\n\nTags \n\nHardcore, XxX, Hot, Blowjob, POV, Facial, Cumshot, Feature\n\n\nResolution  \n\n720x400\n\n\nDuration  \n\t\n01:44:21\n\n\nSize      \n\n1.31 GB","torrent":{"xt":"urn:btih:edc9ef290d5c866d54589da835469397b951e07f","amp;dn":"Cum+Swallowing+Auditions+Vol.+18+%282015%29+%5BDvdRip%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edc9ef290d5c866d54589da835469397b951e07f","infoHashBuffer":{"type":"Buffer","data":[237,201,239,41,13,92,134,109,84,88,157,168,53,70,147,151,185,81,224,127]},"announce":[],"urlList":[]}}