{"title":"Osho - I Leave_You_My_Dream.mpg","uid":14015531,"size":308227292,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ef0ec02073748c7046d681ec581504b41cd47283&amp;dn=Osho+-+I+Leave_You_My_Dream.mpg&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1458861803,"description":"On January 19, 1990 ,Amrito, Osho's personal physician, announced that Osho left his body at 5.00 PM.  \r\n\r\nOSHO : I LEAVE YOU MY DREAM\r\nTHE EVENING AFTER OSHO LEFT HIS BODY, SWAMI AMRITO ADDRESSED THE WHITE ROBE BROTHERHOOD AND MOVINGLY DESCRIBED OSHO'S LAST MOMENTS, INCLUDING HIS LAST MESSAGES TO HIS PEOPLE. \r\nTHE COMPLETE TEXT FOLLOWS: \r\nAS YOU KNOW, over these last few days Osho's body has been becoming noticeably weaker. What you may not know is that He has also been in considerable pain. By the night of the 18th, the pain in His legs was so severe that He was not able even to come stand on the podium and be with us. \r\nOver that night He became weaker and weaker. Every movement of the body was obviously agonizing. Yesterday morning I noticed that His pulse was also weak and slightly irregular. \r\nI said I thought He was dying. He nodded. I asked Him if we could call in the cardiologists and prepare for cardiac resuscitation. He said, &quot;No, just let me go. Existence decides its timing.&quot; \r\nI was helping him to the bathroom when he said, &quot;And you put wall-to--wall carpet in here, just like this bath mat.&quot; Then He in-sisted on walking over to His chair. He sat down and made arrangements for the few items that He has in His room. \r\n'Who should this go to?&quot; He said, pointing to His small stereo. It is audio? Nirupa would like it?&quot; He asked. Nirupa has cleaned His room for so many years. \r\nAnd then He went carefully around the room and left instructions for every item. &quot;Those you take out,&quot; He said, pointing to the dehumidifiers which he had found too noisy recently. And always make sure one air conditioner is on,&quot; He continued.\r\nIt was incredible. Very simply, in a very matter-of-fact and precise way, He looked at everything. He was so relaxed, as if He were going for the weekend.\r\nHe sat on the bed and I asked what we should do for His Samadhi. &quot;You just put my ashes in Chuang Tzu, under the bed. And then people can come in and meditate there.&quot;\r\n&quot;And what about this room?&quot; I asked. \r\n&quot;This would be good for the Samadhi?&quot; He asked. \r\n&quot;No,&quot; I said, &quot;Chuang Tzu will be beautiful.&quot;\r\nI said we would like to keep His present bedroom as it is. &quot;So you make it nice,&quot; He said. And then He said He would like it marbled.\r\n&quot;And what about the celebration?&quot; I asked. \r\n&quot;Just take me to Buddha Hall for ten minutes,&quot; He said, &quot;and then take me to the burning ghats -and put my hat and socks on me before you take my body.&quot; \r\nI asked Him what I should say to you all. He said to tell you that since His days in the marshal's cell in Charlotte, North Carolina, in America, His body has been deteriorating. He said that in the Oklahoma jail they poisoned Him with thallium and exposed Him to radiation, which we only came to know when the medical experts were consulted. \r\nHe said they had poisoned Him in such a way that would leave no proof &quot;My crippled body is the work of the Christian fundamentalists in the United States government.&quot; He said that He had kept His pain to Himself, but &quot;living in this body has become a hell.&quot; \r\nHe lay down and rested again. I went and told Jayesh what was happening and that Osho was obviously leaving His body. \r\nWhen Osho called again, I told Him Jayesh was here and He said for Jayesh to come in. We sat on the bed and Osho gave us His final words. \r\n&quot;Never speak of me in the past tense,&quot; He said. &quot;My presence here will be many times greater without the burden of my tortured body. Remind my people that they will feel much more they will know mmediately.&quot; \r\nAt one point I was holding His hand and I started to cry. He looked at me, almost sternly, &quot;No, no,&quot; He said, &quot;that is not the way.&quot; I immediately stopped and He just smiled beautifully. \r\nOsho then spoke to Jayesh and talked about how He wanted the expansion of the work to continue. He said that now that He was leaving His body, many more people would come; many more people's interest would show, and His Work would expand incredibly beyond our ideas. \r\n[In a separate press statement Amrito said, &quot;It was clear to Him that not having the burden of His body would actually help His work to flourish.&quot;]\r\n'Then He said, I leave you my dream.&quot; \r\nThen He whispered so quietly that Jayesh had to put his ear very close to Him, and Osho said, &quot;And remember,, Anando is my messenger.&quot; Then He paused, and said, &quot;No, Anando will be my medium.&quot; \r\nAt that point Jayesh moved to one side, and Osho said to me, &quot;'Medium will be the right word?&quot;I hadn't heard what had preceded it so I didn't understand. \r\n&quot;Meeting?&quot; I said.\r\n&quot;No,&quot; He replied, &quot;for Anando, medium - she will be my medium.&quot; \r\nHe lay back quietly and we sat with Him while I held His pulse. Slowly it faded. When I could hardly feel it, I said, &quot;Osho, I think this is it.&quot; \r\nHe just nodded gently, and closed His eyes for the last time. \r\n[A separate press release from Osho Commune International stated: &quot;Osho left His body at 5:00 pm. An Indian physician, Dr. Gokul Gokhani, gave the clinical cause of death as heart disease.&quot;]","torrent":{"xt":"urn:btih:ef0ec02073748c7046d681ec581504b41cd47283","amp;dn":"Osho+-+I+Leave_You_My_Dream.mpg","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef0ec02073748c7046d681ec581504b41cd47283","infoHashBuffer":{"type":"Buffer","data":[239,14,192,32,115,116,140,112,70,214,129,236,88,21,4,180,28,212,114,131]},"announce":[],"urlList":[]}}