{"title":"Ben Aaronovitch - Moon Over Soho (Peter Grant #2)","uid":12340782,"size":433731403,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ef65420fc27cc9a7467066aab7e2628830a74164&amp;dn=Ben+Aaronovitch+-+Moon+Over+Soho+%28Peter+Grant+%232%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":14,"time":1441295943,"description":"I was my dad's vinyl-wallah: I changed his records while he lounged around drinking tea, and that's how I know my Argo from my Tempo. And it's why, when Dr Walid called me to the morgue to listen to a corpse, I recognised the tune it was playing. Something violently supernatural had happened to the victim, strong enough to leave its imprint like a wax cylinder recording. Cyrus Wilkinson, part-time jazz saxophonist and full-time accountant, had apparently dropped dead of a heart attack just after finishing a gig in a Soho jazz club. He wasn't the first. No one was going to let me exhume corpses to see if they were playing my tune, so it was back to old-fashioned legwork, starting in Soho, the heart of the scene. I didn't trust the lovely Simone, Cyrus' ex-lover, professional jazz kitten and as inviting as a Rubens' portrait, but I needed her help: there were monsters stalking Soho, creatures feeding off that special gift that separates the great musician from someone who can raise a decent tune. What they take is beauty. What they leave behind is sickness, failure and broken lives. And as I hunted them, my investigation got tangled up in another story: a brilliant trumpet player, Richard 'Lord' Grant - my father - who managed to destroy his own career, twice. That's the thing about policing: most of the time you're doing it to maintain public order. Occasionally you're doing it for justice. And maybe once in a career, you're doing it for revenge. \n\n\n\nRead by Kobna Holdbrook-Smith\nFormat: MP3\nBitrate: 96 Kbps\nUnabridged","torrent":{"xt":"urn:btih:ef65420fc27cc9a7467066aab7e2628830a74164","amp;dn":"Ben+Aaronovitch+-+Moon+Over+Soho+%28Peter+Grant+%232%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef65420fc27cc9a7467066aab7e2628830a74164","infoHashBuffer":{"type":"Buffer","data":[239,101,66,15,194,124,201,167,70,112,102,170,183,226,98,136,48,167,65,100]},"announce":[],"urlList":[]}}