{"title":"Geraldo Pino - Heavy Heavy Heavy [FLAC] TQMP","uid":6339373,"size":430843742,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f03b5854e210c73ae285f37fdc475b0c290f12a8&amp;dn=Geraldo+Pino+-+Heavy+Heavy+Heavy+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pastafari","files":-1,"time":1303589907,"description":"Geraldo Pino &amp; The Heartbeats - Heavy Heavy Heavy\n2005\n\nGeraldo Pino blew Fela Kuti away. Now, what else do you need in someone's resume? I'd leave it at that. Go ahead, download this and have some funk. Heavy heavy heavy!\n\nAnd if you haven't heard Fela Kuti do yourself a favor and get anything from the man. I'd start with Zombie. But that's just me.\n\n* * * * * * * * * * * * * * * * * * *\n\nGeraldo Pino (aka Gerald Pine) is one of the hidden heroes of African popular music. A singer, guitarist and band leader from Sierra Leone, Geraldo had a major influence on the burgeoning soul/funk/Afrobeat scene in West Africa during the 1960s and 70s. He made a huge impression on the young Fela Kuti who praised him effusively but his music has remained largely unheard for the past 30 years.\n \nGerald Pine formed the Heartbeats in Freetown in 1960/61 as a pop band playing cover versions of British and American hit songs, although they soon adapted to the influence of pachanga, tcha tcha tcha and rumba music from the Congo, notably that international blend supplied by Ryco Jazz (see RETRO 10CD) who were touring the West Africa region. As the latin influences grew, so Gerald Pine evolved into the more exotic sounding Geraldo Pino, although it was as a champion of American style funk that he made his mark. He first recorded the influential Power To The People in 1962. \n\nAs Pino started to get bookings in Freetown nightclubs such as Flamingo, Palm Beach and Tiwana he was able to give up his work as a radio technician. Among the original Heartbeats' musicians were Dr Dynamite on guitar, bassist George Keister, co-singer Hassan Deen and drummer Francis Fuster. But in 1963 their progress was brought to a halt by a car crash which left some band members hospitalised. Dynamite was later replaced by Arnold Nylander who, along with Fuster, composed and arranged many numbers. \n\n'When he toured Ghana and Nigeria in 1966 and 67, Pino made a deep and lasting impression on that iconoclastic figure who went on to dominate anglophone African music for decades - Fela Anikulapo Kuti (then still known by his family name of Ransome Kuti). As Fela told the author Carlos Moore in his 1982 biography (*)\n\n&quot;I was playing high life jazz when Geraldo Pino came to town in '66 or a bit earlier with soul. That's what upset everything, man. He came to town with James Brown's music, singing, &quot;Hey, hey, I feel all right, ta, ta, ta, tao .. &quot; And with such equipment you've never seen, man. This man was tearing Lagos to pieces. Wooooooooh, man. He had all Nigeria in his pocket. Made me fall right on my ass, man. Ahhhhhh, this Sierra Leonean guy was too much. Geraldo Pino from Sierra Leone. I'll never forget him. I never heard this kind of music before-o. I'm telling you. Only when I went to Ghana shortly after that did I hear music like that again, soul music. Shit! If you could have seen him, man. And his equipment... something else!\n\n&quot;When that guy Pino came to Lagos in '66, he came in a big way: in a convertible Pontiac; you know, one of those big American cars, man. Flashy, new equipment. Lots of bread. He was doing his thing, man. He had everything I didn't have. He did a three-day show in Lagos. Then he went up country to the North for a month, then came back to Lagos again for five days. After that he was to go back to Ghana. What worried me was that he was going to come back again to Nigeria. I had seen the impact this motherfucker had in Lagos. He had everyone in his pocket! That was my mind, you know. I wanted to split town, leave, disappear. Go far away. To America. Find my own way, in any case. Make it myself. 'Cause I saw I couldn't make it with this man around, even in Nigeria. In '67 he came back to Nigeria for a tour, then split back to Ghana. Ouuuuf!\n\n&quot;After that motherfucking Pino tore up the scene, there wasn't shit I could do in Lagos. So I went to Ghana in '67 ... At that time that's where the action and the bread was. So, we went to Ghana. And one day in Accra we entered this club, Ringway Hotel. The place was packed, man! Geraldo Pino was playing there. Oohhhhh, come and hear this music-o! See this guy's equipment! I'd never seen such equipment before. In Lagos, I was using this old equipment ... museum antiques, man. I had only one microphone for the whole band. One microphone! This motherfucking Pino had six. The whole place was jumping. The music carried me away completely. To me, it was really swinging music. I say, &quot;Look the drummer, how he plays drums!&quot; Ohhhhh, \n\nI say, &quot;Whaaaaat?This is heavy-or' I was saying to myself, &quot;I need equipment like this man!&quot; Oooooooo, I was enjoying the music! Can you understand my situation at that club that night? Needing to find a job for myself, but enjoying the music so much I even forgot I myself was a fucking musician. I was there digging the music, thinking about all that. Finally, I did get my own job at a club in Ghana. I stayed there for a year. That was in '67. After seeing this Pino, I knew I had to get my shit together. And quick!&quot;\n\nAfter the break up of the original Heartbeats, Pino recruited a line-up of Ghanaians from a psychedelic band called the Plastic Jams, a tight, efficient unit who backed him splendidly. His squad of musicians in the late 1960s and early 70s included Anext, bass; Owusu, keyboards; Eddy Polo, lead guitar; Billy, drummerl vocalist; Anta, rhythm guitarl vocalist. As per usual, the bandleader Geraldo Pino provided lead vocals and guitar. \n\nPino's music echoed the cultural preoccupations of the time - Black Power, African Unity, Heavy Vibes. In fact, many of the song titles could have come from, or been copied by, the signwriters who emblazoned slogans on the Tro- Tros, or Mammy Wagons which hurtled along the roads of West Africa. Pino's party grooves and the Funk Imperative which underlines his musical philosophy make these dance tracks sound just as vital today as they did back then. \n-- CD liner notes.\n\n(*) Fela, Fela, This Bitch of a Life, by Carlos Moore, 1982.\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n01 - Heavy Heavy Heavy\n02 - Let Them Talk\n03 - Africans Must Unite\n04 - Shake Hands\n05 - Power To The People\n06 - Let's Have A Party\n07 - Born To Be Free\n08 - Man Pass Man, Iron De Cut Iron\n09 - Right In The Centre\n10 - On The Spot\n11 - Black Woman Experience\n12 - Afro Soco Soul Live\n\n* * * * * * * * * * * * * * * * * * *\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f03b5854e210c73ae285f37fdc475b0c290f12a8","amp;dn":"Geraldo+Pino+-+Heavy+Heavy+Heavy+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f03b5854e210c73ae285f37fdc475b0c290f12a8","infoHashBuffer":{"type":"Buffer","data":[240,59,88,84,226,16,199,58,226,133,243,127,220,71,91,12,41,15,18,168]},"announce":[],"urlList":[]}}