{"title":"Police Woman S01Pilot Police Story: The Gamble DVDRip DivX","uid":4340008,"size":419691926,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f08454cce27076afcca9584d802eb62ae6e446ed&amp;dn=Police+Woman+S01Pilot+Police+Story%3A+The+Gamble+DVDRip+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":4,"time":1218542356,"description":"Police Woman\nNBC, 1974 - 1978\nStarring Angie Dickinson\n\nSexy Sgt. Pepper Anderson was an undercover cop in the criminal conspiracy department - vice-squad - of the Los Angeles Police Department. Stories, which were (in the first season, anyway) adult, open minded, and sometimes risque about sex and marriage, realistically depicted the life of a police woman. This was one of the first cop shows on TV to have a female character in the leading role (we Decoy (1957) fans know that Beverly Garland was the first!) and it led the way for leading TV roles for actresses, which at that time were few &amp; far between.\n\nBy all accounts the first season of Police Woman was the best. It was so successful in its first season that during that first Spring and Summer rerun season, the show hit Number One on both the ratings charts and in many countries in which it aired. Pepper Anderson went undercover in stories that had her posing as a prostitute, a gangster&amp;#039;s girlfriend, a teacher, a nurse, a go go dancer, a waitress, and more, showing skin and cleavage when needed for the story line, and using intelligence and wit to catch the bad guys. Political and other pressures caused the show to be more subdued after it&amp;#039;s first season, and it&amp;#039;s generally agreed the quality of the show suffered.\n\nPolice Woman is a spin-off from the popular NBC series called Police Story (1973-1978), and the pilot episode of Police Woman is an episode from Police Story called The Gamble. \n\nS01Pilot Police Story: The Gamble\nFirst aired: 3/26/1974 \nPolice Woman Lisa Beaumont is an undercover vice cop assigned to infiltrate an illegal gambling operation. Joseph Campanella, Ed Bernard, Bert Convy guest star.\n\nCast: Angie Dickinson (Sgt. Leanne &quot;Pepper&quot; Anderson-Lisa Beaumont in this episode), Earl Holliman (Sgt. Bill Crowley), Ed Bernard (Det. Joe Styles), Charles Dierkop (Det. Pete Royster), Val Bisoglio (Lt. Paul Marsh)\n\nGuest cast: Joseph Campanella (Carl Vitalle), Ed Bernard (Det. Joe Styles), Charles Dierkop (Det. Pete Royster), Bert Convy (Lt. Bill Crowley), Angie Dickinson (Lisa Beaumont)\nDVD&gt;DivX/640x480/986kbps/23.976fps/mp3/48KHz/stereo/102Kbps/50min/400Mb","torrent":{"xt":"urn:btih:f08454cce27076afcca9584d802eb62ae6e446ed","amp;dn":"Police+Woman+S01Pilot+Police+Story%3A+The+Gamble+DVDRip+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f08454cce27076afcca9584d802eb62ae6e446ed","infoHashBuffer":{"type":"Buffer","data":[240,132,84,204,226,112,118,175,204,169,88,77,128,46,182,42,230,228,70,237]},"announce":[],"urlList":[]}}