{"title":"Ilsa_Exploitation_Trilogy (xvid110-sickboy88)","uid":3421998,"size":2202298402,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f1498143d5909c9606b50cb40c0b31be085c07f3&amp;dn=Ilsa_Exploitation_Trilogy+%28xvid110-sickboy88%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sickboy88","files":4,"time":1134891088,"description":"Ilsa Exploitation Trilogy (1975-1977)\n\nWant to see jews being tortured, sexual mutilation, and other fun?  If so, you'll have to check out these three great films:\n\n\n1.  Ilsa, She Wolf of the SS (1975)\n\n    IMDB Link: http://www.imdb.com/title/tt0071650/\n\n\n\n2.  Ilsa, Harem Keeper of the Oil Sheiks (1976)\n\n    IMDB Link: http://www.imdb.com/title/tt0074670/\n\n\n\n3.  Ilsa, the Wicked Warden (1977)\n\n    IMDB Link: http://www.imdb.com/title/tt0076112/\n\n\n----\n\nI've seen a few copies of these movies floating around before, but I wasn't happy with the quality.\n\nThe two movies, &quot;Ilsa, Harem Keeper of the Oil Sheiks&quot; and &quot;Ilsa, She Wolf of the SS&quot; are both directed by the same dude, &quot;Don Edmonds&quot;.  The other movie &quot;Ilsa, the Wicked Warden&quot; is directed by exploitation smut master &quot;Jesus Franco&quot;.\n\nIt should be noted, that there is a 4th movie in the series, &quot;Tigress&quot; aka &quot;Ilsa, the Tigress of Siberia&quot; however it is widely considered to be dogshit, and not part of the (unrelated) trilogy.\n\nIt should be noted that in the film &quot;Ilsa, the Wicked Warden&quot; it may appear that the sound is off...IT ISN'T.  The fucking movie is DUBBED.\n\n----\n\nMini Plot:\n\n1.  Ilsa, She Wolf of the SS:\n\nIlsa is an evil Nazi warden at a death camp that conducts &quot;medical experiments&quot;. Ilsa's goal is to prove that woman can withstand more pain and suffering than men and therefore should be allowed to fight on the front lines.\n\n\n2.  Ilsa, Harem Keeper of the Oil Sheiks:\n\nFinding a new employer, and looking not a day older since the end of World War II, Ilsa works for an Arab sheik who enjoys importing females to use as sex slaves. An American millionaire's daughter, a movie star, and an attractive equestrian are among his latest victims.\n\n\n3.  Ilsa, the Wicked Warden:\n\nIlsa, now a vicious warden, runs a mental-hospital for young women. A girl deliberately &quot;checks&quot; in to the hospital to find out what has happened to her sister who stayed there. Meanwhile Ilsa and one of the guards are forcing the inmates to have sex with male prisoners, filming them and selling it as pornoflicks.\n\n----\n\nWhat Others Have Said:\n\n1.   First off, understand my rating of Ilsa. Ilsa by general movie standards is not a good movie. If you were to put it up against any of the so called &quot;classic&quot; movies, it would not stand up. But those who search out Ilsa She Wolf of THe SS or any of the others in the series aren't doing so because they want to see a tense, well acted, well directed movie.\n\nIlsa is first and foremost an exploitation film and, realizing that, I have to say it is in the upper echelons of its field because it wallows in filth and does so unapologetically. It boils down to this. If you search out a Euro Trash film, be it an Italian Giallo or English 70's horror, you desire it to be as sleazy and un politically correct as possible but also you want the movie to have some semblance of a plot, be it ever tiny. Ilsa scores big on all these points. There is wall to wall nudity, all female. Gratitutious torture scenes that are more ridiculous than offensive, (I mean every time Ilsa drags a prisoner down for torture they are completely naked as they are being tortured). And all most everyone of the female cast members at some point is completely naked. Let's be honest, It ain't Shakespeare, nor does it pretend to be.\n\nOf note is the lead actress Dyanne Thorne. Apparently Ms. Thorne had lofty ambitions of being a serious actress at one point in her career but the fickle finger of fate lead her to Ilsa fame. In her mid 40's, Ms. Thorne is competent enough not to look like an amateur on screen. She has a several nude scenes throughout the movie and anyone who watches Ilsa will no doubt remember her more for her large breasts than her acting ability.\n\nIlsa She Wolf of the SS is a noteworthy entry into the world of exploitation films and should be the starting point for anyone who journeys into this genre. I rate it as a 10 because it knows what it is and does not pretend to try for anything higher.\n\n\n2.   Yeah, this first installment of the notorious Ilsa-series is a real goody! It is not as disturbing as &quot;She Wolf&quot; or &quot;The Wicked Warden&quot;, but also not as campy as &quot;Tigress&quot; was! Fans of traditional adventure flicks might love it, too. The only difference is, that &quot;Harem Keeper&quot; features much more sex&amp;acute;n violence than you may find in popcorn movies &amp;agrave; la &quot;Indiana Jones&quot; and friends..! If you&amp;acute;re a fan of the series you know what&amp;acute;s awaiting you! If not, prepare for a bundled load of sleazy erotic, some bizarre torture and lots of comic-like brutality! Once more Dyanne Thorne is over the top (A pity that she doesn&amp;acute;t take off her clothes more often..!), but also her two African helpers named &quot;Satin&quot; and &quot;Velvet&quot; are put on a show very well! And a film where Swedish supermodel Uschi Digard is casted can&amp;acute;t be that worse..! Exploitation cinema at its best!!!\n\n\n3.  Strange, depraved vision of Jess Franco's concerning Ilsa, that wicked, blouse-popping sadist of the famous/infamous series starring statuesque/bosomy Dyanne Thorne. This time around a young girl gets into a hospital run for women who suffer from sex-related diseases such as lesbianism and nymphomania. It seems she had a sister admitted a year ago and wants to find out what has happened to her even though she knows no patient has ever left. The film takes place somewhere in South America where a government is fighting rebels. Well, you get what you might expect from a series like this: lots of nude girls, lots of perversion, lots of sadism, lots of sleaze, and generally a sick/guilty feeling having seen it. There are many scenes which are downright disgusting such as one dealing with the use of a plastic bag, another with pins and a human pin cushion, shock therapy, a night with the boys from the local prison, and the grand finale where Greta(Thorne) is out to lunch with the girls. Franco is a decent director in terms of piecing a film together(despite what the subject matter might be). He can draw scenes out for suspense. He can also shock which he does well too. The acting was decent overall. Thorne is way over-the-top, but hey who cares once they see her? She is the personification of voluptuousness wearing her strained military blouse and high boots with red hair this time round. Ilsa, the Wicked Warden is a unique look at what film can do...and perhaps should not do.\n\n----\n\nEncoded by: sickboy88\nCodec: XviD 1.1.0 Beta 2\nBitrate: 875 kb/s AVG\nAspect: 640x384 = 1.67:1\nAudio: English, 128 kb/s VBR AVG Stereo @ 48K Hz\nSubtitles: None\nRuntime: 01:36:07\nFPS: 23.976\n\nEncoded by: sickboy88\nCodec: XviD 1.1.0 Beta 2\nBitrate: 938 kb/s AVG\nAspect: 640x384 = 1.67:1\nAudio: English, 128 kb/s VBR AVG Stereo @ 48K Hz\nSubtitles: None\nRuntime: 01:33:06\nFPS: 23.976\n\nEncoded by: sickboy88\nCodec: XviD 1.1.0 Beta 2\nBitrate: 896 kb/s AVG\nAspect: 640x384 = 1.67:1\nAudio: English, 128 kb/s VBR AVG Stereo @ 48K Hz\nSubtitles: None\nRuntime: 01:34:15\nFPS: 23.976\n\n----\n\nIf you are going to watch this, you'll want to install the NEW XviD codec:\n\nNow at Beta 2!\n\nhttp://www.koepi.org/XviD-1.1.0-Beta2-04042005.exe\n\nFor top quality, make sure you use the XviD decoder configerator, and turn\non (Y) and (UV) deblocking, and the new feature of\nXviD 1.1.0 (Y) and (UV) DERINGING.\n\nIf you have a slow computer, please turn off pre-processing. I don't want\nanother stupid motherfucker telling me that my movies are out of sync\nbecause they are totally computer illiterate.","torrent":{"xt":"urn:btih:f1498143d5909c9606b50cb40c0b31be085c07f3","amp;dn":"Ilsa_Exploitation_Trilogy+%28xvid110-sickboy88%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1498143d5909c9606b50cb40c0b31be085c07f3","infoHashBuffer":{"type":"Buffer","data":[241,73,129,67,213,144,156,150,6,181,12,180,12,11,49,190,8,92,7,243]},"announce":[],"urlList":[]}}