{"title":"Ghostbusters II[1989]DvDrip[Eng] HarrHarrr","uid":4847661,"size":733739008,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f1f2d819e3780c1c9a2d0ea4de13c6e89d3d5fdc&amp;dn=Ghostbusters+II%5B1989%5DDvDrip%5BEng%5D+HarrHarrr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Harrharrr","files":-1,"time":1239745777,"description":"We're Back!\n \n================================================================================\n\nTitle.......[ Ghostbusters II\nYear........[ 1989 \nGenre.......[ Action | Adventure | Comedy | Fantasy | Sci-Fi \nRuntime.....[ 1h 43m 53s\n\n\nAudio.......[ VBR Mp3 102 Kbps 44100Hz 2ch\nLanguage....[ English\nResolution..[ 608 x 256\nVideo.......[ 827 kbps XviD 25.000 FPS\nQ. Frame....[ 0.213\nDar.........[ 2.375 (19:8)\nSubs........[ Noone \nFiles.......[ 1\nSize........[ 699 mb\nSource......[ DVD\n\n=================================================================================\n\nGhostbusters II\n\nCountry: USA\nIMDb Rating: 6.0/10\nDirector: Ivan Reitman\nCast: Bill Murray, Dan Aykroyd, Sigourney Weaver, Harold Ramis, Rick Moranis, Ernie Hudson, Annie Potts, Peter MacNicol\n         &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0097428/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0097428/&lt;/a&gt;\n\nPlot: It's 5 years after the battle against Gozer. A restraining order has forbidden Peter Venkman, Ray Stantz, Winston Zeddemore, and Egon Spengler from working as Ghostbusters, and as a result, they've had to find other jobs. Ray owns a book store called &quot;Ray's Occult&quot; and performs at children's birthday parties with Winston, Egon conducts experiments at the institute for advanced theoretical research, Dana Barrett broke up with Peter some time ago before marrying another guy, and Peter now hosts a local TV show called &quot;The World of the Psychic&quot;. Dana, who is now the divorced mother of an 8-month-old baby named Oscar, works in the restoration department at the Manhattan Museum of Art. Strange things start happening when Oscar's baby carriage takes off by itself with Oscar in it, and it stops in the middle of 1st Avenue. While Dana's boss, Janosz Poha, is restoring a painting of a 16th-century tyrant named Vigo Von Homburg Deutschendorf, the painting comes to life. Vigo wants to live again by taking over Oscar's body. Vigo takes complete control of Janosz and orders Janosz to get Dana to cooperate. Janosz also has his own agenda. He wants Dana because he's in love with her. When Peter, Ray, and Egon try to help Dana, they are arrested and put on trial for violating the restraining order. When the ghosts of the killer Scoleri Brothers show up at the court room, the judge is forced to remove the restraining order against the guys so they can put the Scoleri Brothers in a ghost trap. After this, Peter, Ray, Egon, and Winston re-open Ghostbusters, and mayor's assistant Jack Hardemeyer tries to slow them down any way he can, because he believes the Ghostbusters are frauds who will hurt the mayor's chances of becoming the governor of New York. The Ghostbusters and their lawyer, Louis Tully, refuse to be stopped by Jack. When Jack has the Ghostbusters put in the Parkview mental hospital, there is an eclipse and Janosz kidnaps Oscar for Vigo. The mayor wants the Ghostbusters on the job, and when the mayor hears that Jack had the Ghostbusters put in the Parkview mental hospital, he fires Jack and has the Ghostbusters released to try to rescue Oscar from Vigo, and Vigo intends to make it as hard as possible for the Ghostbusters.\n\nEnjoy this movie, and please keep seeding when ur done downloading =)","torrent":{"xt":"urn:btih:f1f2d819e3780c1c9a2d0ea4de13c6e89d3d5fdc","amp;dn":"Ghostbusters+II%5B1989%5DDvDrip%5BEng%5D+HarrHarrr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1f2d819e3780c1c9a2d0ea4de13c6e89d3d5fdc","infoHashBuffer":{"type":"Buffer","data":[241,242,216,25,227,120,12,28,154,45,14,164,222,19,198,232,157,61,95,220]},"announce":[],"urlList":[]}}