{"title":"Pipeline to Russia - The Alaska-Siberia Air Route in WW II","uid":14942508,"size":11280537,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f28abf6e87ecf2e75b2b91877785e4fb02b32530&amp;dn=Pipeline+to+Russia+-+The+Alaska-Siberia+Air+Route+in+WW+II&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1466028387,"description":"National Park | 2016 | 0990725213 | English | 140 pages | PDF | 11 MB\r\n\r\nAmerican Lend-Lease generosity helped to join Russia and America in a wartime alliance against Germany. However, Russia, suspicious of American sincerity, delayed the establishment of an Alaska–Siberia delivery route (known throughout the war as ALSIB) to the German war front. Instead, other routes via the North Atlantic and the Persian Gulf were employed for the delivery of urgently needed aircraft in 1941–42. Eventually, recognizing that an ALSIB route would allow the delivery of American-made aircraft in days, not weeks or months the Russians agreed to the ALSIB route in late 1942. The ALSIB route became the fastest and most productive means of moving combat aircraft to the Russian–German front. Additionally, although it was primitive and dangerous, it established a direct and time-saving artery between Moscow and Washington, and it was heavily used by diplomats, politicians, and countless military officials, both Soviet and American. Declassified official U.S. military records and selected Russian sources, as well as reminiscences from former American liaison officers who were stationed at ALSIB posts in Alaska between 1943 and 1945, serve as the basis for this intriguing story","torrent":{"xt":"urn:btih:f28abf6e87ecf2e75b2b91877785e4fb02b32530","amp;dn":"Pipeline+to+Russia+-+The+Alaska-Siberia+Air+Route+in+WW+II","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f28abf6e87ecf2e75b2b91877785e4fb02b32530","infoHashBuffer":{"type":"Buffer","data":[242,138,191,110,135,236,242,231,91,43,145,135,119,133,228,251,2,179,37,48]},"announce":[],"urlList":[]}}