{"title":"Ultraviolet and X-ray Spectroscopy of the Solar Atmosphere","uid":6512171,"size":6340467,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2cc461546f2bc309e256a974ef3306635960b77&amp;dn=Ultraviolet+and+X-ray+Spectroscopy+of+the+Solar+Atmosphere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309672597,"description":"Kenneth J. H. Phillips, &quot;Ultraviolet and X-ray Spectroscopy of the Solar Atmosphere&quot; \n C,,dge U..ty Press | 2008 | ISBN: 0521841607 | 360 pages | PDF | 6.04 MB \n\n The solar atmosphere, above the Sun's surface layers, reaches mega-kelvin temperatures and high levels of dynamic activity through processes involving a pervading magnetic field. This book explores one of the principal means of understanding the solar atmosphere, its ultraviolet and soft X-ray emission. The ultraviolet and X-ray spectra of the Sun's atmosphere provide valuable information about its nature - the heat and density of its various parts, its dynamics, and chemical composition. The principles governing spectral line and continuous emission, and how spectral studies lead to deductions about physical properties, are described, together with spacecraft instrumentation from Skylab, SolarMax, Yohkoh, SOHO, TRACE, and Hinode. With introductions to atomic physics and diagnostic techniques used by solar spectroscopists, a list of emission lines in ultraviolet and soft X-ray regions, and a glossary of terms, this is an ideal reference for graduate students and researchers in astrophysics and solar physics.","torrent":{"xt":"urn:btih:f2cc461546f2bc309e256a974ef3306635960b77","amp;dn":"Ultraviolet+and+X-ray+Spectroscopy+of+the+Solar+Atmosphere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2cc461546f2bc309e256a974ef3306635960b77","infoHashBuffer":{"type":"Buffer","data":[242,204,70,21,70,242,188,48,158,37,106,151,78,243,48,102,53,150,11,119]},"announce":[],"urlList":[]}}