{"title":"Delphic - Collections (2013) [FLAC]","uid":8076332,"size":306759841,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f2d51fbf39fbb34f224c766e56454e8bca82dc4c&amp;dn=Delphic+-+Collections+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1359390201,"description":"\n  Delphic - Collections (2013) [FLAC]\n\n  Released: 2013\n  Duration: 43:02\n  Genre: Pop/Rock\n  Style: Indie Electronic \n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 Of the Young\n  02 Baiya\n  03 Changes\n  04 Freedom Found\n  05 Atlas\n  06 Tears Before Bedtime\n  07 The Sun Also Rises\n  08 Memeo\n  09 Do Not Let the Dreamers Take You Away\n  10 Exotic\n\n  Inspired by Factory Records, acid house, and the golden days of their Manchester, England hometown in the '80s, Delphic features guitarist Matt Cocksedge, multi-instrumentalist Richard Boardman, singer James Cook, and drummer Dan Therman, who plays at the band's shows. Prior to Delphic, Cocksedge and Boardman were in the guitar-driven indie band Snowfight in the City Centre, but when that group split, the pair wanted to make music people could dance to. They connected with Cook and, following in the footsteps of New Order, mixed dance beats and synths with live drums and guitars. After their first show in a basement, Delphic also hosted illegal raves in warehouses to avoid playing in typical venues. \n\n  The band signed to the same management firm that represented Bloc Party and the Streets. They worked with dance producer Ewan Pearson on their April 2009 debut single &quot;Counterpoint,&quot; which was released by the Belgian label R&amp;S. Delphic spent that summer playing at festivals including T in the Park, Reading and Leeds Festivals, Creamfields and Bestival. In August, the group issued &quot;This Momentary&quot; on Kitsune. The single's video was nominated for three U.K. Music Video Awards: Best Cinematography, Best Editing, and Best Telecine. Late in 2009, Delphic were named one of the 15 acts shortlisted for the BBC Sound of 2010 (they ended up placing third). Their debut album, Acolyte, arrived early in 2010 on their own imprint Chimeric via Polydor, and earned critical acclaim. The single &quot;Doubt&quot; appeared soon after Acolyte's release.  Collections followed in early 2013.","torrent":{"xt":"urn:btih:f2d51fbf39fbb34f224c766e56454e8bca82dc4c","amp;dn":"Delphic+-+Collections+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2d51fbf39fbb34f224c766e56454e8bca82dc4c","infoHashBuffer":{"type":"Buffer","data":[242,213,31,191,57,251,179,79,34,76,118,110,86,69,78,139,202,130,220,76]},"announce":[],"urlList":[]}}