{"title":"Natasha Bedingfield - Touch (Xvid-2nafish) 1080p","uid":5726508,"size":124802618,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f2e06191846eb2e2c4b397cb8157df66a4e960b8&amp;dn=Natasha+Bedingfield+-+Touch+%28Xvid-2nafish%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1280478618,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:44\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 24.00\nBitRate : 4126 Kbps\nQuality Factor : 0.08 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Touch&quot; is a song performed by British singer-songwriter Natasha Bedingfield. The song written by Bedingfield, Julian Bunetta and Steve Kipner was released to the U.S. iTunes store on 18 May 2010 as the first single from her upcoming studio album, Strip Me which is due in late 2010. The song was sent to U.S. radio on 29 June 2010.\n\nRich Lee was booked to direct the video which was filmed in the first week of July 2010. Lee is best known for his work with the Black Eyed Peas. 13 July, outtakes from the video were released on Bedingfield's official site andaccount. \n\nIt been revealed that &quot;Touch&quot; will be used as the theme song for an upcoming NIVEA skincare compaign. Of the partnership which will involved the song being featured in TV commercials Bedingfield said &quot;I've never been happier than I am right now ... I just celebrated my one-year wedding anniversary with the love of my life, and my new album, which I'm very proud of, will be released this fall. When I heard about NIVEA's Happiness campaign, I couldn't think of a better way to share my new song, 'Touch,' with fans. When you feel happy, it's contagious!&quot;\n\nBedingfield performed the song live for the first time on The Ellen DeGeneres Show on 24 May 2010. She performed the song for a second time on So You Think You Can Dance on 8 July 2010. On 19 July, Bedingfield performed the song at the VH1 Do Something Awards\n\nNatasha Anne Bedingfield (born 26 November 1981) is an English pop singer and songwriter.\n\nBased in Book St., London, Bedingfield debuted in the 1990s as a member of the Christian dance/electronic group The DNA Algorithm with her siblings Daniel Bedingfield and Nikola Rachelle. Throughout the 1990s and early 2000s, Bedingfield recorded rock and gospel songs for the Hillsong London Church, while Daniel went on to enjoy success with hits &quot;Gotta Get Thru This&quot; and &quot;If You're Not The One&quot;.\n\nBedingfield recorded her first album Unwritten in 2004. The album contained primarily uptempo pop songs and was influenced by R&amp;B music; it enjoyed international success with over 2.3 million copies sold worldwide. In 2007, she received a Grammy Award nomination for &quot;Best Female Pop Vocal Performance&quot; for the song &quot;Unwritten&quot;. Bedingfield's second album N.B. (2007) yielded the singles &quot;I Wanna Have Your Babies&quot;, &quot;Soulmate&quot; and &quot;Say It Again&quot;. Bedingfield has achieved five top ten singles in the United Kingdom and, as of April 2008[update], she has sold over 2 million albums worldwide.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f2e06191846eb2e2c4b397cb8157df66a4e960b8","amp;dn":"Natasha+Bedingfield+-+Touch+%28Xvid-2nafish%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2e06191846eb2e2c4b397cb8157df66a4e960b8","infoHashBuffer":{"type":"Buffer","data":[242,224,97,145,132,110,178,226,196,179,151,203,129,87,223,102,164,233,96,184]},"announce":[],"urlList":[]}}