{"title":"WinRAR 5.21.2.0 beta2 32-64bits [AutomaticReg] Portable 3-2PLAY","uid":11690795,"size":5284714,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f3402f8de43f599d9617383c65380020e90d3896&amp;dn=WinRAR+5.21.2.0+beta2+32-64bits+%5BAutomaticReg%5D+Portable+3-2PLAY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":3,"time":1423520572,"description":"Hi to all nice windows applications fans and welcome to download the latest winrar release registered with double mode portability ...\n\n\nPORTABLE NOTES\n\n\nDouble mode means that the portable can be runned by a single executable or extracted in a selected folder, a read me.txt is included with instructions\n\nthis portable have a bit smart modding with adding files for compression with new characters and a beautiful logo is added on the compressor menu and while compressing rar archives, thatÂ´s it ... just a little mod ...\n\n\n\nWinRAR is a powerful compression tool with many integrated additional functions to help you organize your compressed archives.\n\nWinRAR puts you ahead of the crowd when it comes to compression. By consistently creating smaller archives, WinRAR is often faster than the competition. This will save you disk space, transmission costs AND valuable working time as well.\n\nWinRAR supports all popular compression formats (RAR, ZIP, CAB, ARJ, LZH, ACE, TAR, GZip, UUE, ISO, BZIP2, Z and 7-Zip).\n\nWinRAR is ideal for multimedia files. WinRAR automatically recognizes and selects the best compression method. The special compression algorithm compresses multimedia files, executables and object libraries particularly well.\n\nWinRAR allows you to split archives into separate volumes easily, making it possible to save them on several disks for example.\n\n\n\n* enjoy","torrent":{"xt":"urn:btih:f3402f8de43f599d9617383c65380020e90d3896","amp;dn":"WinRAR+5.21.2.0+beta2+32-64bits+%5BAutomaticReg%5D+Portable+3-2PLAY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3402f8de43f599d9617383c65380020e90d3896","infoHashBuffer":{"type":"Buffer","data":[243,64,47,141,228,63,89,157,150,23,56,60,101,56,0,32,233,13,56,150]},"announce":[],"urlList":[]}}