{"title":"Devloping Large Web Applications","uid":9152553,"size":1941715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f44c42e069283f4ec584369558d78c07599a7e6b&amp;dn=Devloping+Large+Web+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cabrao","files":-1,"time":1383720214,"description":"How do you create a mission-critical site that provides exceptional performance while remaining flexible, adaptable, and reliable 24/7? Written by the manager of a UI group at Yahoo!, Developing Large Web Applications offers practical steps for building rock-solid applications that remain effective even as you add features, functions, and users. You'll learn how to develop large web applications with the extreme precision required for other types of software.\n\nAvoid common coding and maintenance headaches as small websites add more pages, more code, and more programmers\nGet comprehensive solutions for refining HTML, CSS, JavaScript, PHP, and Ajax for large-scale web applications\nMake changes in one place that ripple through all affected page elements\nEmbrace the virtues of modularity, encapsulation, abstraction, and loosely coupled components\nUse tried-and-true techniques for managing data exchange, including working with forms and cookies\nLearn often-overlooked best practices in code management and software engineering\nPrepare your code to make performance enhancements and testing easier","torrent":{"xt":"urn:btih:f44c42e069283f4ec584369558d78c07599a7e6b","amp;dn":"Devloping+Large+Web+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f44c42e069283f4ec584369558d78c07599a7e6b","infoHashBuffer":{"type":"Buffer","data":[244,76,66,224,105,40,63,78,197,132,54,149,88,215,140,7,89,154,126,107]},"announce":[],"urlList":[]}}