{"title":"Sal Valentino - Come Out Tonight [2006][EAC/FLAC]","uid":10661679,"size":294959734,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f45b64c2d1ab26b9567b58d2a3ba28e1f5727875&amp;dn=Sal+Valentino+-+Come+Out+Tonight+%5B2006%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1406736165,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Fat Pete Records #4050003\nCountry: USA\nYear: April 18, 2006\nGenre: blues,rock\nFormat: CD, Album,\n\n[b]\n\n\nAll The Places 2:56 min\nCatherine I Do 3:44 min\nNew Day 3:10 min\nThe Devil Is In The Courtyard 3:24 min\nGrease The Wheel 2:36 min\nFor The Longest Time 3:52 min\nFolsom Prison Blues 5:35 min\nTreasure Of The Orient 4:06 min\nLookin For You 4:01 min\nThe Highwayman 3:05 min\nCome Out Tonight 4:59 min\n\n\n\nThis record is a genuinely amazing listening experience -- in fact, it's downright spellbinding for anyone who remembers the Beau Brummels, the mid-'60s/late-'60s outfit that Sal Valentino fronted. One hears accounts of enduring talents all the time, but even so, nine times out of ten with veteran performers of four decades' standing, it's too much to expect that they could actually deliver albums as strong as their classic work. But that's precisely what Valentino has done with Come Out Tonight. The voice is a little rougher, to be sure, but it's also every bit as powerful, expressive, and memorable as it was in the 1960s -- and with some fine songwriting of his own plus some careful selection of other people's tunes, he's come up with an album that's a fine successor to the first two Beau Brummels albums or just about anything else he ever did during his classic years. Come Out Tonight does cover all kinds of ground that wouldn't have been in evidence in the mid-'60s, of course, including a killer slow acoustic blues-style rendition of &quot;Folsom Prison Blues&quot; and a similarly unexpected interpretation of Jimmy Webb's &quot;The Highwayman,&quot; his singing driving any of the pop smoothness from the piece. The newer numbers are also memorable, if mostly in more of a pop/rock vein (with a folk-rock veneer on a lot of them), and one could see a song like &quot;Treasure of the Orient&quot; turning into a hit in a friendlier musical environment. And although he's mostly known as a singer and songwriter, Valentino also contributes some acoustic guitar to his cause on a pair of tracks, most notably the title song. A dark, minimalist, bluesy personal reflection that's as alluring as it is devastating listening, &quot;Come Out Tonight&quot; delves into profoundly moving depths of despair and loneliness. And what makes this record even more special is the energy behind it -- Come Out Tonight isn't just an exercise in nostalgia, or an example of a veteran artist ascending to an unexpectedly high plateau, but a solidly compelling body of performances, surprisingly close in spirit to the records that Johnny Cash cut with Rick Rubin -- except that Valentino never needed (or saw the urgency for) the &quot;comeback.&quot;","torrent":{"xt":"urn:btih:f45b64c2d1ab26b9567b58d2a3ba28e1f5727875","amp;dn":"Sal+Valentino+-+Come+Out+Tonight+%5B2006%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f45b64c2d1ab26b9567b58d2a3ba28e1f5727875","infoHashBuffer":{"type":"Buffer","data":[244,91,100,194,209,171,38,185,86,123,88,210,163,186,40,225,245,114,120,117]},"announce":[],"urlList":[]}}