{"title":"The Kama Sutra of Vatsyayana by Vatsyayana [republicV]","uid":7735591,"size":804681,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f46395ffadf1ba1599f8d30bde0534cbac381ceb&amp;dn=The+Kama+Sutra+of+Vatsyayana+by+Vatsyayana+%5BrepublicV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"republicV","files":-1,"time":1350479961,"description":"he Kama Sutra of Vatsyayana (this version is the English translation by Sir Richard Burton) is the classic Indian on manual on living and lovemaking as an art, spiritual activity and Dharma. In consists of 1250 verses, distributed in 36 chapters, which are further organized into 7 parts.\n\nMan, the period of whose life is one hundred years, should practise Dharma, Artha, and Kama at different times and in such a manner that they may harmonize together and not clash in any way. He should acquire learning in his childhood, in his youth and middle age he should attend to Artha and Kama, and in his old age he should perform Dharma, and thus seek to gain Moksha, i.e, release from further transmigration. Or, on account of the uncertainty of life, he may practise them at times when they are enjoined to be practised. But one thing is to be noted, he should lead the life of a religious student until he finishes his education.\n\nDharma is obedience to the command of the Shastra or Holy Writ of the Hindoos to do certain things, such as the performance of sacrifices, which are not generally done because they do not belong to this world, and produce no visible effect; and not to do other things, such as eating meat, which is often done because it belongs to this world, and has visible effects. Dharma should be learnt from the Shruti (Holy Writ), and from those conversant with it.\n\nArtha is the acquisition of arts, land, gold, cattle, wealth, equipages and friends. It is, further, the protection of what is acquired, and the increase of what is protected.\n\nArtha should be learnt from the king's officers, and from merchants who may be versed in the ways of commerce.\n\nKama is the enjoyment of appropriate objects by the five senses of hearing, feeling, seeing, tasting, and smelling, assisted by the mind together with the soul. The ingredient in this is a peculiar contact between the organ of sense and its object, and the consciousness of pleasure which arises from that contact is called Kama...","torrent":{"xt":"urn:btih:f46395ffadf1ba1599f8d30bde0534cbac381ceb","amp;dn":"The+Kama+Sutra+of+Vatsyayana+by+Vatsyayana+%5BrepublicV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f46395ffadf1ba1599f8d30bde0534cbac381ceb","infoHashBuffer":{"type":"Buffer","data":[244,99,149,255,173,241,186,21,153,248,211,11,222,5,52,203,172,56,28,235]},"announce":[],"urlList":[]}}