{"title":"Numero Group - Eccentric Soul Series (11 albums)","uid":4310314,"size":1075171569,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f4f43823ae2bd549cef1a09a7041e5ee921137aa&amp;dn=Numero+Group+-+Eccentric+Soul+Series+%2811+albums%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mvick","files":282,"time":1216778025,"description":"www.numerogroup.com/catalog.php?subcat=Eccentric Soul\n\nAbout Numero Group:\nRecent statements you may have heard:\n\nAnything but another record label. Please, we don&amp;#039;t need another one of those clogging up the bins. Accountants with coke habits, lawyers using Pitchfork as a tip sheet, 60 year-old executives awkwardly trying to converse with 17 year-old groupies. Marketing meetings. Junior VP&amp;#039;s.\n\nEnter the Numero Group. Founded by Tom Lunt, Rob Sevier, and Ken Shipley in 2003, the three self-proclaimed &quot;record obsessives&quot; decided to approach the record business backwards. No corporate hierarchy; no company stationary. Just a big pile of music that no one had ever heard of.\n\nThe mission was simple: to dig deep into the recesses of our record collections with the goal of finding the dustiest gems begging to be released from their exile on geek street. No longer would $500 singles sit in a temperature-controlled room dying for a chance to be played. No more would the artists, writers, and entrepreneurs who made these records happen go unknown and unappreciated.\n\nNumero releases are sound with substance, living at the nexus of song and story. Scrupulously researched, painstakingly re-mastered, and with an attention to detail that is unmatched in the reissue field, the end result is a top-of-the-line compact disc.\n\nThere is no &quot;Numero&quot; sound; instead, Numero offers an aesthetic. A shelf of Numero discs feels less like a &quot;record collection&quot; and more like a library. The library to date is a mix of thrift shop soul, skinny tie pop, Belizean funk, and hillbilly gospel. Numero makes records for people who may have everything from indigenous Central American drumming to Canadian chanteuses stacked next to their CD players.\n\nThis is it. Welcome home. \n**********************************************************\nThe torrent includes the complete (up to July 2008) Eccentric Soul series from Numero Group - not including the 45rpm singles.\n\nNUM001 - Various Artists - Eccentric Soul: The Capsoul Label @ 192 cbr\nNUM003 - Various Artists - Eccentric Soul: The Bandit Label @ LAME -APS vbr\nNUM007 - Various Artists - Eccentric Soul: The Deep City Label @ 192 cbr\nNUM009 - Various Artists - Eccentric Soul: The Big Mack Label @ 192 cbr\nNUM010 - Various Artists - Good God! A Gospel Funk Hymnal @ 256 cbr\nNUM011 - Various Artists - Eccentric Soul: Mighty Mike Lenaburg @ 192 cbr\nNUM013 - Various Artists - Eccentric Soul: Twinight&amp;#039;s Lunar Rotation @ 212 vbr\nNUM015 - Various Artists - Eccentric Soul: The Prix Label @ LAME -VO vbr\nNUM016 - Various Artists - The ABCs Of Kid Soul: Home Schooled @ LAME -VO vbr\nNUM017 - Various Artists - Eccentric Soul: The Outskirts Of Deep City @ LAME -V2 vbr\nNUM020 - Various Artists - Eccentric Soul: The Tragar &amp; Note Labels @ LAME -V2 vbr\n***********************************************************\nAll albums include cover art.","torrent":{"xt":"urn:btih:f4f43823ae2bd549cef1a09a7041e5ee921137aa","amp;dn":"Numero+Group+-+Eccentric+Soul+Series+%2811+albums%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4f43823ae2bd549cef1a09a7041e5ee921137aa","infoHashBuffer":{"type":"Buffer","data":[244,244,56,35,174,43,213,73,206,241,160,154,112,65,229,238,146,17,55,170]},"announce":[],"urlList":[]}}