{"title":"The Anthony Cumia Show 2015-05-04 Bowling for Cumia MP4 MP3","uid":11887408,"size":272042653,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f6038d38924e3c3c9a19eb791517562f139f5093&amp;dn=The+Anthony+Cumia+Show+2015-05-04+Bowling+for+Cumia+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1430880834,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\n\nEpisode 156 - Bowling for Cumia: TACS is back with a weekend recap that included Red Eye, the big Pacquiao vs. Mayweather boxing match, the Kentucky Derby, a Compound poker game, and a little rooftop party action. Anthony then talks about a news story involving another &quot;shooting&quot; in Baltimore, Freddie Gray being a detriment to society, good cop versus bad cop, the shooting of NYPD officer Brian Moore, a fired up pizza man wanting a gun, and the jihadists put down in Texas. Ant gets into how well done The Onion is and reads a story from the website, Amy Schumer's interview with Bailey Jay, the latest on Bernie Goetz, and takes a look at Monday's mail. We see a fight video from a party at the Hard Rock in Vegas, Jamie Foxx (over) singing the national anthem this past weekend, Scott Weiland (under) singing Vasoline as well as a throwback Letterman performance where he nails it, we find out Ant will be doing an upcoming roast of Big Jay Oakerson, and end today's show watching a wild bowling clip from the movie &quot;There Will Be Blood&quot;.\n\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:f6038d38924e3c3c9a19eb791517562f139f5093","amp;dn":"The+Anthony+Cumia+Show+2015-05-04+Bowling+for+Cumia+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6038d38924e3c3c9a19eb791517562f139f5093","infoHashBuffer":{"type":"Buffer","data":[246,3,141,56,146,78,60,60,154,25,235,121,21,23,86,47,19,159,80,147]},"announce":[],"urlList":[]}}