{"title":"WWE Raw 2005.11.14.Eddie.Guerrero Tribute Show (Full).avi","uid":8741424,"size":1318388080,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f64940ec4571a19971123d597212d923f4ed5dbb&amp;dn=WWE+Raw+2005.11.14.Eddie.Guerrero+Tribute+Show+%28Full%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JohnathanDagger","files":1,"time":1374799177,"description":"Eddie Guerrero. One of the greatest wrestlers of the present age, and also one of the most tortured. Part of the legendary Guerrero family, the Mexican counterpart of the Canadian Hart family and the Samoan Ano'i lineage, he began wrestling at age fifteen alongside his nephew Chavo, and through the era of the Monday Night Wars they would become superstars. But Eddie made choices in his life that were not in his best interest, and during the weekend of November 12th, 2005 it cost him his life. When the news was broken to the world of Pro Wrestling that Latino Heat, the master of Lying, Cheating and Stealing, the much-beloved Eddie Guerrero was gone, found in his hotel room by Chavo, his heart having given out due to the wear and tear it had taken, WWE and Vince McMahon knew there was only one true way to honor him. A prestigious honor that only one man had been given before, and only one would receive after him: an episode of Monday Night RAW completely in his honor. No storylines, no facedowns, no invective laced promos. Just those who knew him putting on a show in his honor. Now here it is in it's entirety. The 21-bell salute. Rey Mysterio removing his mask in remembrance of his amigo. Chris Benoit, Big Show, and Chavo breaking down on camera. John Cena laying the WWE title across an Eddie Guerrero t-shirt in the middle of the ring. Relive it all and remember one of the greatest the squared circle has ever seen and will ever see.","torrent":{"xt":"urn:btih:f64940ec4571a19971123d597212d923f4ed5dbb","amp;dn":"WWE+Raw+2005.11.14.Eddie.Guerrero+Tribute+Show+%28Full%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f64940ec4571a19971123d597212d923f4ed5dbb","infoHashBuffer":{"type":"Buffer","data":[246,73,64,236,69,113,161,153,113,18,61,89,114,18,217,35,244,237,93,187]},"announce":[],"urlList":[]}}