{"title":"The Last Word by Hanif Kureishi","uid":11425321,"size":279939,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f71e1cb44555ef587fdcd4bf7a0e720fc5989bd0&amp;dn=The+Last+Word+by+Hanif+Kureishi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zubabrase","files":-1,"time":1415654639,"description":"Hanif Kureishi, CBE (born 5 December 1954) is an English playwright, screenwriter and filmmaker and novelist. In 2008, The Times included Kureishi in their list of &quot;The 50 greatest British writers since 1945&quot;.\n\nAbout the novel\n\nMamoon is an eminent Indian-born writer who has made a career in England - but now, in his early 70s, his reputation is fading, sales have dried up, and his new wife has expensive taste.\n\nHarry, a young writer, is commissioned to write a biography to revitalise both \nMamoon's career and his bank balance. Harry greatly admires Mamoon's work and wants to uncover the truth of the artist's life. Harry's publisher seeks a more naked truth, a salacious tale of sex and scandal that will generate headlines. Meanwhile Mamoon himself is mining a different vein of truth altogether.\n\nHarry and Mamoon find themselves in a battle of wills, but which of them will have the last word?\n\nThe ensuing struggle for dominance raises issues of love and desire, loyalty and betrayal, and the frailties of age versus the recklessness of youth.\n\nHanif Kureishi has created a tale brimming with youthful exuberance, as hilarious as it is touching, where words have the power to forge a world.\n\n*************************\n\nRemarks\n\n1. To help people download some or all of the above titles, I would appreciate it if you could keep the torrent alive by seeding it for at least an hour after you have finished. Thanks for your co-operation.\n\n2. The above title is available in epub format only and is of retail quality","torrent":{"xt":"urn:btih:f71e1cb44555ef587fdcd4bf7a0e720fc5989bd0","amp;dn":"The+Last+Word+by+Hanif+Kureishi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f71e1cb44555ef587fdcd4bf7a0e720fc5989bd0","infoHashBuffer":{"type":"Buffer","data":[247,30,28,180,69,85,239,88,127,220,212,191,122,14,114,15,197,152,155,208]},"announce":[],"urlList":[]}}