{"title":"Lab 257  [BBS]","uid":6607407,"size":1233059,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f922e547ac098f31d8e7aac543b0171941ee50aa&amp;dn=Lab+257++%5BBBS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1313458179,"description":"                                      Lab 257\n\n         The Disturbing Story of the Governments Secret Germ Laboratory\n \n                                     (Aug.2005)\n\n\n\n\nStrictly off limits to the public, Plum Island is home to virginal beaches, cliffs, forests, ponds -- and the deadliest germs that have ever roamed the planet. Lab 257 blows the lid off the stunning true nature and checkered history of Plum Island. It shows that the seemingly bucolic island in the shadow of New York City is a ticking biological time bomb that none of us can safely ignore.\n\nBased on declassified government documents, in-depth interviews, and access to Plum Island itself, this is an eye-opening, suspenseful account of a federal government germ laboratory gone terribly wrong. For the first time, Lab 257 takes you deep inside this secret world and presents startling revelations on virus outbreaks, biological meltdowns, infected workers, the periodic flushing of contaminated raw sewage into area waters, and the insidious connections between Plum Island, Lyme disease, and the deadly West Nile virus. The book also probes what's in store for Plum Island's new owner, the Department of Homeland Security, in this age of bioterrorism.\n\nLab 257 is a call to action for those concerned with protecting present and future generations from preventable biological catastrophes.","torrent":{"xt":"urn:btih:f922e547ac098f31d8e7aac543b0171941ee50aa","amp;dn":"Lab+257++%5BBBS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f922e547ac098f31d8e7aac543b0171941ee50aa","infoHashBuffer":{"type":"Buffer","data":[249,34,229,71,172,9,143,49,216,231,170,197,67,176,23,25,65,238,80,170]},"announce":[],"urlList":[]}}