{"title":"Holiday Affair (1949) Xvid 1cd - A Christmastime Story [DDR]","uid":9326888,"size":733935616,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f98ae246cc4c11d005b285e093de3317d1dcf61a&amp;dn=Holiday+Affair+%281949%29+Xvid+1cd+-+A+Christmastime+Story+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1386657735,"description":"Holiday Affair (1949) Xvid 1cd - A Christmastime Story [DDR]\n\nHoliday Affair is a black-and-white 1949 light romantic comedy film starring Robert Mitchum and Janet Leigh. In this modest film, directed and produced by Don Hartman, Mitchum expanded from his typical roles in film noir and war films. It was based on the story Christmas Gift by John D. Weaver, also the film's working title.\n\nSet during the Christmas season, the film was not well received on its initial release. However, Turner Classic Movies airing the film over Christmas has led to it becoming a minor holiday classic. A made-for-television remake was produced in 1996.\n\n    CAST:-\n    Robert Mitchum as Steve Mason\n    Janet Leigh as Connie Ennis\n    Wendell Corey as Carl Davis\n    Gordon Gebert as Timmy Ennis\n    Griff Barnett as Mr. Ennis\n    Esther Dale as Mrs. Ennis\n    Henry O'Neill as Mr. Crowley\n    Harry Morgan as Police Lieutenant\n    Larry J. Blake as Plainclothesman\n    Helen Brown as Emily ( Mr Crowley's secretary )\n    Frances Morris as Housekeeper ( Mary )\n\n    Directed by Don Hartman\n    Produced by Don Hartman\n    Written by Isobel Lennart, John D. Weaver\n\nMOVIE REVIEW:- Holiday Affair (1949)\nSteve Mason (Robert Mitchum), a veteran and drifter, is employed as a clerk during the Christmas season at Crowley's, a New York department store. He suspects customer Connie Ennis (Janet Leigh) of being a comparative shopper for a rival store when she buys an expensive toy train set without asking a single question about it. That night, her son Timmy (Gordon Gebert) becomes excited when he sneaks a peek at what he thinks is his present, only to be disappointed when his mother sets him straight. When Connie returns the train the next day, Steve tells her that he should report her to the store detective, which would lead to her firing. After she explains that she is a war widow with a son to support, Steve refunds her money, a gesture that costs him his job.\n\nSteve becomes acquainted with Connie, her son, and her longtime boyfriend, lawyer Carl Davis (Wendell Corey). On Christmas morning, Timmy discovers the train set outside the apartment door and assumes that his mother got it for him after all. When Connie realizes who it must have come from, she finds the almost-broke Steve in Central Park, gives him a tie (originally intended for Carl), and offers to reimburse him for the expensive present. He refuses her money, saying that he wants to encourage Timmy's optimism. Connie then reveals she is marrying Carl on New Year's Day; Steve lets her know he thinks her decision is a mistake. Annoyed, Connie goes home.\n\nLater on, Steve is arrested on suspicion of theft of a pair of stolen salt and pepper shakers, which a park bum (Frank Mills) had given to him as a gift (after Steve gave him his old tie). Carl does his best to secure his client's freedom, but only succeeds in annoying the police lieutenant (Harry Morgan). Connie explains about Steve and the bum, to the discomfort of Carl and the amusement of the lieutenant, and Steve is released. Timmy then invites Steve to have Christmas dinner with them. The meal is an uneasy affair, with Connie's former in-laws (Esther Dale and Griff Barnett) watching the two rivals for her affections. At the end, Steve stands up and announces that he is in love with Connie and that she should marry him. She tells him to leave.\n\nThe next day, Timmy takes his train set back to Crowley's to get the money back for Steve. He eventually ends up tearfully telling his story to the owner, Mr. Crowley (Henry O'Neill). After Timmy returns home, Connie and Carl drive to Steve's hotel to give him the money. When Connie asks Carl to see Steve by himself, the lawyer realizes he has no chance and gives up. Connie then sees Steve, but when he insists that she stop grieving for her dead husband, she storms out. However, she finally accepts that she loves Steve. She takes Timmy, boards the train Steve is taking to California, and embraces him.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 87 mins\nSubtitles: one\nRipped by: Trinidad [DDR]\nDuration: 87 mins","torrent":{"xt":"urn:btih:f98ae246cc4c11d005b285e093de3317d1dcf61a","amp;dn":"Holiday+Affair+%281949%29+Xvid+1cd+-+A+Christmastime+Story+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f98ae246cc4c11d005b285e093de3317d1dcf61a","infoHashBuffer":{"type":"Buffer","data":[249,138,226,70,204,76,17,208,5,178,133,224,147,222,51,23,209,220,246,26]},"announce":[],"urlList":[]}}