{"title":"Linkin Park-Minutes to Midnight","uid":6422064,"size":120542145,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f9a0a42c3b460b2bd6c007c8a6548409fe907055&amp;dn=Linkin+Park-Minutes+to+Midnight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rjaa","files":21,"time":1306332211,"description":"Minutes to Midnight is the third studio album by American rock band Linkin Park. Released on May 14, 2007, through Warner Bros. Records, the album debuted at number one in the United States and in 15 other countries, including the United Kingdom and Canada.[11][12] The album was produced by Mike Shinoda and Rick Rubin. Minutes to Midnight features a shift in the group's musical direction. For the band, the album marks a beginning of deviation from their signature nu metal sound.\nLinkin Park started work on their third studio album which begun in 2003. However, while touring to support Meteora in 2004 before the project was resumed later, they postponed work on it. Mike Shinoda formed Fort Minor, while Chester Bennington formed Dead by Sunrise. They returned to working on the record, as they have Rick Rubin produce it with Shinoda. They took on a different musical direction afterward. A few unrevealed-to-the-public mistakes occurred while recording the album, postponing it to several dates. Within mixing the album, some touches were added. After artwork and the rest of it was complete they decided to release &quot;What I've Done&quot; as its lead single by April 2007. It was finally released in North America on May 15, 2007.\nIn the United States, the album had the biggest first week sales of 2007 at the time, with 625,000 albums sold, going on to be certified double platinum in the United States, New Zealand, Italy, Ireland, and Australia and certified platinum in Canada, France, Switzerland and in the UK.[13] Despite its commercial success, Minutes to Midnight received mixed reviews from critics.[14] Rolling Stone magazine named it the twenty-fifth best album of 2007.[15] It was ranked #154 on Billboard's Hot 200 Albums of the Decade.\n\n\n\nNo.\tTitle\tLength\n1.\t&quot;Wake&quot;  \t1:41\n2.\t&quot;Given Up&quot;  \t3:09\n3.\t&quot;Leave Out All the Rest&quot;  \t3:29\n4.\t&quot;Bleed It Out&quot;  \t2:44\n5.\t&quot;Shadow of the Day&quot;  \t4:49\n6.\t&quot;What I've Done&quot;  \t3:25\n7.\t&quot;Hands Held High&quot;  \t3:53\n8.\t&quot;No More Sorrow&quot;  \t3:41\n9.\t&quot;Valentine's Day&quot;  \t3:16\n10.\t&quot;In Between&quot;  \t3:16\n11.\t&quot;In Pieces&quot;  \t3:38\n12.\t&quot;The Little Things Give You Away&quot;  \t6:23","torrent":{"xt":"urn:btih:f9a0a42c3b460b2bd6c007c8a6548409fe907055","amp;dn":"Linkin+Park-Minutes+to+Midnight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9a0a42c3b460b2bd6c007c8a6548409fe907055","infoHashBuffer":{"type":"Buffer","data":[249,160,164,44,59,70,11,43,214,192,7,200,166,84,132,9,254,144,112,85]},"announce":[],"urlList":[]}}