{"title":"(2013) Chvrches - The Bones of What You Believe [FLAC] {100.XY}","uid":8987689,"size":838500055,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fa26904ce5c0f455e37ece999319b0aab5486c89&amp;dn=%282013%29+Chvrches+-+The+Bones+of+What+You+Believe+%5BFLAC%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"100.XY","files":-1,"time":1380713300,"description":"Chvrches - The Bones of What You Believe\n\n\nWikipedia:\nhe Bones of What You Believe is the debut studio album by Scottish synthpop band Chvrches. It was released on 20 September 2013 by Virgin Records and Goodbye Records. The album has spawned the singles &quot;The Mother We Share&quot;, &quot;Recover&quot; and &quot;Gun&quot;.\nThe album was made available as both a twelve-track standard edition and eighteen-track special version. The latter includes two extra songs, two remixes and two live videos.\nThe album's title derives from a lyric in the song &quot;Strong Hand&quot; and refers to the raw &quot;creativity and effort&quot; that served as the skeleton for the album, according to lead singer Lauren Mayberry\n\n\nReview:\nFor two decades, Glasgow's indie-pop and dance music scenes have run in parallel, with only a few notable intersections; Chvrches are the latest meeting point. The Scottish trio's debut LP, The Bones of What You Believe, is a seamless fusion of emotive theatrics, hook-loaded songwriting, and some of the more forward-thinking sonics in electronic music right now. It's a style that feels very of-the-moment: Chvrches embody what a generation raised on electronic music is looking for in a rock band, taking the danceable textures favored by the Electric Daisy set and applying them to the sweeping songcraft of M83 and Passion Pit.\nUnlike those those bands, Chvrches avoid guitars almost entirely, but the hooks on The Bones of What You Believe are indelible regardless of instrumentation, and the sound is immaculate. After Chvrches self-produced the album in band member Iain Cook's own Glasgow studio, big-deal boards guy Rich Costey (Nine Inch Nails, Rage Against the Machine) handled the mixing; his touch gives these tunes the bright clarity they deserve, with plenty of space for funhouse sonic triggers-- processed effects, pitched-down vocal samples, frizzy synth-pad textures. Every note sounds clean and sharp, a necessary corrective to the chemical-dipped wooziness that has dominated electronic indie pop in the last few years.\nThat sense of precision is unusual for a band this new, but Cook and Martin Doherty, who handle the majority of the instrumentation live and on record, are vets of the Glasgow's perpetually fertile indie scene. Cook handled guitars and programming as a member of defunct alt-leaning post-rockers Aereogramme, while Doherty was once a live member of throat-shredding shoegazers the Twilight Sad (who launched into their own synth excursions around the time that Chvrches became a full-time concern). Together they make music that complements distinctive vocalists without overshadowing them.\nHeard in the context of Glasgow's still-strong cottage industry of distinctly masculine anguish-rock bands, the emotional palette of Chvrches' lead singer Lauren Mayberry is a welcome change of pace. A local-band lifer who once pursued a career in music journalism, Mayberry's voice is a multifaceted instrument, the emotional kernel in Chvrches' molecular makeup. She can sound cutting, aching, triumphant, fragile, and weightless, sometimes all at once; on &quot;Lies&quot;, she soars above the chorus' mountainous build, and her vocal surge rescues the murky techno of &quot;Science/Visions&quot;, the closest thing to a miss on this otherwise rock-solid album.\nEven when Mayberry's at her most powerful, her voice possesses a specific, relatable humanity, which brightens the adolescent glow of her lyrics. (Occasional lead singer Doherty, previously the band's weak link, makes good enough on his two featured songs, the rippling &quot;Under the Tide&quot; and the prom-dance lushness of &quot;You Caught the Light&quot;). Her words might look overwrought on paper, but when set to the emotive sounds that Chvrches trade in, they sound towering, impassioned, and life-affirming. Depeche Mode, a spiritual antecedent, have a classic song with the refrain &quot;All I ever wanted/ All I ever needed/ Is here, in my arms&quot;; that kind of emotional directness and simplicity is a hallmark of the songwriting here.\nThe Bones of What You Believe also shares some of Depeche Mode's large-scale ambition: the arpeggiated-synth burst that closes &quot;Tether&quot; sounds like it was orchestrated for the optimal turn-all-the-lasers-on-at-once trigger at a live performance, and it's all the better for it. Throughout, Chvrches' effortless populism finds them in a long tradition of bands who take a highly personal sense of turmoil and blow it up onto an arena-sized screen. Granted, recent live performances have suggested that they have a ways to go before their concert-conquering potential catches up with the ability they display on record, such but growing pains are normal for a band this new. For now, on record, Chvrches know how go big on an intimate scale, to remind us of the stuff that keeps us living.\nreview By Larry Fitzmaurice (8.5/10)\n\n\n\nTrack List:\n01. The Mother We Share (3:11)\n02. We Sink (3:34)\n03. Gun (3:53)\n04. Tether (4:46)\n05. Lies (3:41)\n06. Under the Tide (4:32)\n07. Recover (3:45)\n08. Night Sky (3:51)\n09. Science/Visions (3:58)\n10. Lungs (3:02)\n11. By the Throat (4:09)\n12. You Caught the Light (5:40)\n13. Strong Hand (3:25)\n14. Broken Bones (3:18)\n\nSpecial Edition Bonus Tracks:\n15. Gun (KDA Remix) (6:15)\n16. The Mother We Share (We Were Promised Jetpacks Remix) (5:58)\n\n\n\n\n\nSummary:\nCountry: Scotland\nGenre: Synthpop\n\n\n\n\nMedia Report:\nSource : CD\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec\nBit rate mode : Variable\nBit rate : ~1600-1700 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nBit depth : 16 bits\n\n","torrent":{"xt":"urn:btih:fa26904ce5c0f455e37ece999319b0aab5486c89","amp;dn":"%282013%29+Chvrches+-+The+Bones+of+What+You+Believe+%5BFLAC%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa26904ce5c0f455e37ece999319b0aab5486c89","infoHashBuffer":{"type":"Buffer","data":[250,38,144,76,229,192,244,85,227,126,206,153,147,25,176,170,181,72,108,137]},"announce":[],"urlList":[]}}