{"title":"At the Jazz Band Ball: Sixty Years on the Jazz Scene","uid":8310057,"size":2023311,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa94eed09492670e8d8a81fd34c47eae2547b4fc&amp;dn=At+the+Jazz+Band+Ball%3A+Sixty+Years+on+the+Jazz+Scene&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tmPhoneix","files":1,"time":1364459769,"description":"Book Description\nPublication Date: June 1, 2010\nNat Hentoff, renowned jazz critic, civil liberties activist, and fearless contrarian--&quot;I'm a Jewish atheist civil-libertarian pro-lifer&quot;--has lived through much of jazz's history and has known many of jazz's most important figures, often as friend and confidant. Hentoff has been a tireless advocate for the neglected parts of jazz history, including forgotten sidemen and -women. This volume includes his best recent work--short essays, long interviews, and personal recollections. From Duke Ellington and Louis Armstrong to Ornette Coleman and Quincy Jones, Hentoff brings the jazz greats to life and traces their art to gospel, blues, and many other forms of American music. At the Jazz Band Ball also includes Hentoff's keen, cosmopolitan observations on a wide range of issues. The book shows how jazz and education are a vital partnership, how free expression is the essence of liberty, and how social justice issues like health care and strong civil rights and liberties keep all the arts--and all members of society--strong.","torrent":{"xt":"urn:btih:fa94eed09492670e8d8a81fd34c47eae2547b4fc","amp;dn":"At+the+Jazz+Band+Ball%3A+Sixty+Years+on+the+Jazz+Scene","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa94eed09492670e8d8a81fd34c47eae2547b4fc","infoHashBuffer":{"type":"Buffer","data":[250,148,238,208,148,146,103,14,141,138,129,253,52,196,126,174,37,71,180,252]},"announce":[],"urlList":[]}}