{"title":"Stand.By.Me.1986.720p.x264-MoNik","uid":5287215,"size":4677873683,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:fb032aca298d27910c5ec0d4ffbec1aecc02dea1&amp;dn=Stand.By.Me.1986.720p.x264-MoNik&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thenoobish","files":3,"time":1263761809,"description":"Stand by Me\n \nGenre: Adventure | Drama\nYear: 1986\nCountry: USA\nRuntime: 89 min\nDirector: Rob Reiner\nProducers: Bruce A. Evans, Andrew Scheinman\nWritten by : Stephen King, Bruce A. Evans, Raynold Gideon\nMusic by : Jack Nitzsche\nCinematography: Thomas Del Ruth\nCast: Wil Wheaton, River Phoenix, Corey Feldman, Jerry O'Connell, Kiefer Sutherland\n\n.: Plot :.\nBased on Stephen King's novella THE BODY, director Rob Reiner's STAND BY ME is the disarmingly tender and subtly sublime story of four kids on the precipice of early adulthood who embark upon a quest. There's Gordie (Wil Wheaton), the intelligent, creative one with the obviously bright future. His best buddy, Chris (River Phoenix), hardens his image in order to hide the pain from the physical abuse he endures at home, all the while harboring the hope of escaping that image. Rounding out the foursome are Vern (Jerry O'Connell), the pudgy tagalong, and Teddy (Corey Feldman), a loyal and funny but troubled kid with a death wish. When the four boys hear about a dead body 20 miles down the railroad tracks from their small Oregon town, they clandestinely set upon the unwieldy journey to lay eyes on this rare find. Amid numerous misadventures, Gordie, Chris, Vern, and Teddy savor what may be their last chance to revel in the simple life of children; around the corner is a future that could tear them apart, not to mention a tough teen gang who desires local fame by finding the body first. Enhanced by excellent performances and an engaging plot, STAND BY ME ranks among the best of the myriad coming-of-age films to dot the 1980s cinematic landscape.","torrent":{"xt":"urn:btih:fb032aca298d27910c5ec0d4ffbec1aecc02dea1","amp;dn":"Stand.By.Me.1986.720p.x264-MoNik","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb032aca298d27910c5ec0d4ffbec1aecc02dea1","infoHashBuffer":{"type":"Buffer","data":[251,3,42,202,41,141,39,145,12,94,192,212,255,190,193,174,204,2,222,161]},"announce":[],"urlList":[]}}