{"title":"Should a Christian be a Mason? - David W. Daniels","uid":11773487,"size":1028108,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb0e9b1eb792ef232c09306e7f737b7cd8a3365e&amp;dn=Should+a+Christian+be+a+Mason%3F+-+David+W.+Daniels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427169251,"description":"\n-If you are a Mason, or are thinking of becoming one.\n-If you are not a Mason, but want to understand Masonry in the light of Christianity and the Bible.\n-If you are a Christian, and you think Masonry is completely compatible with Bible-believing Christianity.\nThis book is for you.\n\nUsing quotations from the official publications of Masonry, author David Daniels will help you to find out what Masonry teaches, compared to what the Bible says. For Christians, the Bible is our only reliable source to learn who God is, and what He wants for us, including how to get our sins forgiven and have eternal life in heaven with Him. You must be able to answer this question with confidence and understanding: &quot;Should a Christian be a Mason?&quot; To do that, we need to find out these things:\n\n-Where did Masonry come from?\n-What do Masons believe?\n-Who can we trust for our information?\n-Who is God, according to these trusted authorities?\n-Is the God of the Bible the same as the god of Masonry?\n\nBy the end of this book you will be able to answer these questions for yourself.\n\n\nAbout the author:\nDavid Daniels, B.A., M.Div., is trained in Bible, theology and linguistics. After twenty years of searching the Hebrew and Greek scriptures and studying the history of the Bible, he concluded that the King James Bible is God's preserved words in English. He is currently Research Consultant for Chick Publications","torrent":{"xt":"urn:btih:fb0e9b1eb792ef232c09306e7f737b7cd8a3365e","amp;dn":"Should+a+Christian+be+a+Mason%3F+-+David+W.+Daniels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb0e9b1eb792ef232c09306e7f737b7cd8a3365e","infoHashBuffer":{"type":"Buffer","data":[251,14,155,30,183,146,239,35,44,9,48,110,127,115,123,124,216,163,54,94]},"announce":[],"urlList":[]}}