{"title":"Real-Life X-Files (gnv64)","uid":7065639,"size":13924814,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb9d68a4c4c00961d58fccf4af89972eedcbb9b9&amp;dn=Real-Life+X-Files+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1330503366,"description":"Real-life X-files : Investigating the Paranormal\nBy Joe Nickell\nThe University Press of Kentucky | October 2001 | ISBN-10: 1567316700 | ePUB/MOBI/LIT/PDF | 13.2 mb &lt;a href=&quot;\nhttp://www.amazon.com/Investigating-Paranormal-Joe-Nickell/dp/0813122104&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Investigating-Paranormal-Joe-Nickell/dp/0813122104&lt;/a&gt;\n\nAs a former private investigator and forensic writer, Joe Nickell has spent much of his career identifying forged documents, working undercover to infiltrate theft rings, and investigating questioned deaths. Now he turns his considerable investigative skill toward the paranormal, researching the most well-known and mysterious phenomena all over the world -- spontaneous human combustion, UFO visitations, auras, electronic poltergeists, and many, many more -- with an eye toward solving these mysteries rather than promoting or dismissing them.\nReal-Life X-Files: Investigating the Paranormal examines the cases of over forty paranormal mysteries. Using a hands-on approach, Nickell visits the scene of the so-called unexplainable activity whenever possible and attempts to physically duplicate the miraculous. Whether he's inflicting stigmata on himself or recreating the liquefying blood of Saint Januarius, Nickell does whatever necessary to eliminate the probable before considering the supernatural. What is left is that much more fascinating.\nNickell reports on familiar legends from American history such as the supernatural events surrounding Abraham Lincoln's death and the supposed crash landing of an alien spacecraft near Roswell, New Mexico. He closely examines claims of the miraculous, from rose petals bearing the likeness of Jesus to photographs of a &quot;golden door&quot; to heaven. Controversial mysteries such as clairvoyance and &quot;spirit painting,&quot; haunted places, and freaks of nature are just a few of the many topics covered.\nSuspenseful, engrossing, funny, and grounded in scientific methodology, Real-Life X-Files provides real explanations for the &quot;paranormal&quot; activities that have intrigued human beings for centuries.","torrent":{"xt":"urn:btih:fb9d68a4c4c00961d58fccf4af89972eedcbb9b9","amp;dn":"Real-Life+X-Files+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb9d68a4c4c00961d58fccf4af89972eedcbb9b9","infoHashBuffer":{"type":"Buffer","data":[251,157,104,164,196,192,9,97,213,143,204,244,175,137,151,46,237,203,185,185]},"announce":[],"urlList":[]}}