{"title":"Fyra nyanser av brunt [Four Shades of Brown] (2004) ","uid":6666539,"size":12181381120,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:fc3b51694cf28a5830db58622d0a521d0d5b8a54&amp;dn=Fyra+nyanser+av+brunt+%5BFour+Shades+of+Brown%5D+%282004%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"oddeven","files":-1,"time":1315707363,"description":"This has been uploaded here in a few different forms, none uncompressed (it is a three hour film) and many of them seemingly dead. I thought it would be worth offering again, as it is quite a worthy film.\n\nFour stories that don't really interlock in any noticeable way.  Even the few actors that play multiple roles are barely recognizable. Trying to connect the title to the four stories was a bit of a struggle, which I eventually gave up.  I thought for a while it was going to be about four members of the Brunn family, then four generations of said family. Some interpretations say that brown is the color of fascism, and each of the stories describes some sort of family form of fascism.  I'd say that is stretching it a bit, but it could well be the intention behind it.\n\nThe four stories were eventually, in 2005, extended and broadcast separately.\n\nThere is, it has to be said, a fun play on colors here. There is an extra that describes how all of the colors came from Munch (seemingly a single painting), which I think, even if it is true, is a bit of trivia, not really useful at all.\n\nThe subtitles are only available for the feature film.  The extras are spread on the two discs, and the film is divided equally.\n\nYes, this is large.  If you commit to downloading it, please consider sticking around to seed it back.\n\nUncompressed PAL DVD9 VIDEO_TS files","torrent":{"xt":"urn:btih:fc3b51694cf28a5830db58622d0a521d0d5b8a54","amp;dn":"Fyra+nyanser+av+brunt+%5BFour+Shades+of+Brown%5D+%282004%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc3b51694cf28a5830db58622d0a521d0d5b8a54","infoHashBuffer":{"type":"Buffer","data":[252,59,81,105,76,242,138,88,48,219,88,98,45,10,82,29,13,91,138,84]},"announce":[],"urlList":[]}}