{"title":"Polymer Nanocomposites - Towards Multi-Functionality","uid":15409197,"size":13360367,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd1a5000d361cdd142db85081b6f15cd8055d951&amp;dn=Polymer+Nanocomposites+-+Towards+Multi-Functionality&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469541921,"description":"Polymer Nanocomposites - Towards Multi-Functionality - A. Dasari et al. (Springer, 2016).pdf\r\n\r\nPolymer nanocomposites, a representative class of nanostructured materials have the potential to show superior multi-functional properties even at low filler loadings compared to conventional macro- and micro-composites. This is often attributed to the availability of large numbers of nanoparticles with huge interfacial areas and the confinement of polymer matrix chains at the nano-level. These characteristics of the nano-reinforcements, if fully exploited, will result in the achievement of multi-functional (that is, unique combinations of mechanical, physical, optical, electrical, magnetic and thermal) properties required for a spectrum of applications and are unachievable with traditional materials. However, despite some promising and inspiring results with clay/carbon nanotubes (and other nanoparticles) as fillers in polymers, there are several fundamental issues which need to be resolved to tailor a combination of physical, mechanical or other functional properties of the resultant nanocomposites required for specific applications. These include the processing of nanocomposites, dispersion/distribution of nanoparticles in a matrix, surface modification and compatibility among the different phases, and controlled micro- to nano-structures and their influence on various properties.\r\n\r\nThis monograph presents the basics, as well as advanced and in-depth knowledge of polymer nanocomposites and their potential to exhibit multi-functional properties. The book also emphasizes the delineation of the parameters and mechanisms responsible for achieving multi-functionality. This monograph deals with the fundamentals and advances made in understanding the various facets of polymer nanocomposites including embrittlement/toughness, wear/scratch behaviour, thermal stability and flame retardancy, electrical and thermal conductivity, optical and magnetic properties. The significance of obtaining controlled micro- to nano-structures to achieve multi-functionality is underlined, and the book also provides an insight into and physical understanding of the mechanisms responsible for these required properties. The results, analyses and discussions presented in the book are expected to guide the development of a new class of multi-functional nanocomposites","torrent":{"xt":"urn:btih:fd1a5000d361cdd142db85081b6f15cd8055d951","amp;dn":"Polymer+Nanocomposites+-+Towards+Multi-Functionality","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd1a5000d361cdd142db85081b6f15cd8055d951","infoHashBuffer":{"type":"Buffer","data":[253,26,80,0,211,97,205,209,66,219,133,8,27,111,21,205,128,85,217,81]},"announce":[],"urlList":[]}}