{"title":"Alyas Batman en Robin","uid":8253488,"size":1310323884,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fddf6675eaf4e1e9819eeaa1e5fc1401d14b033d&amp;dn=Alyas+Batman+en+Robin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ace.The.Bat.Hound","files":2,"time":1363206190,"description":"Alyas Batman en Robin is a fanmade 1991 Filipino Batman comedy film produced by Regal Films spoofing the 1960s Batman television series. It later become popular on the Australian market and became used as a training film for The Birds are Coming Enterprises.\nIt stars comedian Joey de Leon as Batman, his son Keempee as Robin (the logo on his costume is actually the regal films logo instead of the robin logo)and Dawn Zulueta as Wonder Woman. Several villains are also featured such as the Joker and the Penguin (here Chu-p-a-enguin, literally &quot;Blowjob-guin&quot; in Spanglish, as well as a pun on &quot;Tiyo Paeng&quot;), portrayed respectively by the late comedians Rene Requiestas and Panchito Alba; this would be the former's final movie before his death on July 24 of the same year.\n\n\n\n\n\nThis is an incredibly rare movie that took me a very long time to track down. \n\nIt is in Filipino and I couldn't find the subtitles for it so if anyone finds them please send it to me so I can reupload this torrent with the Subtitles included\n\nPlease seed when you are done downloading!","torrent":{"xt":"urn:btih:fddf6675eaf4e1e9819eeaa1e5fc1401d14b033d","amp;dn":"Alyas+Batman+en+Robin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fddf6675eaf4e1e9819eeaa1e5fc1401d14b033d","infoHashBuffer":{"type":"Buffer","data":[253,223,102,117,234,244,225,233,129,158,234,161,229,252,20,1,209,75,3,61]},"announce":[],"urlList":[]}}