{"title":"Quite Honestly - John Mortimer.epub","uid":9270056,"size":258692,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff9385cd53d141d1730ca976ec87ba3fc44ed27c&amp;dn=Quite+Honestly+-+John+Mortimer.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1385757665,"description":"The creator of Rumpole of the Bailey returns to the novel with a comic tale of middle-class do-gooding gone awry\n\nThousands of readers have discovered the inimitable voice of John Mortimer through his Rumpole series of stories. But with Quite Honestly, Mortimer creates a cast of characters that rivals his usual Rumpole repertoire, delivering a wonderfully comic novel, packed with entertaining reflections on a life in crime.\n\nLife couldn't be better for Lucinda Purefoy. She's got a steady boyfriend, a degree in social sciences from Manchester University, and the offer of a high-powered job in advertising. With all this good fortune, isn't it appropriate for her to give something back to society?\n\nWith her newly minted membership in Social Carers, Reformers, and Praeceptors (SCRAP for short), an organization that recruits women to become the guides, philosophers, and friends to ex-convicts coming out of prison, Lucy finds herself standing outside the gates of Wormwood Scrubs waiting to greet a career burglar called Terry Keegan. What happens next- after a short and hostile trip to Burger King-confounds expectations and produces a signature Mortimer tale full of wit and surprise.","torrent":{"xt":"urn:btih:ff9385cd53d141d1730ca976ec87ba3fc44ed27c","amp;dn":"Quite+Honestly+-+John+Mortimer.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff9385cd53d141d1730ca976ec87ba3fc44ed27c","infoHashBuffer":{"type":"Buffer","data":[255,147,133,205,83,209,65,209,115,12,169,118,236,135,186,63,196,78,210,124]},"announce":[],"urlList":[]}}